{
  "exam_papers": [
    {
      "id": 2,
      "exam_type": "CET-4",
      "year": 2021,
      "month": 6,
      "paper_number": 2,
      "title": "2021年6月大学英语四级考试真题（二）",
      "description": "2021年6月大学英语四级考试真题（第二套），包含写作、听力、阅读理解和翻译四个部分",
      "total_score": 710,
      "time_allowed": 125,
      "questions_count": 57,
      "sections_count": 8,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_sections": [
    {
      "id": 9,
      "paper_id": 2,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to write an essay titled \"Is technology making people lazy?\". The statement given below is for your reference. You should write at least 120 words but no more than 180 words.",
      "passage_content": "Many studies claim that computers distract people, make them lazy thinkers and even lower their work efficiency.",
      "passage_title": "Is technology making people lazy?",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 10,
      "paper_id": 2,
      "section_type": "listening",
      "section_name": "听力部分 - Section A",
      "section_order": 1,
      "time_allowed": 25,
      "directions": "In this section, you will hear three news reports. At the end of each news report, you will hear two or three questions. Both the news report and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 7,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 11,
      "paper_id": 2,
      "section_type": "listening",
      "section_name": "听力部分 - Section B",
      "section_order": 2,
      "time_allowed": 25,
      "directions": "In this section, you will hear two long conversations. At the end of each conversation, you will hear four questions. Both the conversation and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 8,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 12,
      "paper_id": 2,
      "section_type": "listening",
      "section_name": "听力部分 - Section C",
      "section_order": 3,
      "time_allowed": 25,
      "directions": "In this section, you will hear three passages. At the end of each passage, you will hear three or four questions. Both the passage and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 13,
      "paper_id": 2,
      "section_type": "reading",
      "section_name": "阅读理解 - Section A",
      "section_order": 4,
      "time_allowed": 40,
      "directions": "In this section, there is a passage with ten blanks. You are required to select one word for each blank from a list of choices given in a word bank following the passage. Read the passage through carefully before making your choices. Each choice in the bank is identified by a letter. Please mark the corresponding letter for each item on Answer Sheet 2 with a single line through the centre. You may not use any of the words in the bank more than once.",
      "passage_content": "Social isolation poses more health risks than obesity or smoking 15 cigarettes a day, according to research published by Brigham Young University. The implication is that loneliness is a huge, if silent, risk factor.\n\nLoneliness affects physical health in two ways. First, it produces stress hormones that can lead to many health problems. Second, people who live alone are less likely to go to the doctor appointments, to exercise or to eat a healthy diet.\n\nPublic health experts in many countries are debating how to address widespread loneliness in our society. Last year Britain even appointed a minister for loneliness. \"Loneliness touches almost every one of us at some point,\" its minister for loneliness Baroness Barran said. \"It can lead to very serious health consequences for individuals who become isolated and disconnected.\"\n\nBarran started a \"Let's Talk Loneliness\" campaign that sparked difficult conversations across Britain. He is now supporting \"friendly benches,\" which are public seating areas where people are encouraged to go and chat with one another. The minister is also pushing to stop public transportation from being cut in ways that leave people isolated.\n\nMore than one-fifth of adults in both the United States and Britain said in a 2018 survey that they often or always feel lonely. More than half of American adults are unmarried, and researchers have found that even among those who are married, 30% of relationships are severely strained. A quarter of Americans now live alone, and as the song says, one is the loneliest number.",
      "passage_title": "The Health Risks of Loneliness",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 14,
      "paper_id": 2,
      "section_type": "reading",
      "section_name": "阅读理解 - Section B",
      "section_order": 5,
      "time_allowed": 40,
      "directions": "In this section, you are going to read a passage with ten statements attached to it. Each statement contains information given in one of the paragraphs. Identify the paragraph from which the information is derived. You may choose a paragraph more than once. Each paragraph is marked with a letter. Answer the questions by marking the corresponding letter on Answer Sheet 2.",
      "passage_content": "A. Numbers do not exist in all cultures. There are numberless hunter-gatherers in Amazonia, living along branches of the world's largest river tree. Instead of using words for precise quantities, these people rely exclusively on terms similar to \"a few\" or \"some.\" In contrast, our own lives are governed by numbers. As you read this, you are likely aware of what time it is, how old you are, your checking account balance, your weight and so on. The exact numbers we think with impact everything in our lives.\n\nB. But, in a historical sense, number-conscious people like us are the unusual ones. For the bulk of our species' approximately 200,000-year lifespan, we had no means of precisely representing quantities. What's more, the 7,000 or so languages that exist today vary dramatically in how they utilize numbers.\n\nC. Speakers of anumeric, or numberless, languages offer a window into how the invention of numbers reshaped the human experience. Cultures without numbers, or with only one or two precise numbers, include the Munduruku and Pirahā in Amazonia. Researchers have also studied some adults in Nicaragua who were never taught number words. Without numbers, healthy human adults struggle to precisely distinguish and recall quantities as low as four. In an experiment, a researcher will place nuts into a can one at a time and then remove them one by one. The person watching is asked to signal when all the nuts have been removed. Responses suggest that anumeric people have some trouble keeping track of how many nuts remain in the can, even if there are only four or five in total.\n\nD. This and many other experiments have led to a simple conclusion: When people do not have number words, they struggle to make quantitative distinctions that probably seem natural to someone like you or me. While only a small portion of the world's languages are anumeric or nearly anumeric, they demonstrate that number words are not a human universal.\n\nE. It is worth stressing that these anumeric people are cognitively normal, well-adapted to the surroundings they have dominated for centuries. As a child, I spent some time living with anumeric people, the Pirahā who live along the banks of the black Maici River. Like other outsiders, I was continually impressed by their superior understanding of the ecology we shared. Yet numberless people struggle with tasks that require precise discrimination between quantities. Perhaps this should be unsurprising. After all, without counting, how can someone tell whether there are, say, seven or eight coconuts in a tree? Such seemingly straightforward distinctions become blurry through numberless eyes.\n\nF. This conclusion is echoed by work with anumeric children in industrialized societies. Prior to being spoon-fed number words, children can only approximately discriminate quantities beyond three. We must be handed the cognitive tools of numbers before we can consistently and easily recognize higher quantities. In fact, acquiring the exact meaning of number words is a painstaking process that takes children years. Initially, kids learn numbers much like they learn letters. They recognize that numbers are organized sequentially, but have little awareness of what each individual number means. With time, they start to understand that a given number represents a quantity greater by one than the number coming before it. This \"successor principle\" is part of the foundation of our numerical cognition, but requires extensive practice to understand.\n\nG. None of us, then, is really a \"numbers person.\" We are not born to handle quantitative distinctions skillfully. In the absence of the cultural traditions that fill our lives with numbers from infancy, we would all struggle with even basic quantitative distinctions. Number words and their written forms transform our quantitative reasoning as they are introduced into our cognitive experience by our parents, peers and school teachers. The process seems so normal that we sometimes think of it as a natural part of growing up, but it is not. Human brains come equipped with certain quantitative instincts that are refined with age, but these instincts are very limited.\n\nH. Compared with other mammals, our numerical instincts are not as remarkable as many assume. We even share some basic instinctual quantitative reasoning with distant non-mammalian relatives like birds. Indeed, work with some other species suggests they too can refine their quantitative thought if they are introduced to the cognitive power tools we call numbers.\n\nI. So, how did we ever invent \"unnatural\" numbers in the first place? The answer is, literally, at your fingertips. The bulk of the world's languages use base-10, base-20 or base-5 number systems. That is, these smaller numbers are the basis of larger numbers. English is a base-10 or decimal language, as evidenced by words like 14 (\"four\" + \"10\") and 31 (\"three\" × \"10\" + \"one\"). We speak a decimal language because an ancestral tongue, proto-Indo-European, was decimally based. Proto-Indo-European was decimally oriented because, as in so many cultures, our ancestors' hands served as the gateway to the realization that \"five fingers on one hand is the same as five fingers on the other.\" Such momentary thoughts were represented in words and passed down across generations. This is why the word \"five\" in many languages is derived from the word for \"hand.\" Most number systems, then, are the by-product of two key factors: the human capacity for language and our inclination for focusing on our hands and fingers. This manual fixation—an indirect by-product of walking upright on two legs—has helped yield numbers in most cultures, but not all.\n\nJ. Cultures without numbers also offer insight into the cognitive influence of particular numeric traditions. Consider what time it is. Your day is ruled by minutes and seconds, but these concepts are not real in any physical sense and are nonexistent to numberless people. Minutes and seconds are the verbal and written representations of an uncommon base-60 number system used in ancient Mesopotamia. They reside in our minds, numerical artifacts that not all humans inherit conceptually.\n\nK. Research on the language of numbers shows, more and more, that one of our species' key characteristics is tremendous linguistic and cognitive diversity. If we are to truly understand how much our cognitive lives differ cross-culturally, we must continually explore the depths of our species' linguistic diversity.",
      "passage_title": "What happens when a language has no words for numbers?",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 15,
      "paper_id": 2,
      "section_type": "reading",
      "section_name": "阅读理解 - Section C",
      "section_order": 6,
      "time_allowed": 40,
      "directions": "There are 2 passages in this section. Each passage is followed by some questions or unfinished statements. For each of them there are four choices marked A), B), C) and D). You should decide on the best choice and mark the corresponding letter on Answer Sheet 2 with a single line through the centre.",
      "passage_content": "Passage One\n\nSugar shocked. That describes the reaction of many Americans this week following revelations that, 50 years ago, the sugar industry paid Harvard scientists for research that shifted the focus away from sugar's role in heart disease—and put the spotlight squarely on dietary fat.\n\nWhat might surprise consumers is just how many present-day nutrition studies are still funded by the food industry. Nutrition scholar Marion Nestle of New York University spent a year informally tracking industry-funded studies on food. \"Roughly 90% of nearly 170 studies favored the sponsor's interest,\" Nestle tells us. Other systematic reviews support her conclusions.\n\nFor instance, studies funded by Welch Foods—the brand behind Welch's 100% Grape Juice—found that drinking Concord grape juice daily may boost brain function. Another, funded by Quaker Oats, concluded, as a Daily Mail story put it, that \"hot oatmeal breakfast keeps you full for longer.\"\n\nLast year, The New York Times revealed how Coca-Cola was funding well-known scientists and organizations promoting a message that, in the battle against weight gain, people should pay more attention to exercise and less to what they eat and drink. Coca-Cola also released data detailing its funding of several medical institutions and associations between 2010 and 2015.\n\n\"It's certainly a problem that so much research in nutrition and health is funded by industry,\" says Bonnie Liebman, director of nutrition at the Center for Science in the Public Interest. \"When the food industry pays for research, it often gets what it pays for.\" And what it pays for is often a pro-industry finding.\n\nGiven this new comment, consumers should be skeptical when reading the latest finding-in-nutrition science and ignore the latest study that pops up on your news feed. \"Rely on health experts who've reviewed all the evidence,\" Liebman says, pointing to the official government Dietary Guidelines, which are based on reviews of hundreds of studies.\n\n\"And that expert advice remains pretty simple,\" says Nestle. \"We know what healthy diets are—lots of vegetables, not too much junk food, balanced calories. Everything else is really difficult to do experimentally.\"\n\nPassage Two\n\nSuccess was once defined as being able to stay at a company for a long time and move up the corporate ladder. The goal was to reach the top, accumulate wealth and retire to a life of ease. My father is a successful senior executive. In 35 years, he worked for only three companies.\n\nWhen I started my career, things were already different. If you weren't changing companies every three or four years, you simply weren't getting ahead in your career. But back then, if you were a consultant or freelancer, people would wonder what was wrong with you. They would assume you had problems getting a job.\n\nToday, consulting or freelancing for five businesses at the same time is a badge of honor. It shows how valuable an individual is. Many companies now look to these \"ultimate professionals\" to solve problems their full-time teams can't. Or they save money by hiring \"top-tier experts\" only for particular projects.\n\nWorking at home or in cafes, starting businesses of their own, and even launching business ventures that eventually may fail, all indicate \"initiative,\" \"creativity,\" and \"adaptability,\" which are desirable qualities in today's workplace. Most important, there is a growing recognition that people who balance work and play, and who work at what they are passionate about, are more focused and productive, delivering greater value to their clients. Who are these people? They are artists, writers, programmers, providers of office services and career advice. What's needed now is a marketplace platform specifically designed to bring freelancers and clients together. Such platforms then become a place to feature the most experienced, professional, and creative talent. This is where they conduct business, where a sense of community reinforces the culture and values of the gig economy, and where success is rewarded with good reviews that encourage more business. Slowly but surely, these platforms create a bridge between traditional enterprises and this emerging economy. Perhaps more important, as the global economy continues to be disrupted by technology and other massive change, the gig economy will itself become an engine of economic and social transformation.",
      "passage_title": "",
      "passage_type": "reading",
      "has_multiple_passages": 1,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 16,
      "paper_id": 2,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 7,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "普洱(Pu'er)茶深受中国人喜爱。最好的普洱茶产自云南的西双版纳(Xishuangbanna)，那里的气候和环境为普洱茶树的生长提供了最佳条件。普洱茶颜色较深，味道与其他许多茶截然不同。普洱茶泡(brew)的时间越长越有味道。许多爱喝茶的人尤其喜欢其独特的香味和口感。普洱茶含有多种有益健康的元素，常饮普洱茶有助于保护心脏和血管，还有减肥、消除疲劳和促进消化的功效。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_questions": [
    {
      "id": 58,
      "section_id": 9,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write an essay titled \"Is technology making people lazy?\" based on the given reference statement.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "写作题目，需要学生根据参考陈述写一篇关于科技是否让人变懒的议论文",
      "explanation": "考查学生的议论文写作能力，包括论点阐述、论证支持和结论总结",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 59,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 1,
      "question_text": "What did the old age pensioner plan to do?",
      "options": "[\"A) See the Pope.\", \"B) Go to Newcastle.\", \"C) Travel to Germany.\", \"D) Tour an Italian city.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。新闻开头指出，一名81岁的老人试图从英国纽卡斯尔去意大利罗马，他是为了去见天主教会的教皇。因此，答案为A）。",
      "explanation": "新闻中提到：'The old age pensioner was on a mission to see the Pope, who is head of the Catholic Church, and decided to make his way there by car.'",
      "question_order": 0,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 60,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 2,
      "question_text": "What finally happened to the old man?",
      "options": "[\"A) He was taken to hospital in an ambulance.\", \"B) His car hit a sign and was badly damaged.\", \"C) His GPS system went out of order.\", \"D) He ended up in the wrong place.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。新闻开头提到，老人试图从英国纽卡斯尔去意大利罗马，却最终意外地到了德国。由此可知，他最终到错了地方，故答案为D)。",
      "explanation": "新闻中提到：'An 81-year-old man ended up in Germany by accident after trying to get from Newcastle, Great Britain, to Rome, Italy.'",
      "question_order": 1,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 61,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 3,
      "question_text": "What do we learn from the news report?",
      "options": "[\"A) Scotland will reach the national target in carbon emissions reduction ahead of schedule.\", \"B) Glasgow City Council has made a deal with ScottishPower on carbon emissions.\", \"C) Glasgow has pledged to take the lead in reducing carbon emissions in the UK.\", \"D) First Minister Nicola Sturgeon urged ScottishPower to reduce carbon emissions.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。新闻开头提到，格拉斯哥承诺要成为英国第一个碳中和城市，并通过一系列的措施减少碳排放。因此，答案为C。",
      "explanation": "新闻中提到：'Glasgow has pledged to become the first carbon neutral city in the UK.'",
      "question_order": 2,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 62,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 4,
      "question_text": "What did ScottishPower's chief executive say?",
      "options": "[\"A) Glasgow needs to invest in new technologies to reach its goal.\", \"B) Glasgow is going to explore new sources of renewable energy.\", \"C) Stricter regulation is needed in transforming Glasgow's economy.\", \"D) It's necessary to create more low-emission zones as soon as possible.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。新闻中提到，苏格兰电力公司首席执行官基思·安德森表示，格拉斯哥需要投资新技术来改造经济，以实现净零排放目标。",
      "explanation": "新闻中提到：'Now, we need to invest in the technologies and programmes that transform the rest of Glasgow's economy and make us net zero before anyone else.'",
      "question_order": 3,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 63,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 5,
      "question_text": "What do we learn from the news report about the Japanese IT firm?",
      "options": "[\"A) It donates money to overpopulated animal shelters.\", \"B) It permits employees to bring cats into their office.\", \"C) It gives 5,000 yen to employees who keep pet cats.\", \"D) It allows workers to do whatever their hearts desire.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。新闻开头提到，日本一家IT公司正式推出了一项\"办公室猫\"政策，以改善紧张的工作环境。根据这一政策，这家公司允许员工把自己的猫带进办公室，因此答案为B)。",
      "explanation": "新闻中提到：'A Japanese IT firm has officially introduced an \"office cat\" policy to combat the stressful environment of the workplace.'",
      "question_order": 4,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 64,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 6,
      "question_text": "What does Fukuda encourage his employees to do?",
      "options": "[\"A) Keep cats off the street.\", \"B) Rescue homeless cats.\", \"C) Volunteer to help in animal shelters.\", \"D) Contribute to a fund for cat protection.\"]",
      "correct_answer": "B",
      "analysis": "细节推断题。新闻中提到福田不仅鼓励员工带着猫工作，还鼓励员工从动物数量过多的动物收容所或大街上救助猫。此处在收容所和大街上的猫都可以理解为无家可归的猫，因此答案为B)。",
      "explanation": "新闻中提到：'Not only does Fukuda encourage bringing cats to the job, but he also encourages his employees to rescue cats from overpopulated shelters or streets.'",
      "question_order": 5,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 65,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 7,
      "question_text": "What does the news report say about the firm's policy?",
      "options": "[\"A) It has contributed tremendously to the firm's fame.\", \"B) It has helped a lot to improve animals' well-being.\", \"C) It has led some other companies to follow suit.\", \"D) It has resulted in damage to office equipment.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。新闻最后肯定了\"办公室猫\"政策的积极影响，认为带猫上班对于公司来说是一项巨大的成功，其他公司也纷纷效仿这一政策，因此答案为C)。",
      "explanation": "新闻中提到：'Still, cats in the workplace have been a tremendous success for the company. The policy has led to various other companies doing the same.'",
      "question_order": 6,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 66,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 8,
      "question_text": "What does the man want to do?",
      "options": "[\"A) Find out where Jimmy is.\", \"B) Borrow money from Jimmy.\", \"C) Make friends with Jimmy.\", \"D) Ask Jimmy what is to be done.\"]",
      "correct_answer": "A",
      "analysis": "细节推断题。对话开头，男士向女士询问吉米的下落，并向女士解释自己和朋友借给吉米一些钱，但是已经一个月没有他的消息了。由此可知，男士是在找吉米，因此答案为A)。",
      "explanation": "对话开头：'Has Jimmy been coming in lately?' 随后解释需要找吉米的原因。",
      "question_order": 7,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 67,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 9,
      "question_text": "What do we learn about the man who came to see the woman yesterday?",
      "options": "[\"A) He was unsure what kind of fellow Jimmy was.\", \"B) He was working on a study project with Jimmy.\", \"C) He wanted to make a sincere apology to Jimmy.\", \"D) He wanted to invite her to join in a study project.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。对话中，女士了解男士的来意后，向他提起昨天也有人来找吉米，那个人和吉米正在做一个研究项目，因此答案为B)。",
      "explanation": "对话中提到：'Some other fellow came in asking for Jimmy just yesterday, a real nervous, pushy type of fellow, saying he needed Jimmy for some study project they were working on.'",
      "question_order": 8,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 68,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 10,
      "question_text": "What did Jimmy say happen to him one day?",
      "options": "[\"A) He got a ticket for speeding.\", \"B) He got his car badly damaged.\", \"C) He was involved in a traffic accident.\", \"D) He had an operation for his injury.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。对话中，男士提及吉米曾告诉他自己出了车祸，C)选项中的was involved in有\"卷入,涉及\"之意，和原文表达相符，因此答案为C)。",
      "explanation": "对话中提到：'He told us he'd got into an accident. Nothing serious, mind you, but he damaged someone's car and wanted to get some money together to make up for the damage he'd caused.'",
      "question_order": 9,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 69,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 11,
      "question_text": "Why did Jimmy borrow money according to the man?",
      "options": "[\"A) He needed to make some donation to charity.\", \"B) He found the 60 pounds in his pocket missing.\", \"C) He wanted to buy a gift for his mother's birthday.\", \"D) He wanted to conceal something from his parents.\"]",
      "correct_answer": "D",
      "analysis": "细节推断题。对话末尾男士猜测吉米可能不想让父母知道发生的事情，所以宁愿向他们借钱并保密。",
      "explanation": "对话中提到：'But I thought maybe he doesn't want his parents to know about what happened. So he'd rather come to us and keep things quiet.'",
      "question_order": 10,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 70,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 12,
      "question_text": "What did the woman want to ask Max about?",
      "options": "[\"A) Shopping delivery.\", \"B) Shopping online.\", \"C) Where he goes shopping.\", \"D) How often he does shopping.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。对话开头女士开门见山，直接表明自己想咨询网上购物的相关问题，因此答案为B)。",
      "explanation": "对话开头：'I wanted to ask you about ordering shopping online.'",
      "question_order": 11,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 71,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 13,
      "question_text": "What does the man think is a problem with shopping in supermarkets?",
      "options": "[\"A) Searching in the aisles.\", \"B) Dealing with the traffic.\", \"C) Driving too long a distance.\", \"D) Getting one's car parked.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。对话中男士向女士介绍网上购物使自己的生活变得简单，不需要在雨中提沉重的购物袋，也不用面对费力把车停到大超市停车场后，购物出来找不到车的窘状，对比四个选项,D)选项符合原文的表达，因此答案为D)。",
      "explanation": "对话中提到：'no carrying heavy shopping bags in the rain, or trying to park the car on those huge supermarket car parks then not being able to find it again after you come out of the shops.'",
      "question_order": 12,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 72,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 14,
      "question_text": "What is the woman's concern about shopping online?",
      "options": "[\"A) The after-sales service.\", \"B) The replacement policy.\", \"C) The quality of food products.\", \"D) The damage to the packaging.\"]",
      "correct_answer": "C",
      "analysis": "细节推断题。对话中，女士认为网上购物会有一些问题，询问男士怎么知道自己不会收到坏水果或者收到碎鸡蛋。由此可知，女士担心网上购物会出现食品质量问题，因此答案为C)。",
      "explanation": "对话中提到：'But there must be some problems. I mean, how do you know that you won't get bad fruit, or that the eggs won't be broken?'",
      "question_order": 13,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 73,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 15,
      "question_text": "What does the man find about shopping online?",
      "options": "[\"A) It saves money.\", \"B) It offers more choice.\", \"C) It increases the joy of shopping.\", \"D) It is less time-consuming.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。对话末尾，女士询问男士快递费用，担心网上购物花费高。男士表示网上购物对他来说更便宜，因为他住得离超市比较远，用快递的方式可以省下油费，因此答案为A)。",
      "explanation": "对话中提到：'I actually found that it was cheaper for me, as I live quite far away from my local supermarket. So with the deliveries, I'm actually saving on petrol.'",
      "question_order": 14,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 74,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 16,
      "question_text": "What did a recent study find about some British children?",
      "options": "[\"A) They have little talent for learning math.\", \"B) They need medical help for math anxiety.\", \"C) They need extra help to catch up in the math class.\", \"D) They have strong negative emotions towards math.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。短文开头指出，最近的一项研究发现，10%的英国儿童患有数学焦虑。这意味着他们对这门学科有着从愤怒到绝望的强烈的消极情绪，由数学触发的情绪还包括紧张和沮丧，体征表现为心跳加速或呼吸困难。因此，答案为D)。",
      "explanation": "短文中提到：'A recent study found that 10 percent of British children suffer from math anxiety. This means they have overwhelming negative emotions towards the subject, ranging from rage to despair.'",
      "question_order": 15,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 75,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 17,
      "question_text": "What is the widespread misunderstanding about math anxiety?",
      "options": "[\"A) It will gradually pass away without teachers' help.\", \"B) It affects low performing children only.\", \"C) It is related to a child's low intelligence.\", \"D) It exists mostly among children from poor families.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。短文中提到，存在一个普遍的误解，认为只有成绩差的孩子才会患有数学焦虑。",
      "explanation": "短文中提到：'There's a widespread misunderstanding that only low performing children suffer from math anxiety.'",
      "question_order": 16,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 76,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 18,
      "question_text": "What do we learn about children with math anxiety?",
      "options": "[\"A) Most of them have average to strong math ability.\", \"B) Most of them get timely help from their teachers.\", \"C) They will regain confidence with counselling.\", \"D) They are mostly secondary school students.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。短文末尾提到，这项新研究表明，大多数经历数学焦虑的学生都有正常到较高的数学能力。",
      "explanation": "短文中提到：'But importantly—and surprisingly—this new study suggests that the majority of students experiencing math anxiety have normal to high math ability.'",
      "question_order": 17,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 77,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 19,
      "question_text": "What conclusion has the World Health Organization come to recently?",
      "options": "[\"A) Social media addiction is a threat to our health.\", \"B) Too many people are addicted to smartphones.\", \"C) Addiction to computer games is a disease.\", \"D) Computer games can be rather addictive.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。短文开头指出，人们花大量时间玩手机和电脑游戏，家长和老师担心这些游戏会使人上瘾；接着指出，世界卫生组织已经认定电脑游戏成瘾是一种疾病。因此答案为C)。",
      "explanation": "短文中提到：'And now, the World Health Organization has recognized addiction to computer games as a disease.'",
      "question_order": 18,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 78,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 20,
      "question_text": "What is said of people with addictive behavior?",
      "options": "[\"A) They prioritize their favored activity over what they should do.\", \"B) They do their favored activity whenever and wherever possible.\", \"C) They are unaware of the damage their behavior is doing to them.\", \"D) They are unable to get rid of their addiction without professional help.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。短文提到，世界卫生组织指出，世界各地专家普遍认为有些人对于玩游戏会表现出一种缺乏控制的行为模式，他们把电脑游戏置于自己的责任之上，他们可能只玩游戏，而不去上学、工作或社交。A)选项中的favored activity对应文中的computer games,选项中what they should do则对应their responsibilities,因此答案为A)。",
      "explanation": "短文中提到：'Such people make computer games a priority over their responsibilities. They may play games instead of attending school, or work, or socializing.'",
      "question_order": 19,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 79,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 21,
      "question_text": "What do some behavior experts think of addiction to computer games?",
      "options": "[\"A) It may be less damaging than previously believed.\", \"B) There will never be agreement on its harm to people.\", \"C) It may prove to be beneficial to developing creativity.\", \"D) There is not enough evidence to classify it as a disease.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。短文最后指出，并非所有行为专家都同意电脑游戏成瘾是种疾病的说法，有些人认为这方面的研究还不够，他们认为将电脑游戏成瘾称为一种疾病还为时过早。因此答案为D)。",
      "explanation": "短文中提到：'Still not all behavior experts agree. Some argue that there's not enough research on the subject. Thus, they claim it is too early to call computer game addiction a disorder.'",
      "question_order": 20,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 80,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 22,
      "question_text": "What do we learn about most European passports?",
      "options": "[\"A) They are relatively uniform in color and design.\", \"B) They appear more formal than other passports.\", \"C) They are a shade of red bordering on brown.\", \"D) They vary in color from country to country.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。短文开头提到，各国护照以红色、蓝色、绿色或黑色为主，接着举例指出多数欧洲国家的护照更喜欢使用近似棕色的红色，因此答案为C。",
      "explanation": "短文中提到：'while most European countries prefer a shade of red. That's almost brown.'",
      "question_order": 21,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 81,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 23,
      "question_text": "What does the passage say about the design of passports?",
      "options": "[\"A) They must endure wear and tear.\", \"B) They must be of the same size.\", \"C) They must be made from a rare material.\", \"D) They must follow some common standards.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。短文提到，对于护照的颜色没有官方规定，但是各国在设计护照时会遵循一定的标准，因此答案为D)。",
      "explanation": "短文中提到：'There are no official rules regarding passport colors, but countries follow a certain set of norms when designing them.'",
      "question_order": 22,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 82,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 24,
      "question_text": "Why are dark colors chosen for passport covers?",
      "options": "[\"A) They look more traditional.\", \"B) They look more official.\", \"C) They are favored by airlines.\", \"D) They are easily identifiable.\"]",
      "correct_answer": "B",
      "analysis": "目的原因题。短文提到，各个国家坚持护照封面使用深色和更保守的颜色，因为它们看起来更正式，因此答案为B)。",
      "explanation": "短文中提到：'Simply put, countries stick to darker and more conservative colors because they appear more official.'",
      "question_order": 23,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 83,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 25,
      "question_text": "What is one special function of the images inside many passports?",
      "options": "[\"A) For beauty.\", \"B) For variety.\", \"C) For visibility.\", \"D) For security.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。短文最后提到，许多国家的护照上可以使用本国著名的地理特征和野生动物的图像，这些图像可以作为安全特征，因为有些图像只有在特殊的光线下才能看到，因此答案为D)。",
      "explanation": "短文中提到：'The passports of many countries can take images of their well-known geographical features and wildlife, which also function as security features as some are only visible under a special light.'",
      "question_order": 24,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 84,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 26,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "I",
      "analysis": "名词辨析题。空格位于定冠词The之后，因此空格处需要填入名词。因为空格后的系动词是单数，因此本空应填入不可数名词或可数名词单数形式。本句意为：______孤独是一个巨大的风险因素，尽管它是无声的。由上一句可知，与社会隔绝带来的健康风险比肥胖或每天吸15支烟更大，这说明孤独是一个巨大的风险因素，因此空格处应填入含有\"说明，表明\"意义的名词，故本题答案为I) implication。",
      "explanation": "根据上下文，社会隔离比肥胖或吸烟风险更大，这意味着孤独是一个巨大的风险因素。",
      "question_order": 25,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 85,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 27,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "B",
      "analysis": "名词辨析题。空格位于the doctor之后，推测空格所填词应为名词，且与the doctor构成名词词组。本句意为：独居的人不太可能去医生______。由句意可知，独居的人不太可能去看医生。the doctor appointments意为\"就诊预约\"，而go to the doctor appointments是固定表达，意为\"去看医生\"，故本题答案为B) appointments。",
      "explanation": "go to the doctor appointments是固定搭配，表示去看医生。",
      "question_order": 26,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 86,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 28,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "D",
      "analysis": "动词辨析题。分析句子结构可知，空格位于are之后，空格后面为\"how + 不定式\"结构，相当于名词性从句，因此空格处需要填入动词的分词形式，与are共同构成句子的谓语。本句意为：许多国家的公共卫生专家正在______如何解决社会中普遍存在的孤独问题。由前两段可知，孤独带来很多危害，那么专家们需要研究如何解决这一问题，因此空格处应填入含有或接近\"研究\"意义的动词。备选项中只有D) debating\"讨论\"词义最接近，故为本题答案。",
      "explanation": "debating表示讨论、探讨，公共卫生专家正在讨论如何解决孤独问题。",
      "question_order": 27,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 87,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 29,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "O",
      "analysis": "动词辨析题。空格位于名词Loneliness之后，而且本句缺少谓语动词，因此空格处需要填入动词的第三人称单数形式。备选项中只有O) touches符合语法要求，将它代入句中，则句意为\"几乎每个人在某个时刻都会感到孤独\"，符合文义，因此本题答案为O) touches。",
      "explanation": "touches在这里表示影响、涉及，孤独几乎在某个时刻影响我们每个人。",
      "question_order": 28,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 88,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 30,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "C",
      "analysis": "名词辨析题。分析句子结构可知，句子主干为主谓宾结构，且宾语不完整。health与空格所填词构成名词词组，作句子的宾语。health是名词作定语，空格处所填词作为宾语中心词也应该是名词。本句意为：对于变得孤立和与世隔绝的人来说，它会导致非常严重的健康______。由第一段可知，孤独带来很大的健康风险，那么自然会引起严重的健康后果，因此空格处应填入含有\"结果，后果\"意义的名词，故本题答案为C) consequences。",
      "explanation": "consequences表示后果，孤独会导致严重的健康后果。",
      "question_order": 29,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 89,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 31,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "L",
      "analysis": "动词辨析题。分析句子结构可知，空格所在的定语从句缺少谓语，因此空格处需要填入动词。主句是一般过去时，所以从句也应该为过去时。本句意为：已经发起了一个名为\"让我们谈谈孤独\"的活动，在全英______艰难的对话。由句意可知，该活动让人们开始谈论孤独，也就是所谓的\"艰难的对话\"，因此空格处应填入含有\"引起，激起\"意义的词，故本题答案为L) sparked。",
      "explanation": "sparked表示引发、激起，这项活动引发了关于孤独的艰难对话。",
      "question_order": 30,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 90,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 32,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "F",
      "analysis": "形容词辨析题。分析句子结构可知，本句成分完整，空格位于名词benches之前，因此空格处需要填入形容词。分析句意可知，所谓的\"benches\"就是人们可以互相聊天的公共座位区域，因此空格处应填入含有积极意义的形容词，以体现出benches的积极作用，故本题答案为F) friendly。",
      "explanation": "friendly benches表示友好的长椅，鼓励人们在此聊天交流。",
      "question_order": 31,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 91,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 33,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "J",
      "analysis": "语义理解题。空格位于is之后，因此空格处需要填入形容词或动词的分词形式。本句意为：这位部长还______阻止公共交通中断，以免人们被孤立。本句中的The minister指的是英国负责孤独问题的部长，这是他为了减少孤独而采取的另外一项措施，因此空格处应填入含有或接近\"试图，努力\"意义的词，故本题答案为J pushing。",
      "explanation": "pushing表示推动、努力，部长正在努力阻止公共交通中断。",
      "question_order": 32,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 92,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 34,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "N",
      "analysis": "名词辨析题。空格位于2018之后，因此空格处需要填入可数名词的单数形式。本句意为：在2018年的一项中，美国和英国超过五分之一的成年人表示，他们经常总是感到孤独。由句意可知，空格处应填入含有\"研究，调查\"意义的名词，故本题答案为N survey。",
      "explanation": "survey表示调查，2018年的一项调查显示很多人感到孤独。",
      "question_order": 33,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 93,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 35,
      "question_text": "",
      "options": "[\"A) abruptly\", \"B) appointments\", \"C) consequences\", \"D) debating\", \"E) dimensions\", \"F) friendly\", \"G) hindered\", \"H) idiom\", \"I) implication\", \"J) pushing\", \"K) severely\", \"L) sparked\", \"M) splitting\", \"N) survey\", \"O) touches\"]",
      "correct_answer": "K",
      "analysis": "副词辨析题。空格位于系动词are和形容词strained之间，且句子成分完整，因此需要填入副词。本句意为：即使是那些已婚人士，也有30%的人关系______紧张。由句意可知，空格处应填入表示程度的副词，故本题答案为K) severely。",
      "explanation": "severely表示严重地、非常，30%的婚姻关系非常紧张。",
      "question_order": 34,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 94,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 36,
      "question_text": "It is difficult for anumeric people to keep track of the change in numbers even when the total is very small.",
      "options": "[]",
      "correct_answer": "C",
      "analysis": "同义转述题。定位句提到，他们的反应表明，没有数字概念的人很难记住罐子中还有多少坚果，尽管总数只有四个或五个。题干中的anumeric people和keep track of和原文表达方式完全一致，且题干中的change in numbers对应原文中的how many nuts remain in the can,故答案为C)。",
      "explanation": "C段最后一句：'Responses suggest that anumeric people have some trouble keeping track of how many nuts remain in the can, even if there are only four or five in total.'",
      "question_order": 35,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 95,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 37,
      "question_text": "Human numerical instincts are not so superior to those of other mammals as is generally believed.",
      "options": "[]",
      "correct_answer": "H",
      "analysis": "同义转述题。定位句指出，和其他哺乳动物相比，我们的数字本能并不像很多人想象的那样非凡。题干中的Human numerical instincts和other mammals和文中所述一致，且题干中的superior to对应原文中的remarkable,题干中的as is generally believed对应原文中的as many assume,故答案为H)。",
      "explanation": "H段第一句：'Compared with other mammals, our numerical instincts are not as remarkable as many assume.'",
      "question_order": 36,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 96,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 38,
      "question_text": "The author emphasizes being anumeric does not affect one's cognitive ability.",
      "options": "[]",
      "correct_answer": "E",
      "analysis": "细节辨认题。定位句提到，值得强调的是，这些不懂数字的人在认知方面是正常的，很好地适应了他们统治了几个世纪的环境。题干中的not affect one's cognitive ability对应原文中的cognitively normal,故答案为E)。",
      "explanation": "E段第一句：'It is worth stressing that these anumeric people are cognitively normal, well-adapted to the surroundings they have dominated for centuries.'",
      "question_order": 37,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 97,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 39,
      "question_text": "In the long history of mankind, humans who use numbers are a very small minority.",
      "options": "[]",
      "correct_answer": "B",
      "analysis": "同义转述题。定位句提到，从历史意义来看，像我们这样对数字有意识的人类是不寻常的。题干中的In the long history of mankind对应原文中的in a historical sense,题干中的a very small minority对应原文中的the unusual ones,故答案为B)。",
      "explanation": "B段第一句：'But, in a historical sense, number-conscious people like us are the unusual ones.'",
      "question_order": 38,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 98,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 40,
      "question_text": "An in-depth study of differences between human languages contributes to a true understanding of cognitive differences between cultures.",
      "options": "[]",
      "correct_answer": "K",
      "analysis": "同义转述题。定位句提到，如果我们想真正理解我们的认知生活在不同文化中有多么不同，我们就必须持续地探索人类语言多样性的深度。题干中的differences between human languages对应原文中的our species' linguistic diversity,题干中的cognitive differences between cultures对应原文中的how much our cognitive lives differ cross-culturally,故答案为K)。",
      "explanation": "K段最后一句：'If we are to truly understand how much our cognitive lives differ cross-culturally, we must continually explore the depths of our species' linguistic diversity.'",
      "question_order": 39,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 99,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 41,
      "question_text": "A conclusion has been drawn from many experiments that anumeric people have a hard time distinguishing quantities.",
      "options": "[]",
      "correct_answer": "D",
      "analysis": "同义转述题。定位句提到，这个实验和许多其他的实验得出了一个简单的结论：当人们没有数字词汇时，他们很难进行数量上的区分，尽管这些对于你我这样的人而言是非常自然的事情。题干中的experiments和conclusion均和原文一致。题干中的anumeric people对应原文中的people do not have number words,题干中的have a hard time distinguishing quantities对应原文中的struggle to make quantitative distinctions,故答案为D)。",
      "explanation": "D段第一句：'This and many other experiments have led to a simple conclusion: When people do not have number words, they struggle to make quantitative distinctions that probably seem natural to someone like you or me.'",
      "question_order": 40,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 100,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 42,
      "question_text": "Making quantitative distinctions is not an inborn skill.",
      "options": "[]",
      "correct_answer": "G",
      "analysis": "同义转述题。定位句提到，我们不是天生就能够熟练地进行定量区分。题干中的Making quantitative distinctions对应原文中的handle quantitative distinctions,题干中的not an inborn skill对应原文中的are not born to,故答案为G)。",
      "explanation": "G段第二句：'We are not born to handle quantitative distinctions skillfully.'",
      "question_order": 41,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 101,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 43,
      "question_text": "Every aspect of our lives is affected by numbers.",
      "options": "[]",
      "correct_answer": "A",
      "analysis": "同义转述题。定位句提到，我们的生活是被数字支配的。就在你读这篇文章的时候，你很可能知道现在是几点了，你多大了，你的支票账户余额，你的体重等等。我们思考所用的确切的数字影响着我们生活中的一切。题干中的every aspect of our lives对应原文中的everything in our lives,故答案为A)。",
      "explanation": "A段最后三句：'In contrast, our own lives are governed by numbers. As you read this, you are likely aware of what time it is, how old you are, your checking account balance, your weight and so on. The exact numbers we think with impact everything in our lives.'",
      "question_order": 42,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 102,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 44,
      "question_text": "Larger numbers are said to be built upon smaller numbers.",
      "options": "[]",
      "correct_answer": "I",
      "analysis": "同义转述题。定位句提到，这些小一些的数字是大一些的数字的基础。题干中的Larger numbers和smaller numbers均和原文一致，题干中的to be built upon对应原文中的are the basis of,故答案为I)。",
      "explanation": "I段第四句：'That is, these smaller numbers are the basis of larger numbers.'",
      "question_order": 43,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 103,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 45,
      "question_text": "It takes great efforts for children to grasp the concept of number words.",
      "options": "[]",
      "correct_answer": "F",
      "analysis": "细节辨认题。定位句提到，这种\"顺序原理\"是我们数字认知的基础之一，但是需要大量的练习去理解。题干中的takes great efforts对应原文中的requires extensive practice,题干中的the concept of number words对应原文中的the foundation of our numerical cognition,故答案为F)。",
      "explanation": "F段最后一句：'This \"successor principle\" is part of the foundation of our numerical cognition, but requires extensive practice to understand.'",
      "question_order": 44,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 104,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 46,
      "question_text": "What did Harvard scientists do 50 years ago?",
      "options": "[\"A) They raised public awareness of the possible causes of heart disease.\", \"B) They turned public attention away from the health risks of sugar to fat.\", \"C) They placed the sugar industry in the spotlight with their new findings.\", \"D) They conducted large-scale research on the role of sugar in people's health.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。定位句指出，50年前，制糖业资助哈佛大学科学家将研究重心从糖在心脏病中的影响，转移到了膳食脂肪。由此可见，他们把公众的注意力从糖的健康风险转移到脂肪上，故答案为B)。",
      "explanation": "首段第二句：'50 years ago, the sugar industry paid Harvard scientists for research that shifted the focus away from sugar's role in heart disease—and put the spotlight squarely on dietary fat.'",
      "question_order": 45,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 105,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 47,
      "question_text": "What does Marion Nestle say about present-day nutrition studies?",
      "options": "[\"A) They took her a full year to track and analyze.\", \"B) Most of them are based on systematic reviews.\", \"C) They depend on funding from the food industries.\", \"D) Nearly all of them serve the purpose of the funders.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。定位段第二、三句提到，纽约大学的营养学家玛丽恩·内斯特尔花了一年的时间非正式地跟踪了各种工业资助的食品研究。她指出，在将近170项研究中，大约有90%的研究都会偏袒赞助商的利益。其他系统的研究综述也支持她的结论。由此可知，几乎所有的营养研究都是为资助者服务的，D)中的Nearly all of them对应原文中的Roughly 90% of nearly 170 studies，故答案为D)。",
      "explanation": "第二段第二、三句：'Nutrition scholar Marion Nestle of New York University spent a year informally tracking industry-funded studies on food. \"Roughly 90% of nearly 170 studies favored the sponsor's interest,\" Nestle tells us.'",
      "question_order": 46,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 106,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 48,
      "question_text": "What did Coca-Cola-funded studies claim?",
      "options": "[\"A) Exercise is more important to good health than diet.\", \"B) Choosing what to eat and drink is key to weight control.\", \"C) Drinking Coca-Cola does not contribute to weight gain.\", \"D) The food industry plays a major role in fighting obesity.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。定位句指出，去年，《纽约时报》披露了可口可乐公司资助知名科学家以及组织来宣传一个信息，在对抗增重的斗争中，人们应该更加注意锻炼，少关注饮食。由此可见，由可口可乐公司资助的研究声称锻炼对于身体健康比饮食更重要，故答案为A)。",
      "explanation": "第四段第一句：'Last year, The New York Times revealed how Coca-Cola was funding well-known scientists and organizations promoting a message that, in the battle against weight gain, people should pay more attention to exercise and less to what they eat and drink.'",
      "question_order": 47,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 107,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 49,
      "question_text": "What does Liebman say about industry-funded research?",
      "options": "[\"A) It simply focuses on nutrition and health.\", \"B) It causes confusion among consumers.\", \"C) It rarely results in objective findings.\", \"D) It runs counter to the public interest.\"]",
      "correct_answer": "C",
      "analysis": "推理判断题。第五段第二、三句提到，利伯曼认为\"食品工业为研究提供资金时，通常会得到相应的回报。\"他们所支付的往往是一个利于推动该行业的发展的发现。由此可见，由食品工业资助的研究，其结果并不客观，故答案为C)。",
      "explanation": "第五段第二、三句：'\"When the food industry pays for research, it often gets what it pays for.\" And what it pays for is often a pro-industry finding.'",
      "question_order": 48,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 108,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 50,
      "question_text": "What is the author's advice to consumers?",
      "options": "[\"A) Follow their intuition in deciding what to eat.\", \"B) Be doubtful of diet experts' recommendations.\", \"C) Ignore irrelevant information on their news feed.\", \"D) Think twice about new nutrition research findings.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。定位句指出，鉴于这种环境，消费者在阅读营养科学的最新发现时应持怀疑态度，并且忽略新闻推送上弹出的最新研究。由此可见，作者的建议是对新的营养研究成果三思而后行，D)中的Think twice对应原文中的skeptical，故答案为D)。",
      "explanation": "第六段第一句：'Given this new comment, consumers should be skeptical when reading the latest finding-in-nutrition science and ignore the latest study that pops up on your news feed.'",
      "question_order": 49,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 109,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 51,
      "question_text": "What does the author use the example of his father to illustrate?",
      "options": "[\"A) How long people took to reach the top of their career.\", \"B) How people accumulated wealth in his father's time.\", \"C) How people viewed success in his father's time.\", \"D) How long people usually stayed in a company.\"]",
      "correct_answer": "C",
      "analysis": "推理判断题。定位段指出，成功曾经被定义为能在一家公司任职很长时间并获得晋升。目的是到达高位，积累财富，退休后安度晚年。第三、四句提到了作者父亲的亲身经历，用以说明该段前两句的内容，即在其父辈的年代，人们对于成功的定义是怎样的，故答案为C)。",
      "explanation": "第一段前四句：'Success was once defined as being able to stay at a company for a long time and move up the corporate ladder. The goal was to reach the top, accumulate wealth and retire to a life of ease. My father is a successful senior executive. In 35 years, he worked for only three companies.'",
      "question_order": 50,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 110,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 52,
      "question_text": "Why did people often change jobs when the author started his career?",
      "options": "[\"A) It was considered a fashion at that time.\", \"B) It was a way to advance in their career.\", \"C) It was a response to the changing job market.\", \"D) It was difficult to keep a job for long.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。定位句提到，当作者开始他的职业生涯时，事情已经不同了。如果你不是每三四年就换一家公司，那么就说明你并未在职业生涯中前进。由此可知，人们频繁换工作是为了促进职业发展，故答案为B)。",
      "explanation": "第二段第一、二句：'When I started my career, things were already different. If you weren't changing companies every three or four years, you simply weren't getting ahead in your career.'",
      "question_order": 51,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 111,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 53,
      "question_text": "What does the author say about people now working for several businesses at the same time?",
      "options": "[\"A) They are often regarded as most treasured talents.\", \"B) They are able to bring their potential into fuller play.\", \"C) They have control over their life and work schedules.\", \"D) They feel proud of being outstanding problem solver.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。定位句指出，现如今，能够同时为五家企业工作是荣耀的象征。接下来的一句指出这能说明一个人的价值所在。也就是说，能同时为多家企业工作的人通常是有价值的人才，故答案为A)。",
      "explanation": "第三段第一、二句：'Today, consulting or freelancing for five businesses at the same time is a badge of honor. It shows how valuable an individual is.'",
      "question_order": 52,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 112,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 54,
      "question_text": "What have businesses come to recognize now?",
      "options": "[\"A) Who is capable of solving problems with ease.\", \"B) How people can be more focused and productive.\", \"C) What kind of people can contribute more to them.\", \"D) Why some people are more passionate about work.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。定位句指出，最重要的是，越来越多的人意识到那些能够平衡工作和娱乐的人，以及做自己喜爱的工作的人，会更加专注和高效，从而为他们的客户提供更大的价值。由此可见，企业认识到什么样的人能为他们做出更多贡献，故答案为C)。",
      "explanation": "第四段第二句：'Most important, there is a growing recognition that people who balance work and play, and who work at what they are passionate about, are more focused and productive, delivering greater value to their clients.'",
      "question_order": 53,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 113,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 55,
      "question_text": "What does the author say about the gig economy?",
      "options": "[\"A) It may force companies to reform their business practice.\", \"B) It may soon replace the traditional economic model.\", \"C) It will drive technological progress on a global scale.\", \"D) It will bring about radical economic and social changes.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。定位句指出，随着全球经济持续受到科技和其他重大改变的干扰，零工经济本身将会成为经济和社会转型的引擎。由此可见，零工经济将带来根本性的经济和社会变革，故答案为D)。",
      "explanation": "最后一段最后一句：'Perhaps more important, as the global economy continues to be disrupted by technology and other massive change, the gig economy will itself become an engine of economic and social transformation.'",
      "question_order": 54,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 114,
      "section_id": 16,
      "question_type": "translation",
      "question_number": 56,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "翻译题目，需要学生将中文段落准确翻译成英文，注意语法、词汇和句式结构的正确性",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 55,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    }
  ]
}