{
  "exam_papers": [
    {
      "id": 2,
      "exam_type": "CET-4",
      "year": 2022,
      "month": 9,
      "paper_number": 2,
      "title": "2022年9月大学英语四级考试真题（二）",
      "description": "2022年9月大学英语四级考试真题（第二套），包含写作和翻译两个部分",
      "total_score": 710,
      "time_allowed": 125,
      "questions_count": 2,
      "sections_count": 2,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "exam_type": "CET-4",
      "year": 2022,
      "month": 9,
      "paper_number": 3,
      "title": "2022年9月大学英语四级考试真题（三）",
      "description": "2022年9月大学英语四级考试真题（第三套），包含写作和翻译两个部分",
      "total_score": 710,
      "time_allowed": 125,
      "questions_count": 2,
      "sections_count": 2,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_sections": [
    {
      "id": 9,
      "paper_id": 2,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "Suppose your class has just finished celebrating the Teachers' Day. You are now to write a report to the university newspaper on the celebration activities organized by your class. You will have 30 minutes to write the report. You should write at least 120 words but no more than 180 words.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 10,
      "paper_id": 2,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 1,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "按照中国民间的传统习俗，春节期间长辈通常会给孩子发红包，俗称发压岁钱 (lucky money)，以表达对孩子的祝福，祝他们好运。如今，红包不仅是给孩子的礼物，而且经常也是给长辈或亲朋好友的礼物。近年来，随着微信用户数量的增加，微信红包变得愈加流行。欢度春节时，人们经常互发微信红包表达问候。这无疑是一种与远方亲友联系的便捷方式。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 11,
      "paper_id": 3,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "Suppose your class plans to invite some former graduates to share their job experiences with the students. As the organizer of the activity, you are now to write an invitation letter to the invited speakers on behalf of your class. You will have 30 minutes to write the letter. You should write at least 120 words but no more than 180 words.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 12,
      "paper_id": 3,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 1,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "戏曲是一种中国传统的艺术形式，可以追溯到唐朝。中国戏曲吸引观众的一大特色是其独具风格的腔谱(facial painting)。腔谱代表不同角色的性格和命运。观众通过观察腔谱能够更好地理解这些角色的故事。欣赏戏曲是中国人特别是老年人的一大乐趣。为了吸引更多的年轻观众，传统戏曲正在不断地发展和创新。如今，越来越多的外国观众也喜欢中国戏曲。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_questions": [
    {
      "id": 58,
      "section_id": 9,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write a report to the university newspaper on the Teachers' Day celebration activities organized by your class.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "参考范文：\nReport on Teachers' Day Celebration\n\nThe celebration of Teachers' Day this year coincided with Chinese traditional Mid-Autumn Festival. Owing to this, our class organized the event from 8:00 a.m. to 9:30 a.m. on Sept. 9th in the playground.\n\nOur celebration started with a speech from our beloved Mr. Li, who has been awarded as one of the university model teachers for his profound knowledge and moral integrity. In his speech, Mr. Li expressed his ambition to be a more qualified, motivated and empowered teacher and encouraged us to focus on learning. Then our talented classmates presented a variety of performances, including singing Chinese and English songs, folk dance and martial arts performances, and stand-up comedies. Joy and laughter filled the playground, attracting hundreds of fellow students. At the end of the celebration, each classmate was given the traditional dessert for Mid-Autumn Festival—monocakes, and they were of different flavors! All our classmates sat together happily, tasting the delicious mooncakes and enjoying the silvery moon.\n\nThe unforgettable memories linger in every classmate's mind.",
      "explanation": "考查学生的报告写作能力，包括活动描述、细节呈现和总结",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 59,
      "section_id": 10,
      "question_type": "translation",
      "question_number": 2,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "参考译文：\nIn the light of Chinese folk traditional customs, the elders usually give red packets to children during the Spring Festival, which is commonly known as giving lucky money, to express their wishes for children and wish them good luck. Nowadays, red packet is not only a gift for children, but often a present for elders, relatives and friends as well. In recent years, with the increase of WeChat users, WeChat red packets have become more and more popular. When celebrating the Spring Festival, people often express greetings through sending WeChat red packets to each other, which is undoubtedly a convenient way to get in touch with distant relatives and friends.",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 1,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 60,
      "section_id": 11,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write an invitation letter to the invited speakers on behalf of your class for sharing job experiences.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "参考范文：\nAn Invitation on Sharing Job Experiences\n\nDear alumni,\n\nI am writing to invite you to our online event of job experience exchange, to be held on the evening of Sept. 19th via Tencent Meeting, with senior students who are currently facing the challenges of employment.\n\nWould you like to help these prospective graduates by telling them about your current career and position, and sharing your insights on job hunting and career development? If so, the following topics might be of top concern. How did you get access to and work in your current position? What competencies are valued most? Are qualification certificates worth nothing? How can we be fully prepared for an interview, particularly a virtual one, or the online job application process? Besides, we may have the question and answer session in which detailed explanations will be expected.\n\nYour sharing will be greatly appreciated and I am looking forward to your reply.\n\nYours,\nLi Ming",
      "explanation": "考查学生的邀请信写作能力，包括格式、内容和语气",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 61,
      "section_id": 12,
      "question_type": "translation",
      "question_number": 2,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "参考译文：\nOpera is one of the Chinese traditional arts, which can be traced back to the Tang Dynasty. One striking characteristic of Chinese opera that appeals to the audience is its unique facial paintings. Facial paintings represent different personalities and fates of the characters. The audience can better understand the stories of the characters by observing their facial paintings. Appreciating Chinese opera is a pleasure for Chinese people, especially for the elderly. In order to attract more young audience, traditional opera is constantly developing and being innovated. Nowadays, a growing number of foreign audience also become fascinated by Chinese opera.",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 1,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    }
  ]
}