{
  "exam_papers": [
    {
      "id": 1,
      "exam_type": "CET-4",
      "year": 2025,
      "month": 6,
      "paper_number": 3,
      "title": "2025年6月大学英语四级考试真题（三）",
      "description": "2025年6月大学英语四级考试真题（第三套），包含写作、听力、阅读理解和翻译四个部分",
      "total_score": 710,
      "time_allowed": 125,
      "questions_count": 56,
      "sections_count": 8,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_sections": [
    {
      "id": 1,
      "paper_id": 1,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "Suppose your university is organizing a forum on the development of students' cross-cultural communication abilities. You are now to write an essay to express your view. You will have 30 minutes to write the essay. You should write at least 120 words but no more than 180 words.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "paper_id": 1,
      "section_type": "listening",
      "section_name": "听力部分 - Section A",
      "section_order": 1,
      "time_allowed": 25,
      "directions": "由于多题多卷，官方第三套真题的听力试题与第二套真题的一致，只是选项顺序不同，因此本套试卷不再提供听力部分。",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 0,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "paper_id": 1,
      "section_type": "listening",
      "section_name": "听力部分 - Section B",
      "section_order": 2,
      "time_allowed": 25,
      "directions": "由于多题多卷，官方第三套真题的听力试题与第二套真题的一致，只是选项顺序不同，因此本套试卷不再提供听力部分。",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 0,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "paper_id": 1,
      "section_type": "listening",
      "section_name": "听力部分 - Section C",
      "section_order": 3,
      "time_allowed": 25,
      "directions": "由于多题多卷，官方第三套真题的听力试题与第二套真题的一致，只是选项顺序不同，因此本套试卷不再提供听力部分。",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 0,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section A",
      "section_order": 4,
      "time_allowed": 40,
      "directions": "In this section, there is a passage with ten blanks. You are required to select one word for each blank from a list of choices given in a word bank following the passage. Read the passage through carefully before making your choices. Each choice in the bank is identified by a letter. Please mark the corresponding letter for each item on Answer Sheet 2 with a single line through the centre. You may not use any of the words in the bank more than once.",
      "passage_content": "The human brain has the ability to constantly form new networks and connections between brain cells. This means the brain has an almost magical ability to change. This characteristic is ___26___ apparent in a new study, focusing on people who underwent a hemispherectomy, a surgical procedure in which half of the brain is removed to treat illness.\n\nThe findings showed that, despite missing half of this critical ___27___ , participants could function well. This was because the ___28___ half of their brain strengthened. In fact, researchers found that connections — and thus communication — between parts of different brain networks are actually stronger in people who had hemispherectomies than in people with intact brains. This ___29___ that the brain is able to compensate for loss of certain brain structure.\n\nThere are many other cases in the medical ___30___ that document the brain's amazing ability to ___31___ . For example, a young boy had a significant portion of his brain removed for medical reasons, which included the part of the brain ___32___ for sight. But a few years after his surgery, scientists found that he could ___33___ see. They determined that this was because other parts of his brain took over the missing part's ___34___ tasks. Another study involved people who could smell despite missing the region in the brain that processes information about smells. Though they are not sure how these individuals ___35___ the ability to smell, scientists believe it is possible that another part of the brain took on that task.",
      "passage_title": "Brain Adaptation After Hemispherectomy",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 6,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section B",
      "section_order": 5,
      "time_allowed": 40,
      "directions": "In this section, you are going to read a passage with ten statements attached to it. Each statement contains information given in one of the paragraphs. Identify the paragraph from which the information is derived. You may choose a paragraph more than once. Each paragraph is marked with a letter. Answer the questions by marking the corresponding letter on Answer Sheet 2.",
      "passage_content": "A) Traffic jams are a common problem of most big cities, either in developed or in developing countries, but one kind of traffic jams in particular can be especially frustrating. These are generally known as \"phantom\" traffic jams, in which dense traffic crawls to a halt for no apparent reason at all.\n\nB) \"When caught in such a traffic jam, it is common for drivers to assume that there must be an accident, or construction or something,\" said Massachusetts Institute of Technology (MIT) computer science professor Berthold Horn. \"And then you drive and drive and drive... and there isn't anything there.\"\n\nC) The exact cause of these phantom traffic jams has long remained a mystery. But now, new research has found the cause and researchers may have come up with a solution for this frustrating traffic pattern: maintaining equal spacing between cars on the road, rather than driving so closely behind another vehicle that a collision is likely if that vehicle brakes suddenly.\n\nD) Horn said phantom traffic jams are an emergent property of the flow of vehicles down a highway. A phantom jam begins when a car in dense traffic slows down even slightly, which causes the car behind that vehicle to slow even more — and the slowing action spreads backward through the lane of traffic like a wave, getting worse the farther it spreads, Eventually, the cars far behind are forced to stop completely or risk hitting the slower vehicles ahead — and so the traffic grinds to a halt over nothing, Horn said.\n\nE) Horn has been working on the problem of phantom traffic jams for years, and he has come up with a solution: By splitting the difference between the cars in front and the cars behind, the spacing of cars in a stream of traffic can act as a damper on phantom traffic jams. That is, it can prevent the slow-down effect from being amplified by the cars that follow behind, he said. In essence, each driver would constantly make adjustments to keep their car roughly halfway between the car in front and the car behind.\n\nF) Horn calls this method of vehicle spacing bilateral control and he said it could be achieved with relatively simple modifications to the adaptive cruise control that many new cars already have. Adaptive cruise control is a driver assistance technology that sets a maximum speed for vehicles and automatically slows the speed of the car when traffic is sensed in front of the vehicle. The technology is also known as autonomous cruise control. Such modifications, Horn said, could help fight phantom jams within a few years, maybe decades before an alternative solution, such as networked self-driving cars, becomes a reality on the roads.\n\nG) Traffic jams are caused by a number of factors, such as roads that are poorly designed or over-capacity, localized factors like city traffic-lighting patterns, and events like accidents and construction. But phantom traffic jams can make all those problems worse, Horn said. And the researchers in the new study have calculated that solving phantom jams could save at least some of the estimated $121 billion per year that traffic jams are estimated to cost the U.S. economy, Horn told Live Science.\n\nH) New research by Horn and MIT postdoctoral associate Liang Wang, published in the journal IEEE Transactions on Intelligent Transportation Systems, shows how bilateral control can fight the problem. The researchers made computer models of real-world traffic conditions, showing how a typical U.S. freeway could benefit from cars using bilateral control. That would be in place when human drivers fail to slow down, thus avoiding tailgating the car in front, Horn said. \"Under reasonable conditions today, you might get 1,800 cars per lane per hour throughput. But with bilateral control you could almost double that.\"\n\nI) The main alternative to increasing traffic throughput per lane has been to build more lanes and more highways, and putting in new roads is very expensive, he said. \"If we can increase the throughput on major highways, even if it's only by 50 percent that would be a big deal,\" Horn said.\n\nJ) With the help of engineering students at high schools in Maine, Horn and Wang have also built a robot simulation that shows how bilateral control can suppress phantom traffic jams. Increasing the spacing of vehicles dampens the effect of slowdowns by cars in front of a given car, so that the slowing is not worsened until it becomes a phantom jam, the researchers said.\n\nK) A video from the project shows a train of autonomous robots running along a track without bilateral control: they eventually back up in phantom jams. But when the robots are switched over to bilateral control (by flashing the lights in the room), each autonomous robot tries to keep itself halfway between the robot in front and the one behind; the phantom jams disappear as a result, Horn said.\n\nL) Since starting his research on phantom traffic jams, Horn has learned that schools of fish and flocks of birds and bats use similar spacing strategies to avoid hitting each other while swimming or flying in densely packed groups. In particular, studies of millions of bats emerging at dusk from caves in Southeast Asia showed that each bat used a form of bilateral control to reduce the likelihood of collisions with other bats in the densely packed swarm, Horn said.\n\nM) Unlike bats, birds and fish, however, humans have difficulty judging distances behind them. To address that weakness, Horn is now working with the car company Toyota to enable a form of bilateral control via modifications to existing adaptive cruise control systems, which use forward-facing sensors to judge the distance to the vehicle ahead. The bilateral control approach would include adding rear-facing sensors to determine the distance to the vehicle following a car.\n\nN) But until those systems become standard, human drivers can help reduce phantom traffic jams simply by not following the car in front so closely. As Horn argues, \"There's absolutely no advantage of tailgating the car in front of you.\"",
      "passage_title": "\"Phantom\" Traffic Jams Are Real—And Scientists Know How to Stop Them",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 7,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section C",
      "section_order": 6,
      "time_allowed": 40,
      "directions": "There are 2 passages in this section. Each passage is followed by some questions or unfinished statements. For each of them there are four choices marked A), B), C) and D). You should decide on the best choice and mark the corresponding letter on Answer Sheet 2 with a single line through the centre.",
      "passage_content": "Passage One\n\nOur society places a high value on physical beauty. Americans spend an average of over $722 each year on their appearance. One in ten Americans has tried to look like a star.\n\nThere's nothing wrong with trying to look our best but excessive focus on physical appearance misses the soulful aspects of what it means to be beautiful. Trying to look like the magazine pictures can take us on a long ride away from what beauty is really about.\n\nMany of us spend far too much time, energy, and money trying to polish an image of what we think will bring attention, love, and connection. In the process, we may fail to attend to ourselves in a way that would move us toward deeper intimacy, fulfillment, and meaning.\n\nIt may sound trite, but beauty is only skin deep; it's not what brings love toward us. Just read about the latest Hollywood starlets whose seeming love turns into resentment and bitter court battles.\n\nOuter beauty can be as much of a curse as a blessing. We may develop a habit of being so focused on maintaining a perfect appearance that we never cultivate the inner qualities necessary to sustain and deepen intimacy and connection. As I describe in my book, The Authentic Heart, it is the courage to be authentic that connects us in a deeper way.\n\nWhile our initial attraction may be based in part on physical chemistry, it is the meeting of our inner worlds that creates the lasting intimacy and spiritual connection for which we long. If we redirect our attention toward cultivating inner qualities, we might find a magnetic attraction that moves us from something superficial to something that connects us to our depths.\n\nThe path toward cultivating inner beauty is really simple. But what is simple is not always easy. Not everyone will see us and appreciate us as we take the courageous risk to allow ourselves to be seen as we really are. But if they don't it is their loss, not ours. Eventually we'll find those compatible souls who appreciate us as we are.\n\nPassage Two\n\nPlant-based meats are coming soon to a dinner table near you, but do they deserve a spot on your plate? If you tried a vegetable burger years ago and dismissed it as rubbery and flavorless, it's a good time to give meatless meat another chance. Newer varieties imitate the look, flavor, and texture of meat. Analysts don't expect the meat-free movement to slow anytime soon; a 2021 report predicts the market will skyrocket to $74 billion by 2030 — a 957 percent surge.\n\nPlant-based meats are no longer just for vegetarians. Companies such as Impossible Foods and Beyond Meat — the current superstars of the alternative protein sector — are pursuing consumers who enjoy meat but want to reduce their meat consumption for animal rights, health, or environmental reasons. So far, it's a winning strategy: More than nine out of ten consumers who buy Beyond Burger and Impossible Foods products also eat meat.\n\nMany vegetarians don't actually care for food that resembles meat. When reporter Joan Solsman, a longtime vegetarian, tried a dish from Impossible Foods, she felt so sick that she couldn't finish it. \"Maybe the best sign that Impossible Foods has cracked the code to realistic fake meat is that I couldn't stand to take another bite,\" she wrote.\n\nMeatless meats are generally a healthier choice than beef because they are cholesterol-free, plus they're a good source of vitamins, minerals, protein, and fiber.\n\nIf meatless meat can help you stick to a plant-based diet, that in itself can lead to better health. Not only has red meat been linked to cancer, but studies show that people who ditch meat have lower blood pressure, lower average blood sugar, and lower cholesterol levels.\n\nHowever, just because it's plant-based doesn't mean it's health food. Most imitation meats are highly processed and contain high amounts of sodium compared to traditional beef.\n\nThese new generations of alternate meat get all the attention, but don't forget about whole grains and vegetables. Beans are an especially excellent protein substitute. They're nutritious, inexpensive, and far more sustainable than any of the processed meatless substitutes on the market today.",
      "passage_title": "",
      "passage_type": "reading",
      "has_multiple_passages": 1,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 8,
      "paper_id": 1,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 7,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "近年来，中国越来越多的城市着力打造\"15分钟便民生活圈(convenient living circles)\"。社区居民步行15分钟就能享受到日常所需的公共服务。生活圈内建有便利店、公园、健身场地、图书馆、学校、社区食堂、诊所等。生活圈的建立能够为居民提供更加便利、舒适、友好、愉悦的生活环境，更好地满足城市居民多元化的日常生活服务需求，提升居民的生活品质和幸福感。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_questions": [
    {
      "id": 1,
      "section_id": 1,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write an essay about the development of students' cross-cultural communication abilities.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "写作题目，需要学生就培养学生跨文化交际能力这一话题发表自己的观点",
      "explanation": "考查学生的议论文写作能力，包括论点阐述、论证支持和结论总结",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 26,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "G",
      "analysis": "副词辨析题。空格所在句子主系表结构完整，故空格处应填副词，修饰后面的形容词apparent。前一句提到\"大脑拥有一种近乎神奇的改变能力\"，本句意为\"这一特性在一项新研究中明显\"。代入选项可知，particularly符合此处语境。particularly apparent（尤为明显）既呼应前文中almost magical的强调语气，又通过focusing on...hemispherectomy的限定场景突出了大脑这一能力的强大。",
      "explanation": "根据上下文，大脑改变的特性在新的研究中特别明显。",
      "question_order": 1,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 27,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "F",
      "analysis": "名词辨析题。空格位于形容词critical后，故空格处应填名词。前一句提及hemispherectomy（大脑半球切除术），本句指出\"尽管缺失这一关键——的一半，参与者仍能正常生活\"。代入选项可知，organ符合此处语境。critical organ与hemispherectomy形成手术对象的呼应。",
      "explanation": "大脑是人体关键器官，这里指大脑这一器官。",
      "question_order": 2,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 28,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "H",
      "analysis": "形容词辨析题。空格前面为定冠词the，后面为名词短语half of...，故空格处应填形容词，修饰后面的名词。前文提到\"尽管缺失这一关键器官的一半，参与者仍能正常生活\"，本句说明原因，即\"他们大脑中——一半得到了强化\"。half与missing half形成对比，空格所填词与missing（缺失的）语义相对，故答案为remaining。",
      "explanation": "remaining表示剩余的、剩下的，这里指大脑未被切除的另一半。",
      "question_order": 3,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 29,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "C",
      "analysis": "动词辨析题。空格前面为句子主语This，后面为that引导的宾语从句，空格处应填谓语动词。前文时态为一般现在时，故空格处应填动词的第三人称单数形式。前一句提到\"研究人员发现，接受过大脑半球切除术的人，其大脑不同网络各部分之间的连接（及由此产生的信息交流），实际上比大脑完整的人更强\"，本句结论为\"大脑能够弥补某些脑结构的损失\"。前后句是研究发现与结论之间的推导关系，故此处应填indicates。",
      "explanation": "indicates表示表明、显示，这里指研究结果表明大脑能够弥补结构损失。",
      "question_order": 4,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 6,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 30,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "E",
      "analysis": "名词辨析题。空格前面为形容词medical，后面为that引导的宾语从句，故空格处应填名词。前文提到了大脑半球切除术的案例，本句指出\"医学——存在许多其他案例……\"。代入选项可知，medical literature（医学文献）符合此处语境，故答案为literature。",
      "explanation": "medical literature指医学文献，记载相关案例。",
      "question_order": 5,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 7,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 31,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "A",
      "analysis": "动词辨析题。空格位于句末，前面为ability to，故空格处应填动词原形，构成不定式结构，充当ability的后置定语。前文提到大脑有形成新网络和新连接的能力，从而能够弥补某些脑结构的损失，这强调了大脑具有神奇的适应能力。本句意为\"医学文献中存在许多其他案例，记载了大脑惊人的——能力\"，进一步强调大脑的适应能力。故答案为adapt。",
      "explanation": "adapt表示适应，这里指大脑的适应能力。",
      "question_order": 6,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 8,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 32,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "I",
      "analysis": "形容词辨析题。空格前面为名词短语the part of the brain，后面为介词短语for sight，空格处应填分词或形容词，作后置定语。本句意为\"一个小男孩因医疗原因切除了很大一部分大脑，其中包括大脑中——视觉的区域\"。responsible for（对……负责）符合此处语境，故答案为responsible。",
      "explanation": "responsible for表示负责、掌管，这里指大脑负责视觉的区域。",
      "question_order": 7,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 9,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 33,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "K",
      "analysis": "副词辨析题。空格前面为be could，后面为动词原形see，故空格处应填入副词，修饰see。前文提到\"一个小男孩因医疗原因切除了很大一部分大脑，其中包括大脑中负责视觉的区域\"，正常来说，视觉区域的缺失会导致该男孩失明，但本句提到\"但在手术数年后，科学家发现他——能够看见东西\"。still（仍然）符合此处语境，表明视觉能力一直没有消失，故答案为still。",
      "explanation": "still表示仍然、依旧，强调男孩手术后仍然保有视觉能力。",
      "question_order": 8,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 10,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 34,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "O",
      "analysis": "形容词辨析题。空格前面为所有the missing part's，后面为名词tasks，故空格处应填入形容词或分词，修饰tasks。前文提到\"……切除了很大一部分大脑，其中包括大脑中负责视觉的区域……仍然能够看见东西\"，本句解释原因\"其大脑其他区域接管了缺失部分的——任务\"。视觉区域当然是负责视觉任务，故答案为visual。",
      "explanation": "visual表示视觉的，这里指视觉相关的任务。",
      "question_order": 9,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 11,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 35,
      "question_text": "",
      "options": "[\"A) adapt\", \"B) hardly\", \"C) indicates\", \"D) insist\", \"E) literature\", \"F) organ\", \"G) particularly\", \"H) remaining\", \"I) responsible\", \"J) retained\", \"K) still\", \"L) strategy\", \"M) transformed\", \"N) underlines\", \"O) visual\"]",
      "correct_answer": "J",
      "analysis": "动词辨析题。空格前面为从句主语these individuals，后面为宾语the ability to smell，空格处应填谓语动词。前一句提到\"尽管他们缺失大脑中处理嗅觉信息的区域，却仍能闻到气味\"，本句指出\"科学家不确定这些人如何______嗅觉能力\"。代入选项可知，retained \"保留\"符合此处语境，故为答案。",
      "explanation": "retained表示保留、保持，这里指这些人保留了嗅觉能力。",
      "question_order": 10,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 12,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 36,
      "question_text": "The age-long mystery has now been resolved as to how phantom traffic jams are caused.",
      "options": "[]",
      "correct_answer": "C",
      "analysis": "同义转述题。定位句提到，这种幽灵交通堵塞的确切原因长期以来一直是个谜，但如今，新的研究已经找到了原因，研究人员可能已经想出了应对这种令人沮丧的交通模式的解决方案。题干是对这段内容的概括，其中The age-long mystery对应原文中的has long remained a mystery, has now been resolved与原文中的have come up with a solution同义，how phantom traffic jams are caused对应原文中的The exact cause of these phantom traffic jams，故答案为C。",
      "explanation": "C段第一、二句：'The exact cause of these phantom traffic jams has long remained a mystery. But now, new research has found the cause and researchers may have come up with a solution for this frustrating traffic pattern...'",
      "question_order": 11,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 13,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 37,
      "question_text": "It is possible to nearly double the hourly throughput per lane by adopting bilateral control.",
      "options": "[]",
      "correct_answer": "H",
      "analysis": "细节辨认题。由题干关键词nearly double the hourly throughput per lane和adopting bilateral control定位到H段。H段最后一句提到，他补充道：\"在当今合理的条件下，每条车道每小时的通行量（交通流量）可能达到1800辆车。但是在采用双边控制后，这一数字几乎可以翻倍。\"题干是对这一内容的概括，其中It is possible to nearly double对应原文中的you could almost double，the hourly throughput per lane对应原文中的per lane per hour throughput，by adopting bilateral control与原文中的with bilateral control同义，故答案为H。",
      "explanation": "H段最后一句：'\"Under reasonable conditions today, you might get 1,800 cars per lane per hour throughput. But with bilateral control you could almost double that.\"'",
      "question_order": 12,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 14,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 38,
      "question_text": "According to Horn, drivers making constant adjustments for equal spacing between cars in a flow of traffic can help reduce phantom traffic jams.",
      "options": "[]",
      "correct_answer": "E",
      "analysis": "细节归纳题。由题干关键词drivers making constant adjustments，equal spacing between cars和help reduce phantom traffic jams定位到E段。该段第一句提到，霍恩针对幽灵交通堵塞问题提出了一个解决方案：通过平衡前后车之间的距离（即保持与前车和后车等距），车流中的车辆间距可以起到抑制幽灵交通堵塞的作用。该段最后一句话又提到，每位司机都需要不断调整，让自己的车大致保持在前车和后车的中间位置。由此可知，题干是对这两句话的综合概括，其中drivers making constant adjustments for equal spacing between cars对应最后一句话中的each driver would constantly make adjustments to keep their car roughly halfway between the car in front and the car behind，can help reduce phantom traffic jams与第一句话中的can act as a damper on phantom traffic jams同义，故答案为E。",
      "explanation": "E段第一句和最后一句：'Horn has been working on the problem of phantom traffic jams for years, and he has come up with a solution: By splitting the difference between the cars in front and the cars behind, the spacing of cars in a stream of traffic can act as a damper on phantom traffic jams.' 'In essence, each driver would constantly make adjustments to keep their car roughly halfway between the car in front and the car behind.'",
      "question_order": 13,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 15,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 39,
      "question_text": "Before systems for bilateral control are installed, drivers should not follow the car in front too closely so as to reduce phantom traffic jams.",
      "options": "[]",
      "correct_answer": "N",
      "analysis": "细节辨认题。由题干关键信息systems for bilateral control、not follow the car in front too closely和reduce phantom traffic jams定位到N段。N段第一句提到，但在这座系统成为标准配置之前，人类司机只需不紧跟前车就能帮助减少幽灵交通堵塞。这些系统指的是前文提到的双边控制系统，故题干与该句同义，其中systems for bilateral control对应原文中的those systems，not follow the car in front too closely与原文中的not following the car in front so closely同义，reduce phantom traffic jams属于原词重现，故答案为N。",
      "explanation": "N段第一句：'But until those systems become standard, human drivers can help reduce phantom traffic jams simply by not following the car in front so closely.'",
      "question_order": 14,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 16,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 40,
      "question_text": "Horn said with some simple modifications to the existing equipment in new vehicles, their spacing bilateral control could be accomplished.",
      "options": "[]",
      "correct_answer": "F",
      "analysis": "细节辨认题。由题干关键信息simple modifications、the existing equipment in new vehicles和spacing bilateral control定位到F段。F段第一句提到，霍恩将这种车辆间距控制方法称为双边控制，他说这可以通过对许多新车已经配备的自适应巡航控制系统进行相对简单的改进来实现。题干与该句同义，其中Horn said对应原文中的he said，with some simple modifications to the existing equipment in new vehicles与原文中的with relatively simple modifications to the adaptive cruise control that many new cars already have同义，spacing bilateral control属于原词重现，could be accomplished对应原文中的it could be achieved，故答案为F。",
      "explanation": "F段第一句：'Horn calls this method of vehicle spacing bilateral control and he said it could be achieved with relatively simple modifications to the adaptive cruise control that many new cars already have.'",
      "question_order": 15,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 17,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 41,
      "question_text": "Drivers caught up in phantom traffic jams are likely to think an accident has happened or some construction is going on.",
      "options": "[]",
      "correct_answer": "B",
      "analysis": "细节辨认题。由题干关键信息Drivers caught up in phantom traffic jams、an accident has happened和some construction is going on定位到B段。B段第一句提到，遇到这种交通堵塞时，司机通常会认为一定是前方发生了交通事故、道路有施工或其他情况。题干与该句同义，其中drivers是原词复现，caught up in phantom traffic jams与原文中的caught in such a traffic jam同义，are likely to think对应原文中的it is common... to assume，an accident has happened or some construction is going on对应原文中的there must be an accident, or construction or something，故答案为B。",
      "explanation": "B段第一句：'\"When caught in such a traffic jam, it is common for drivers to assume that there must be an accident, or construction or something,\"'",
      "question_order": 16,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 18,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 42,
      "question_text": "Two sets of sensors would be used to help drivers determine the distances between cars.",
      "options": "[]",
      "correct_answer": "M",
      "analysis": "细节归纳题。由题干关键信息Two sets of sensors和determine the distances between cars定位到M段。M段第二、三句提到，为了弥补这一弱点（即该段首句提到的，人类难以判断后方的距离），霍恩正在与丰田汽车公司合作，通过改进现有的自适应巡航控制系统来实现一种双边控制，现有的系统使用前传感器来判断前方车辆之间的距离。这种双边控制方法将包括添加向后传感器，以确定与后方车辆之间的距离。由此可知，双边控制方法包含两组传感器（向前传感器和向后传感器），用来帮助司机确定车辆之间的距离。故题干是对这两句话的概括，其中Two sets of sensors would be used对应原文中的use forward-facing sensors和include adding rear-facing sensors，determine the distances between cars是对原文中to judge the distance to the vehicle ahead和to determine the distance to the vehicle following a car的概括，故答案为M。",
      "explanation": "M段第二、三句：'To address that weakness, Horn is now working with the car company Toyota to enable a form of bilateral control via modifications to existing adaptive cruise control systems, which use forward-facing sensors to judge the distance to the vehicle ahead. The bilateral control approach would include adding rear-facing sensors to determine the distance to the vehicle following a car.'",
      "question_order": 17,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 19,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 43,
      "question_text": "Solving the problem of phantom jams could save America billions of dollars every year.",
      "options": "[]",
      "correct_answer": "G",
      "analysis": "细节归纳题。由题干关键信息Solving the problem of phantom jams和save America billions of dollars every year定位到G段。G段最后一句提到，霍恩向《生活科学》杂志透露，这项研究的研究人员计算出，解决幽灵交通堵塞，每年至少能够为美国节省部分预估因交通拥堵损失的约1210亿美元。题干是对这句话的概括，其中Solving the problem of phantom jams对应原文中的solving phantom jams，save America billions of dollars every year是对原文中save at least some of the estimated $121 billion per year that traffic jams are estimated to cost the U.S. economy的概括，故答案为G。",
      "explanation": "G段最后一句：'And the researchers in the new study have calculated that solving phantom jams could save at least some of the estimated $121 billion per year that traffic jams are estimated to cost the U.S. economy, Horn told Live Science.'",
      "question_order": 18,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 20,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 44,
      "question_text": "In a phantom traffic jam, the cars in the same lane slow down one after another, creating a wave-like effect.",
      "options": "[]",
      "correct_answer": "D",
      "analysis": "细节归纳题。由题干关键信息phantom traffic jam、the cars in the same lane、slow down one after another和creating a wave-like effect定位到D段。D段第二句提到，当密集车流中的一辆车稍微减速时，幽灵堵塞便开始了，这会导致后面的车辆减速幅度更大——这种减速行为像波浪一样在车道上向后蔓延，蔓延得越远，情况就越糟糕。换言之，在幽灵交通堵塞中，同一车道的车辆依次减速，会产生波浪效应。题干是对该句的概括，其中a phantom traffic jam对应原文中的A phantom jam，the cars in the same lane slow down one after another是对原文中的a car in dense traffic slows down even slightly, which causes the car behind that vehicle to slow even more的概括总结，creating a wave-like effect与原文中的the slowing action spreads backward through the lane of traffic like a wave同义，故答案为D。",
      "explanation": "D段第二句：'A phantom jam begins when a car in dense traffic slows down even slightly, which causes the car behind that vehicle to slow even more — and the slowing action spreads backward through the lane of traffic like a wave, getting worse the farther it spreads.'",
      "question_order": 19,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 21,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 45,
      "question_text": "Horn has found that certain creatures use strategies similar to bilateral control to avoid hitting each other while moving in dense crowds.",
      "options": "[]",
      "correct_answer": "L",
      "analysis": "细节辨认题。由题干关键信息certain creatures、strategies similar to bilateral control、avoid hitting each other和moving in dense crowds定位到L段。L段第一句提到，自从开始研究幽灵交通堵塞以来，霍恩已经了解到，鱼群、鸟群和蝙蝠群在密集成群地游动或飞行时，会使用类似的间距策略来避免相互碰撞。题干是对这句话的概括，其中Horn has found对应原文中的Horn has learned，certain creatures是对原文中schools of fish and flocks of birds and bats的概括，use strategies similar to bilateral control to avoid hitting each other while moving in dense crowds与原文中的use similar spacing strategies to avoid hitting each other while swimming or flying in densely packed groups同义，故答案为L。",
      "explanation": "L段第一句：'Since starting his research on phantom traffic jams, Horn has learned that schools of fish and flocks of birds and bats use similar spacing strategies to avoid hitting each other while swimming or flying in densely packed groups.'",
      "question_order": 20,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 22,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 46,
      "question_text": "What do we learn about American society from the first paragraph?",
      "options": "[\"A) It sees lots of personal income wasted on beauty products.\", \"B) It considers one's physical appearance very important.\", \"C) It places a high value on the physical fitness of stars.\", \"D) It expects every individual to look their very best.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。第一段首句明确指出我们的社会高度重视外在美，随后列举美国人年均花费722美元在外表上、十分之一的人曾尝试模仿明星造型的例子加以论证，这说明美国社会认为外在美很重要。B项符合原文表述，故选B。文章中提及花费金钱，但重点是强调社会对美的重视，而非浪费个人收入，A项属于过度引申，应排除。C项和D项的内容文章中未提及，故均排除。",
      "explanation": "首段第一句：'Our society places a high value on physical beauty.'",
      "question_order": 21,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 23,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 47,
      "question_text": "What happens when people strive to look better?",
      "options": "[\"A) They have to get prepared for resentment and bitter court battles.\", \"B) They are better able to gain attention, love, and personal connection.\", \"C) They may neglect to cultivate the inner qualities that matter more.\", \"D) They feel much of their precious time, energy and resources is wasted.\"]",
      "correct_answer": "C",
      "analysis": "推理判断题。第二段指出，过度关注外貌会让我们忽略\"美\"的灵魂层面，让我们与美的真谛渐行渐远；第三段进一步指出，人们在追求外表时，可能会没能以一种能让自己走向更深层次的亲密关系、获得满足感和人生意义的方式呵护自己，也就是说人们过度追求外在美时可能会忽视培养更重要的内在品质。C项的含义与原文一致，故选C。第四段提到了好莱坞新秀女演员的例子，但这只是一个具体案例，用于说明外表美不一定能带来享受，而她们的爱情演变成怨恨与激烈的法庭纷争也并非普遍结果，A项过于绝对和极端，故排除。B项与文章表达的意思相反，故排除。文章第三段提到人们耗费了过多的时间、精力和金钱，但并未说他们因此感觉浪费，故排除D项。",
      "explanation": "第二段：'There's nothing wrong with trying to look our best but excessive focus on physical appearance misses the soulful aspects of what it means to be beautiful.' 第三段：'Many of us spend far too much time, energy, and money trying to polish an image of what we think will bring attention, love, and connection. In the process, we may fail to attend to ourselves in a way that would move us toward deeper intimacy, fulfillment, and meaning.'",
      "question_order": 22,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 24,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 48,
      "question_text": "What does the author say about outer beauty?",
      "options": "[\"A) It may be inherited or cultivated.\", \"B) It may lead to bad as well as good habits.\", \"C) It may create connection or isolation.\", \"D) It may do as much harm as good.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。第五段第一句明确指出，外在美可能福祸并存，即它既有益处也有害处，D项与原文相符，故选D。A项的内容文章中未提及，故排除。文章强调外在美可能导致一味追求完美外表的习惯，这属于\"坏习惯\"范畴，未提及\"好习惯\"；此外，文章的焦点是在品质的缺失，而非习惯本身，B项偏离了文章的中心，故排除。第五段强调外在美无法替代内在品质维系并深化亲密关系，而非直接创造联结或造成隔阂，C项属于过度推断，应排除。",
      "explanation": "第五段第一句：'Outer beauty can be as much of a curse as a blessing.'",
      "question_order": 23,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 25,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 49,
      "question_text": "What brings about spiritual connection?",
      "options": "[\"A) Meeting of minds.\", \"B) Attraction at first sight.\", \"C) Physical chemistry.\", \"D) Frequent interaction.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。第六段第一句明确提到，真正造就我们渴望的那种持久亲密与心灵相通，是内心世界的相遇相知，A项Meeting of minds是对原文meeting of our inner worlds的同义替换，故选A项。第六段第一句的前半句提到最初的吸引可能部分源于我们身体本能的化学反应，但由于半句可知，作者认为这无法带来心灵相通，故排除C项。B项和D项的内容文章中未提及，故排除。",
      "explanation": "第六段第一句：'While our initial attraction may be based in part on physical chemistry, it is the meeting of our inner worlds that creates the lasting intimacy and spiritual connection for which we long.'",
      "question_order": 24,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 26,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 50,
      "question_text": "What happens when we take the path toward cultivating inner beauty?",
      "options": "[\"A) We may find a route toward other people's souls.\", \"B) We may be appreciated more by people around us.\", \"C) We will meet people who value us for who we are.\", \"D) We will be discouraged from revealing our true selves.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。最后一段末句提到，终有一天，我们会遇见那些与我们灵魂相契、能欣赏我们本来模样的人，C项是原文相关内容的同义转述，故选C。A、B两项的内容原文没有提及，故排除。最后一段提到，当我们鼓起勇气展现真实自我时，并非每个人都会看见并欣赏这样的我们，但如果他们不懂得欣赏，那是他们的损失，而非我们的，这是在鼓励人们展现真实的自我，并没有提及人们在追求内在美的时候是否会去展开真实的自己，D项的说法在文中没有依据，故排除。",
      "explanation": "最后一段最后一句：'Eventually we'll find those compatible souls who appreciate us as we are.'",
      "question_order": 25,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 27,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 51,
      "question_text": "What can we expect of plant-based meats?",
      "options": "[\"A) An increasing interest in their analyses.\", \"B) An enormous effort in their promotion.\", \"C) A huge boost in their consumption.\", \"D) A noticeable surge in their varieties.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。第一段最后一句提到，分析人士认为，素食潮流短期内不会放缓；2021年的一份报告预测，到2030年该市场规模将飙升至740亿美元——增幅高达957%。这说明植物肉的消费量将会大幅度增长，C项与原文表述相符，故选C。文章仅提到分析人士认为素食潮流不会放缓，未提及分析兴趣，故排除A。B项的内容文中未提及，故排除。文章中提到新一代产品在外观、风味和口感上都能模仿肉类，但未提及种类增加，故排除D。",
      "explanation": "第一段最后一句：'Analysts don't expect the meat-free movement to slow anytime soon; a 2021 report predicts the market will skyrocket to $74 billion by 2030 — a 957 percent surge.'",
      "question_order": 26,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 28,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 52,
      "question_text": "What do we learn about consumers buying Beyond Burger and Impossible Foods products?",
      "options": "[\"A) They are mostly non-vegetarians.\", \"B) They are mostly animal-rights advocates.\", \"C) Most of them refrain from eating meat for health reasons.\", \"D) Most of them eat meatless meat to protect the environment\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。第二段最后一句指出，购买\"超越汉堡\"和\"不可能食品\"产品的消费者中，超过九成同时也食用肉类，这说明他们大多不是素食者，A项符合原文，故选A。B项和D项是部分消费者减少肉类摄入的动机，但文中未限定大多数人具体出于哪种动机，故均应排除。文中提到有部分消费者因动物权益保护、健康或环保原因想减少肉类摄入，而不是不吃肉，C项与原文不符，故排除。",
      "explanation": "第二段最后一句：'More than nine out of ten consumers who buy Beyond Burger and Impossible Foods products also eat meat.'",
      "question_order": 27,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 29,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 53,
      "question_text": "What can we conclude about Impossible Foods' products from Joan Solsman's remark?",
      "options": "[\"A) They more often appeal to meat-eaters.\", \"B) They very much resemble animal meat.\", \"C) Some have become its signature dishes.\", \"D) Most of them are sold as true fake meat\"]",
      "correct_answer": "B",
      "analysis": "推理判断题。根据第三段可知，索尔斯曼是长期素食者，她在尝试了\"不可能食品\"的一道菜后感到非常不适，甚至没能吃完。由此可知，该段结尾就\"索尔斯曼指出\"或许'不可能食品'已经掌握了制作逼真素肉的密码，最好的证明就是我一口都吃不了\"，即\"不可能食品\"的产品过于逼真，作为素食者她感到难以下咽，B项的表达是原文的同义转述，故选B。其他三项的内容文中均未提及，故排除。",
      "explanation": "第三段最后一句：'\"Maybe the best sign that Impossible Foods has cracked the code to realistic fake meat is that I couldn't stand to take another bite,\" she wrote.'",
      "question_order": 28,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 30,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 54,
      "question_text": "Why can the habit of eating a plant-based diet lead to better health?",
      "options": "[\"A) It frees people from any known link to cancer.\", \"B) It provides all the nutrients for staying healthy.\", \"C) It helps maintain normal blood pressure and blood sugar.\", \"D) It reduces various health risks posed by meat consumption.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。第四段提到植物肉不含胆固醇，且是维生素、矿物质等的良好来源；第五段指出红肉与癌症相关，而不食用肉类的人血压、平均血糖和胆固醇水平更低。由此可知，植物性饮食能减少肉类带来的健康风险，D项是对原文的概括总结，故选D。原文只提及红肉与癌症有关联，未提及植物肉能完全消除癌症风险，A项内容过于绝对，故排除。文章说素肉富含维生素、矿物质等，但并未说它提供了所有营养素，故排除B项。文章只提及不食用肉类的人血压、平均血糖更低，并未提及吃植物性饮食能帮助维持正常的血压和血糖，故排除C。",
      "explanation": "第四段：'Meatless meats are generally a healthier choice than beef because they are cholesterol-free, plus they're a good source of vitamins, minerals, protein, and fiber.' 第五段：'Not only has red meat been linked to cancer, but studies show that people who ditch meat have lower blood pressure, lower average blood sugar, and lower cholesterol levels.'",
      "question_order": 29,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 31,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 55,
      "question_text": "What does the author recommend we eat at the end of the passage?",
      "options": "[\"A) Naturally produced foods.\", \"B) Processed protein substitutes.\", \"C) Red meats like traditional beef.\", \"D) New generations of alternate meat.\"]",
      "correct_answer": "A",
      "analysis": "推理判断题。最后一段作者指出，这些新一代替代肉类备受关注，但也别忘了全谷物和蔬菜。作者还指出，豆类是极佳的蛋白质替代品，它们营养丰富，价格实惠。这些都说明作者建议人们吃天然食物，故选A。作者批评加工素肉的含量高，且建议用天然豆类替代，故排除B项。作者指出了红肉的健康风险，明确反对红肉，故排除C项。作者认为新一代替代肉类仍是加工品，应该先选择天然食物，故排除D项。",
      "explanation": "最后一段：'These new generations of alternate meat get all the attention, but don't forget about whole grains and vegetables. Beans are an especially excellent protein substitute. They're nutritious, inexpensive, and far more sustainable than any of the processed meatless substitutes on the market today.'",
      "question_order": 30,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 32,
      "section_id": 8,
      "question_type": "translation",
      "question_number": 56,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "翻译题目，需要学生将中文段落准确翻译成英文，注意语法、词汇和句式结构的正确性",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 31,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    }
  ]
}