{
  "exam_paper": {
    "exam_type": "CET-4",
    "year": 2024,
    "month": 12,
    "paper_number": 3,
    "title": "2024年12月大学英语四级考试真题（三）",
    "total_score": 710,
    "time_allowed": 125,
    "description": "2024年12月大学英语四级考试完整试卷",
    "sections": [
      {
        "section_type": "writing",
        "section_name": "Part I Writing",
        "section_order": 1,
        "time_allowed": "30 minutes",
        "directions": "Suppose the university newspaper is inviting submissions from the students for its coming edition on how the students can contribute to a green campus. You are now to write an essay for submission. You will have 30 minutes to write the essay. You should write at least 120 words but no more than 180 words.",
        "content": "{\"essay_title\": \"How Students Can Contribute to a Green Campus\", \"requirements\": {\"min_words\": 120, \"max_words\": 180}}",
        "questions": []
      },
      {
        "section_type": "listening",
        "section_name": "Part II Listening Comprehension",
        "section_order": 2,
        "time_allowed": "25 minutes",
        "directions": "听力理解部分，包含新闻报告、长对话和短文理解",
        "content": "{\"subsections\": [{\"subsection_name\": \"Section A\", \"directions\": \"In this section, you will hear three news reports. At the end of each news report, you will hear two or three questions. Both the news report and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.\", \"questions_range\": \"1 to 7\"}, {\"subsection_name\": \"Section B\", \"directions\": \"In this section, you will hear two long conversations. At the end of each conversation, you will hear four questions. Both the conversation and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.\", \"questions_range\": \"8 to 15\"}, {\"subsection_name\": \"Section C\", \"directions\": \"In this section, you will hear three passages. At the end of each passage, you will hear three or four questions. Both the passage and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.\", \"questions_range\": \"16 to 25\"}]}",
        "questions": []
      },
      {
        "section_type": "reading",
        "section_name": "Part III Reading Comprehension",
        "section_order": 3,
        "time_allowed": "40 minutes",
        "directions": "阅读部分包含选词填空、段落匹配和阅读理解",
        "content": "{\"subsections\": [{\"subsection_name\": \"Section A\", \"directions\": \"In this section, there is a passage with ten blanks. You are required to select one word for each blank from a list of choices given in a word bank following the passage. Read the passage through carefully before making your choices. Each choice in the bank is identified by a letter. Please mark the corresponding letter for each item on Answer Sheet 2 with a single line through the centre. You may not use any of the words in the bank more than once.\", \"content\": {\"passage\": \"Super realistic masks are made from flexible materials such as silicone and are designed to imitate real human face — down to every last detail.\\nIn a study by the Universities of York and Kyoto, researchers asked participants to look at pairs of photographs and decide which showed a ___26___ face and which showed a person wearing a mask.\\nSurprisingly, participants made the wrong call in one-in-five cases.\\nThe 20% error rate ___27___ in the study likely underestimates the extent to which people would struggle to tell an ___28___ face from the real thing outside of the lab.\\nThe researchers collected data from participants from both the UK and Japan to ___29___ any differences according to race.\\nWhen trial participants were asked to choose between photographs of faces of a different race from theirs, response times were slower and selections were 5% less ___30___.\\nThere are now dozens of criminal cases in which offenders have ___31___ themselves off as people of a different age, race or gender, sending police investigations down the wrong path.\\nIn one recent case, an international gang used an ___32___ realistic mask to pose as a French minister, ___33___ business executives out of millions of pounds.\\nDr. Jet Sanders, who worked on the study while a PhD student at the University of York, said: \\\"Failure to detect synthetic faces may have important implications for security and crime prevention as super realistic masks may ___34___ the key characteristics of a person's appearance to be ___35___ identified.\\\"\", \"word_bank\": {\"A\": \"accurate\", \"B\": \"allow\", \"C\": \"artificial\", \"D\": \"cheating\", \"E\": \"deserted\", \"F\": \"establish\", \"G\": \"extremely\", \"H\": \"immediately\", \"I\": \"incorrectly\", \"J\": \"normal\", \"K\": \"observed\", \"L\": \"passed\", \"M\": \"reminding\", \"N\": \"reparable\", \"O\": \"resolve\"}, \"blanks\": [26, 27, 28, 29, 30, 31, 32, 33, 34, 35]}}, {\"subsection_name\": \"Section B\", \"directions\": \"In this section, you are going to read a passage with ten statements attached to it. Each statement contains information given in one of the paragraphs. Identify the paragraph from which the information is derived. You may choose a paragraph more than once. Each paragraph is marked with a letter. Answer the questions by marking the corresponding letter on Answer Sheet 2.\", \"content\": {\"passage_title\": \"Stop thinking and start doing\", \"paragraphs\": [{\"letter\": \"A\", \"content\": \"Most people have a dream in life, a vision of who or what they'd like to be in the future. At a minimum, everyone has interests and values that determine what they want out of their lives. Even so, trying to set achievable goals that you'll work for over the course of many years can be extremely challenging. It can be hard to know where to even begin, and the things you hope to achieve may seem impossible. But if you're well prepared you may be able to set goals for your life that are just as fulfilling to work toward as to achieve.\"}, {\"letter\": \"B\", \"content\": \"We all have goals that we want to achieve in our lives. These goals may include learning a new language, eating healthier and losing weight becoming a better parent, saving more money, and so on. It can be easy to assume that the gap between where you are now and where you want to be in the future is caused by a lack of knowledge. This is why we buy courses on how to start a business or how to lose weight fast or how to learn a new language in three months. We assume that if we knew about a better strategy, then we would get better results. We believe that a new result requires new knowledge.\"}, {\"letter\": \"C\", \"content\": \"What I'm starting to realize, however, is that new knowledge does not necessarily drive new results. In fact, learning something new can actually be a waste of time if your goal is to make progress and not simply gain additional knowledge.\"}, {\"letter\": \"D\", \"content\": \"It all comes down to the difference between learning and practicing. Thomas Sterner, in his book The Practicing Mind, explains the key difference between practicing and learning. He says: \\\"When we practice something, we are involved in the deliberate repetition of a process with the intention of reaching a specific goal.\\\" Here the words \\\"deliberate\\\" and \\\"intention\\\" are key, because they define the difference between actively practicing something and passively learning it.\"}, {\"letter\": \"E\", \"content\": \"Learning something new and practicing something new may seem very similar but these two methods can have profoundly different results. Here are some additional ways to think about the difference. Let's say your goal is to get stronger and more fit. You can research the best instructions on weight lifting technique, but the only way to build strength is to practice lifting weights. Let's say your goal is to grow your startup. You can learn about the best way to make a sales pitch, but the only way to actually land customers is to practice making sales calls. Let's say your goal is to write a book. You can talk to a best-selling author about writing, but the only way to become a better writer is to practice publishing consistently.\"}, {\"letter\": \"F\", \"content\": \"Passive learning creates knowledge. Active practice creates skill. Let's consider a couple more reasons to prioritize active practice over passive learning. First, passive learning can be a stick that supports inaction. In many cases, learning is actually a way to avoid taking action on the goals and interests that we say are important to us. For example, let's say you want to learn a foreign language. Reading a book on how to learn a foreign language quickly allows you to feel like you are making progress (\\\"Hey, I'm figuring out the best way to do this!\\\"). Of course, you're not actually practicing the action that would deliver your desired outcome (speaking the foreign language).\"}, {\"letter\": \"G\", \"content\": \"In situations like this one, we often claim that we are preparing or researching the best method, but these rationalizations allow us to feel like we are moving forward when we are merely spinning our wheels. We make the mistake of being in motion rather than taking action. Learning is valuable until it becomes a form of procrastination (拖延).\"}, {\"letter\": \"H\", \"content\": \"Another point to consider is that practice is learning, but learning is not practice. Passive learning is not a form of practice because although you gain new knowledge, you are not discovering how to apply that knowledge. Active practice, meanwhile, is one of the greatest forms of learning because the mistakes you make while practicing reveal important insights.\"}, {\"letter\": \"I\", \"content\": \"Even more importantly, practice is the only way to make a meaningful contribution with your knowledge. You can watch an online course about how to build a business or read an article about a terrible disaster in a developing nation, but that knowledge is unproductive unless you actually launch your business or donate to those in need. Learning by itself can be valuable for you but if you want to be valuable to others, then you have to express your knowledge in some way.\"}, {\"letter\": \"J\", \"content\": \"The last important point to consider is that practice focuses your energy on the process. Thomas Sterner once said, \\\"Progress is a natural result of staying focused on the process of doing anything.\\\" The state of your life right now is a result of the habits and beliefs that you have been practicing each day. When you realize this and begin to direct your focus toward practicing better habits day-in and day-out, continual progress will be the logical outcome. It is not the things we learn nor the dreams we visualize that determine our results, but rather the habits that we practice each day. Fall in love with boredom and focus your energy on the process, not the product.\"}, {\"letter\": \"K\", \"content\": \"What does this all mean? Is passive learning useless? Of course not. In many cases, learning for the sake of learning can be a beautiful thing. Not to mention that soaking up new information can help you make more informed decisions when you do decide to take action. That said, the main point of this article is that learning by itself does not lead to progress. We often hide behind information and use learning as an excuse to delay the more difficult and more important choice of actually doing something. Spend less time passively learning and more time actively practicing. Stop thinking and start doing.\"}], \"questions\": [{\"number\": 36, \"content\": \"Acquisition of new knowledge may not guarantee the progress that you aim to make.\", \"answer_paragraph\": \"C\"}, {\"number\": 37, \"content\": \"Your current situation in life is built on the beliefs and habits you have been practicing daily.\", \"answer_paragraph\": \"J\"}, {\"number\": 38, \"content\": \"Knowing the best way to learn a foreign language will not enable you to speak it without actual practice.\", \"answer_paragraph\": \"F\"}, {\"number\": 39, \"content\": \"People may find it demanding to create a goal which will take a long time to achieve.\", \"answer_paragraph\": \"A\"}, {\"number\": 40, \"content\": \"Learning and practicing seem to be very much alike, but the two processes can lead to quite different outcomes.\", \"answer_paragraph\": \"E\"}, {\"number\": 41, \"content\": \"Absorbing new information is helpful in making better decisions prior to action.\", \"answer_paragraph\": \"K\"}, {\"number\": 42, \"content\": \"Sometimes we may feel like we are making progress by doing some research or making preparations, but actually we are staying at the starting point.\", \"answer_paragraph\": \"G\"}, {\"number\": 43, \"content\": \"We are inclined to think that a lack of knowledge prevents us from advancing to a better future.\", \"answer_paragraph\": \"B\"}, {\"number\": 44, \"content\": \"Learning can benefit you by itself but only practice can turn what you learn into meaningful contributions.\", \"answer_paragraph\": \"I\"}, {\"number\": 45, \"content\": \"Practice involves repeating a process intentionally to attain a particular objective.\", \"answer_paragraph\": \"D\"}]}}, {\"subsection_name\": \"Section C\", \"directions\": \"There are 2 passages in this section. Each passage is followed by some questions or unfinished statements. For each of them there are four choices marked A), B), C) and D). You should decide on the best choice and mark the corresponding letter on Answer Sheet 2 with a single line through the centre.\", \"content\": {\"passages\": [{\"title\": \"Passage One\", \"content\": \"Research in human-vehicle interaction has shown even systems designed to automate driving are far from being error-proof. Recent evidence points to drivers' limited understanding of what these systems can and cannot do as a contributing factor to system misuse. A recent study tackles the issue of over-trusting drivers and the resulting system misuse from a legal viewpoint. It looks at what the manufacturers of self-driving cars should legally do to ensure that drivers understand how to use the vehicles appropriately.\\n\\nOne solution suggested in the study involves requiring buyers to sign end-user license agreements (EULAs), similar to the terms and conditions that require agreement when using new software products. But this is far from ideal. The agreement may not provide enough information to the driver, leading to confusion about the nature of the requests for agreement and their implications. Further, most end users don't read EULAs. A 2017 study shows 91 percent of people agree to them without reading. Among young people, 97 percent agree without reviewing the terms.\\n\\nThe issue is that, unlike using a smartphone app, operating a car has serious safety risks, whether the driver is human or software. And human drivers need to consent to take responsibility for the outcomes of the software and hardware.\\n\\n\\\"Warning fatigue\\\" and distracted driving are also causes for concern. For example, a driver, annoyed after receiving continuous warnings, could decide to just ignore the message. Or, if the message is presented while the vehicle is in motion, it could represent a distraction. Given these limitations and concerns, even if this mode of obtaining consent is to move forward, it likely won't fully protect automakers from their legal liability should the system malfunction (发生故障) or an accident occur.\\n\\nDriver training for self-driving vehicles can help ensure that drivers fully understand system capabilities and limitations. This needs to occur beyond the vehicle purchase. Recent evidence shows even relying on the information provided by the seller is not going to answer many questions. All of this considered, the road forward for self-driving cars is not going to be a smooth ride after all.\", \"questions\": [{\"number\": 46, \"content\": \"What do we learn from research in human-vehicle interaction?\", \"options\": [\"Automatic driving systems are by no means immune to errors.\", \"Driverless vehicles are likely to be misused by some people.\", \"Self-driving car manufacturers are not aware of the legal matters involved.\", \"There is a long way to go before humans can interact with driverless vehicles.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 47, \"content\": \"What is the problem with requiring buyers to sign end-user license agreements?\", \"options\": [\"End users, young and old alike, find the terms complex to interpret.\", \"Most end users sign them without bothering to read the terms.\", \"Many people are often confused by the wording of the terms.\", \"Most end users do not understand the terms after reading them through.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 48, \"content\": \"What would drivers do when they suffer from \\\"warning fatigue\\\"?\", \"options\": [\"Waste no time keeping the car moving.\", \"Rest a while to avoid fatigue driving.\", \"Take no action despite repeated warnings.\", \"Take note of the message though fatigued.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 49, \"content\": \"What does the author think of continuing to ask buyers to sign end-user license agreements?\", \"options\": [\"It will probably not guarantee the safety of drivers in case of accidents.\", \"It likely won't ensure that the automatic driving system functions properly.\", \"It likely won't fully protect automakers against accusations of deliberate cheating.\", \"It will probably not provide manufacturers adequate protection from legal responsibilities.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 50, \"content\": \"What should be done to help drivers fully understand system capabilities and limitations?\", \"options\": [\"Training them to be experts in vehicle automation.\", \"Familiarizing them with the systems through training.\", \"Broadening their knowledge of accident-prevention mechanisms.\", \"Facilitating their access to the information provided by the seller.\"], \"correct_answer\": \"\", \"analysis\": \"\"}]}, {\"title\": \"Passage Two\", \"content\": \"Do you ever blend up a protein drink for breakfast or grab a protein bar following an afternoon workout? If so, you are likely among the millions of people in search of more protein-rich diets.\\n\\nProtein-enriched products are found everywhere. But contrary to all the publicity that everyone needs more protein, most Americans get twice as much as they need.\\n\\nMany of us living in the most developed countries are buying into a myth of protein deficiency created by food companies and self-identified health experts. Global retail sales of protein supplement products reached an astonishing US$18.9 billion in 2020.\\n\\nBut are we really in need of more protein? Physicians in the U.S. have never actually examined a patient with protein deficiency because simply by eating an adequate number of daily calories we are also most likely getting enough protein.\\n\\nIn fact, Americans currently consume almost twice the National Academy of Medicine's recommended daily intake of protein although the most desirable protein intake may vary depending on age and activity level.\\n\\nFor example, if you're a dedicated athlete you might need to consume higher quantities of protein. Generally, though, a 140-pound person should not exceed 120 grams of protein per day, particularly because a high protein diet can strain kidney and liver function and increase risks of developing heart disease and cancer.\\n\\nWhile fats and sugar have taken the beating in turns since over a century ago, protein has managed to remain our red-hot favorite.\\n\\nIn the 1970s through the 1990s, protein products remained visible but moved back somewhat with the dietary spotlight firmly fixed on low-calorie, low-fat, sugar-free snack foods and beverages following the publication of studies linking sugar and saturated (饱和的) fat consumption to heart disease.\\n\\nLater research in 2003, however, suggested high-protein diets could aid in weight loss, and protein quickly regained its former nutrient-superstar status.\\n\\nNow most people living in high-income nations are consuming enough protein. When we replace meals with a protein bar or drink, we also risk missing out on the rich sources of antioxidants (抗氧化剂), vitamins and many other benefits of real food.\", \"questions\": [{\"number\": 51, \"content\": \"What do we learn about publicity over protein in America?\", \"options\": [\"It has helped to create the myth of protein deficiency.\", \"It has helped Americans in search of protein-rich diets.\", \"It has raised a lot of health concerns among the public.\", \"It has been funded by food companies and health experts.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 52, \"content\": \"Why have physicians in the U.S. never actually examined a patient with protein deficiency?\", \"options\": [\"Americans can purchase many kinds of protein-rich foods everywhere.\", \"Americans can absorb the number of calories recommended by food experts.\", \"Americans can get sufficient protein just by eating adequate foods daily.\", \"Americans can rely on food supplements to prevent protein deficiency.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 53, \"content\": \"What should people take into consideration in deciding on the most preferable protein intake?\", \"options\": [\"How healthy they are and what food they eat.\", \"How old they are and what activities they do.\", \"How much protein they consume and what their body weight is.\", \"How serious their protein deficiency is and what remedies they use.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 54, \"content\": \"What foods have been largely out of favor for more than a century?\", \"options\": [\"Sugar-free snacks.\", \"Protein-rich foods.\", \"Both red and white meats.\", \"Sugary and fatty foods.\"], \"correct_answer\": \"\", \"analysis\": \"\"}, {\"number\": 55, \"content\": \"What does the author imply people in developed countries should do to keep healthy?\", \"options\": [\"Enjoy natural food.\", \"Eat vegetarian diets.\", \"Consume enough protein daily.\", \"Replace meals with protein bars.\"], \"correct_answer\": \"\", \"analysis\": \"\"}]}]}]}",
        "questions": []
      },
      {
        "section_type": "translation",
        "section_name": "Part IV Translation",
        "section_order": 4,
        "time_allowed": "30 minutes",
        "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
        "content": "{\"translation_content\": \"敦煌莫高窟(Mogao Grottoes)数字展示中心于2014年开放启用,是莫高窟保护利用工程的重要组成部分。展示中心采用数字技术和多媒体展示手段,使游客进入洞窟参观之前就能了解莫高窟的历史文化,鉴赏莫高窟的艺术经典。这将减少开放洞窟的数量,缩短游客在洞窟内的逗留时间,减轻参观对莫高窟造成的影响,以使这一世界文化遗产得到妥善保护、长久利用。\", \"requirements\": {\"min_words\": 100, \"max_words\": 200}}",
        "questions": []
      }
    ]
  }
}