{
  "exam_papers": [
    {
      "id": 1,
      "exam_type": "CET-6",
      "year": 2022,
      "month": 12,
      "paper_number": 3,
      "title": "2022年12月大学英语六级考试真题（三）",
      "description": "2022年12月大学英语六级考试真题（第三套），包含写作、听力、阅读理解和翻译四个部分",
      "total_score": 710,
      "time_allowed": 130,
      "questions_count": 56,
      "sections_count": 6,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_sections": [
    {
      "id": 1,
      "paper_id": 1,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to write an essay that begins with the sentence \"Today increasing importance is being attached to cultivating college students' team spirit.\" You can make statements, give reasons, or cite examples to develop your essay. You should write at least 150 words but no more than 200 words.",
      "passage_content": "",
      "passage_title": "The Importance of Building Team Spirit",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "paper_id": 1,
      "section_type": "listening",
      "section_name": "听力部分",
      "section_order": 1,
      "time_allowed": 30,
      "directions": "说明：由于2022年12月六级考试全国共考了两套听力，本套真题听力与前两套内容相同，只是选项顺序不同，因此在本套真题中不再重复出现。",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 0,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section A",
      "section_order": 2,
      "time_allowed": 40,
      "directions": "In this section, there is a passage with ten blanks. You are required to select one word for each blank from a list of choices given in a word bank following the passage. Read the passage through carefully before making your choices. Each choice in the bank is identified by a letter. Please mark the corresponding letter for each item on Answer Sheet 2 with a single line through the centre. You may not use any of the words in the bank more than once.",
      "passage_content": "American colleges and universities are using 64 percent less coal than they did a decade ago, burning 700,000 tons last year, down from 2 million tons in 2008, the U.S. Energy Information Administration (EIA) said in a report ___26___ yesterday.\n\nAll 57 schools that were burning coal in 2008 are using less now, and 20 have ___27___ coal completely, EIA found.\n\nMost universities have turned to natural gas as a ___28___, with state funding backing the fuel switch.\n\nWhile academic institutions use less than 0.1 percent of U.S. coal burned for power, campus coal use has a history dating back to the 1800s when ___29___ to power was scarce.\n\nMany universities still operate their own power plants. The Public Utility Regulatory Policies Act of 1978 encouraged more electricity generation by allowing institutions to sell ___30___ power to utilities.\n\nBut EIA noted many coal-fired universities have signed onto the American College and University Presidents Climate Commitment, which was launched in 2007.\n\nAbout 665 schools are part of the program, which aims to ___31___ greenhouse gas emissions. Thirty percent of the participants have pledged to be carbon ___32___ within 20 years.\n\nThe Sierra Club's Beyond Coal campaign, which also leads campaigns for universities to withdraw their ___33___ in coal and other fossil fuels, lists 22 schools that have pledged to move \"beyond coal,\" including Clemson University, Indiana University, Ohio University, Penn State University, the University of Louisville and the University of Tennessee, Knoxville.\n\nThe largest coal use ___34___ at colleges were in Michigan, Missouri, Tennessee and Indiana. Indiana's universities alone cut coal ___35___ by 81 percent between 2008 and 2015.\n\nDuring the same period, Michigan made an 80 percent cut and Tennessee cut back by 94 percent at state institutions.",
      "passage_title": "University Coal Use Has Plunged 64% Since 2008",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section B",
      "section_order": 3,
      "time_allowed": 40,
      "directions": "In this section, you are going to read a passage with ten statements attached to it. Each statement contains information given in one of the paragraphs. Identify the paragraph from which the information is derived. You may choose a paragraph more than once. Each paragraph is marked with a letter. Answer the questions by marking the corresponding letter on Answer Sheet 2.",
      "passage_content": "A. In 1913, classical music sparked a riot in Paris. Igor Stravinsky was introducing his revolutionary \"Rite of Spring\" ballet to the world, with its discordant melodies and unorthodox choreography (编舞), and the purists in the crowd expressed their disapproval loud and clear. It might have been classical music's version of the time Bob Dylan went electric at the Newport Folk Festival. \"The noise, fighting, and shouting in the audience got so loud,\" NPR's music reporter Miles Hoffman said of the Stravinsky debut, \"that the choreographer had to shout out the numbers to the dancers so that they knew what they were supposed to do.\"\n\nB. It's difficult to imagine a similar disturbance occurring today within America's sacred symphony halls. In fact, it's hard to picture any kind of disruptive activity at all (unless someone's cell phone happens to go off and then you'd better watch your back). A mannerly aura (氛围) hangs over most classical proceedings, and many of the genre's biggest supporters would have it no other way.\n\nC. Today, Western audiences for classical music and opera and ballet are almost always well dressed, older, respectful, achingly silent and often very wealthy (one has to be able to afford most tickets). But as many of America's most storied \"highbrow\" (高雅的) institutions struggle financially—the Philadelphia Orchestra's much-publicized rebound from bankruptcy is just one recent example—classical music fans and theorists are wondering how the medium can weave itself into the 21st century's cultural fabric without sacrificing its integrity.\n\nD. For example, should we feel OK \"clapping\" during classical music events, even if nobody else is? Why shouldn't we cheer for something great, like we do at a rock concert? The Huffington Post recently ran a Great Debate on this issue and many commenters came out on the side of silence. \"There is no more rewarding experience in life than being part of an audience where everybody is leaning forward in silence, thoroughly carried away by a great performance of a masterpiece,\" one commenter wrote. \"Why is it so difficult for folks to develop an appreciation and understanding for the mannerisms and traditions of classical music?\" asked another.\n\nE. The truth is that classical music audiences weren't always so polite. Robert Greenberg, an award-winning composer, said that when Beethoven first performed his 7th Symphony, audiences forced the orchestra to perform encores (重演) of certain movements immediately, applauding wildly. And in the last few decades, he said, many audiences at opera performances have abandoned pretenses, yelling \"Bravo\" when they feel like it.\n\nF. \"I don't think there's anything wrong with an audience showing their enthusiasm for a proper moment by applauding, showing their joy,\" Greenberg said, noting that the stuffiness in concert halls is \"one aspect of contemporary concert etiquette\" he doesn't understand. \"Instead of waiting half an hour to show enthusiasm, why not show it every eight or nine minutes?\"\n\nG. Until the rules about behavior and clothing change, it's hard to imagine multitudes of young people filling concert halls on their own accord. They're probably more likely to head to Central Park to watch a free performance with a bottle of wine and their friends. \"I think anyone should be able to come into a performance dressed any way they like, and be comfortable any way they like, sitting in that seat ready to enjoy themselves,\" Greenberg said. \"Because it's enjoyable.\"\n\nH. Greenberg stressed that he doesn't want people to start respecting the music less, and he's not suggesting that we \"dumb down\" the experience. Rather, it's about opening up \"access.\" When operas first instituted subtitles (字幕) during shows, he said, many purists didn't like the idea, believing that the audience should instead study the works before attending. But now it's commonplace to find titles on the seatback in front of you—choose a language, sit back, and understand what's going on.\n\nI. Allison Vulgamore, president of the Philadelphia Orchestra, is certainly looking to the future. She says certain \"classics concerts\" dedicated to the old masters will always exist, but not every program has to feature Beethoven and Brahms—or even a stage and seats. \"We're trying to introduce different kinds of concerts in different ways,\" she said. \"We are an interactive society now, where people like to learn.\"\n\nJ. As the Philadelphia Orchestra rebounds from its financial straits, it is also aiming to experiment, without alienating the loyalists. Vulgamore pointed to Cirque de la Symphonie, a recent offering in which jugglers (玩杂耍的人) and acrobats (杂技演员) interacted with musicians. An upcoming collaboration with New York City's Ridge Theatre, meanwhile, will feature a \"suspended dance installation\" and other theatrical elements occurring in conjunction with an orchestral piece.\n\nK. The orchestra also continues to offer $25 annual memberships to Philadelphia students, who can buy rush tickets to every concert on the schedule. \"Students line up for the concerts they want, and we get roughly 300 or 350 kids a night coming to these. They take any of the open seats available, 5 minutes before the concert starts,\" Vulgamore said. \"It's like the running of the bulls, that energy when the doors open.\"\n\nL. Greenberg thinks that youthful energy needs to be harvested. Conductors don't have to be arrogant and untouchable—they can be accessible. Perhaps there could even be a \"bit of humor\" about them, he suggested, and an abandoning of pretension within the high-art institutions themselves. \"On one hand, these organizations are all saying the same thing: we want more general audiences, to break down cultural barriers,\" he said. \"But then they come up with some very snooty (目中无人的) thing that makes you crazy.\"\n\nM. John Terauds, a critic who has covered Toronto's classical music scene extensively, also wants to do away with the stuffiness. He suggested that the warmer an audience is, the better the musicians themselves will respond. \"But the producer or organizer has to let everyone know it's OK,\" he said. \"It's OK to enjoy yourself.\" At the Toronto Symphony Orchestra, for example, conductor Peter Oundjian often stops between pieces, taking a moment to talk about the composer or the music in a very amiable way. And some nights, Terauds said, \"at least a third\" of the audience consists of students who have purchased cheaper tickets. On these nights, the energy of the room drastically shifts. It becomes a less intimidating place.\n\nN. Back in February, Terauds wrote on his blog about how going to classical performances can be intimidating. Certain people \"think they have to dress up,\" he wrote. \"They think they have to know something about the music before they go. And, I'm sure, sitting in a seat, trembling in fear that this might be the wrong time to applaud, is also one of the factors.\"\n\nO. Everyone in the classical world agrees on the need for increased \"accessibility,\" but achieving it is often easier said than done. Nowadays, there are unknown, unorthodox opera singers wowing (博得……的喝彩) viewers on TV programs like \"America's Got Talent\" and \"The Voice\". What can higher institutions do with any of that? And if they appeal to these outlets, do they risk compromising the integrity or the intelligence of the music?\n\nP. Vulgamore seems to understand this. She thinks an organization can have it both ways, claiming the new while keeping the old. And as she reorganizes the Philadelphia Orchestra, she will attempt to do just that. \"The world's most respected musicians brought together as an orchestra will always exist,\" she said. \"But it's essential that we be willing to experiment and fail.\"",
      "passage_title": "Classical music aims to evolve, build audiences without alienating old guard",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section C",
      "section_order": 4,
      "time_allowed": 40,
      "directions": "There are 2 passages in this section. Each passage is followed by some questions or unfinished statements. For each of them there are four choices marked A), B), C) and D). You should decide on the best choice and mark the corresponding letter on Answer Sheet 2 with a single line through the centre.",
      "passage_content": "Passage One\n\nHow can one person enjoy good health, while another person looks old before her time? Humans have been asking this question for thousands of years, and recently, it's becoming clearer and clearer to scientists that the differences between people's rates of aging lie in the complex interactions among genes, social relationships, environments and lifestyles. Even though you were born with a particular set of genes, the way you live can influence how they express themselves. Some lifestyle factors may even turn genes on or shut them off.\n\nDeep within the genetic heart of all our cells are telomeres, or repeating segments of noncoding DNA that live at the ends of the chromosomes (染色体). They form caps at the ends of the chromosomes and keep the genetic material together. Shortening with each cell division, they help determine how fast a cell ages. When they become too short, the cell stops dividing altogether. This isn't the only reason a cell can age—there are other stresses on cells we don't yet understand very well—but short telomeres are one of the major reasons human cells grow old. We've devoted most of our careers to studying telomeres, and one extraordinary discovery from our labs is that telomeres can actually lengthen.\n\nScientists have learned that several thought patterns appear to be unhealthy for telomeres, and one of them is cynical hostility. Cynical hostility is defined by high anger and frequent thoughts that other people cannot be trusted. Someone with hostility doesn't just think, \"I hate to stand in long lines\"; they think, \"Others deliberately sped up and beat me to my rightful position in the line!\"—and then get violently agitated. People who score high on measures of cynical hostility tend to get more heart disease, metabolic disease and often die at younger ages. They also have shorter telomeres. In a study of British civil servants, men who scored high on measures of cynical hostility had shorter telomeres than men whose hostility scores were low. The most hostile men were 30% more likely to have short telomeres.\n\nWhat this means: aging is a dynamic process that could possibly be accelerated or slowed—and, in some aspects, even reversed. To an extent, it has surprised us and the rest of the scientific community that telomeres do not simply carry out the commands issued by your genetic code. Your telomeres are listening to you. The foods you eat, your response to challenges, the amount of exercise you get, and many other factors appear to influence your telomeres and can prevent premature aging at the cellular level. One of the keys to enjoying good health is simply doing your part to foster healthy cell renewal.\n\nPassage Two\n\nScientists have created by accident an enzyme (酶) that breaks down plastic drinks bottles. The breakthrough could help solve the global plastic pollution crisis by enabling for the first time the full recycling of bottles.\n\nThe new research was spurred by the discovery in 2016 of the first bacterium that had naturally evolved to eat plastic at a waste dump in Japan. Scientists have now revealed the detailed structure of the crucial enzyme produced by the bug.\n\nAn international team then adjusted the enzyme to see how it had evolved, but tests showed they had accidentally made the molecule even better at breaking down the plastic used for drinks bottles. \"What actually turned out was we improved the enzyme, which was a bit of a shock,\" said head researcher Prof. McGeehan, at the University of Portsmouth, UK.\n\nCurrently, the enzyme takes a few days to start breaking down the plastic, far faster than the centuries it takes in the oceans, but the researchers are optimistic this can be speeded up even further and become a viable large-scale process.\n\n\"What we are hoping to do is use this enzyme to turn this plastic back into its original components, so we can literally recycle it back to plastic,\" said McGeehan. \"It means we won't need to dig up any more oil and, fundamentally, it should reduce the amount of plastic in the environment.\"\n\nAbout 1 million plastic bottles are sold each minute around the globe and, with just 14% recycled, many end up in the oceans where they have polluted even the remotest parts, harming marine life and potentially people who eat sea food. \"Plastic is incredibly resistant to degradation,\" said McGeehan. \"It is one of these wonder materials that has been made a little bit too well.\"\n\nCurrently those bottles that are recycled can only be turned into opaque fibres for clothing or carpets, while the new enzyme indicates a way to recycle old clear plastic bottles back into new clear plastic bottle.\n\n\"You are always up against the fact that oil is cheap, so plastic is cheap,\" said McGeehan. \"It is so easy for manufacturers to generate more of that stuff, rather than even try to recycle, but I believe there is a public interest here: perception is changing so much that companies are starting to look at how they can properly recycle these bottles.\"\n\nProf. Adisa Azapagic, at the University of Manchester in the UK, agreed the enzyme could be useful but added: \"A full life-cycle assessment would be needed to ensure that the technology does not solve one environmental problem—waste—at the expense of others, including additional greenhouse gas emissions.\"",
      "passage_title": "",
      "passage_type": "reading",
      "has_multiple_passages": 1,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 6,
      "paper_id": 1,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 5,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "云贵高原(the Yunnan-Guizhou Plateau)大部分位于云南、贵州省境内，总面积约50万平方公里，平均海拔2000-4000米，是中国第四大高原。云贵高原西南东低，河流众多，形成了许多又深又陡的峡谷(canyon)。峡谷中许多地方土壤肥沃，非常有利于多种农作物生长。云贵高原独特的自然环境造就了生物和文化的多样性。它是中国森林和矿产资源类型十分丰富的地区，也是古人类起源的重要地区。云贵高原是中国少数民族数量最多的地区，各民族都保留了自己丰富多彩的文化传统。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_questions": [
    {
      "id": 1,
      "section_id": 1,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write an essay that begins with the sentence \"Today increasing importance is being attached to cultivating college students' team spirit.\"",
      "options": "[]",
      "correct_answer": "",
      "analysis": "写作题目，需要学生以\"Today increasing importance is being attached to cultivating college students' team spirit.\"开头，写一篇关于培养大学生团队精神的议论文",
      "explanation": "考查学生的议论文写作能力，包括论点阐述、论证支持和结论总结",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 26,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "K",
      "analysis": "动词辨析题。空格前面是一个介词短语 in a report,后面是时间副词 yesterday,由此可推断空格处填的单词应该是 report 的后置定语,那么只能是动词的过去分词形式。动词的过去分词中,K) released表示\"发布,公开\",用在这里表示\"昨天发布的报告\",符合文意。",
      "explanation": "美国能源信息署(EIA)在昨天发布的一份报告中称，美国高校的煤炭使用量比十年前减少了64%。",
      "question_order": 0,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 27,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "A",
      "analysis": "动词辨析题。空格前面是 have,后面是名词 coal,如果此处 have 是实义动词,那么空格处应该填入一个形容词或名词;如果 have 是助动词,那么此处应为现在完成时,空格处应填入一个动词的过去分词形式。而后面的副词 completely 和实义动词 have 语义上不能搭配,由此可推断出空格处为动词的过去分词。在所有过去分词的备选项中,只有 A) abandoned\"放弃\"可以与 coal 搭配,表示\"弃用煤炭\",符合语境。",
      "explanation": "美国能源信息署发现，2008年使用煤炭的所有57所学校现在都在减少煤炭的使用，其中20所学校已完全弃用煤炭。",
      "question_order": 1,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 28,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "L",
      "analysis": "名词辨析题。空格前面是不定冠词a,由此可推断出空格处是一个单数名词。由上文可知,很多高校都减少了煤炭的使用量,而空格所在句指出它们能使用天然气,说明它们是用天然气来代替煤炭,空格处填入的名词应该有\"替代品\"的意思。",
      "explanation": "大多数高校已经转而使用天然气作为替代品，并有国家资金支持燃料转换。",
      "question_order": 2,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 29,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "B",
      "analysis": "名词辨析题。空格所在部分是一个定语从句,修饰前面的时间 the 1800s,该从句包含系动词 was 和表语 scarce,但主语不完整,由此可推断空格处应填入一个名词,并且是单数名词或不可数名词,和后面的 to power 组成名词短语。B) access\"使用的机会\"用在这里表示\"能得到电力供应的机会是很少的\",符合语境。",
      "explanation": "虽然学术机构使用的煤炭不到美国用于电力燃烧的0.1%，但校园煤炭使用的历史可以追溯到19世纪，当时电力供应匮乏。",
      "question_order": 3,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 6,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 30,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "N",
      "analysis": "形容词辨析题。空格前面是动词 sell,后面是名词 power,说明空格处应填入一个形容词或名词的单词,而备选项中的所有名词都不能与 power 搭配,因此可推断出空格处应该是一个形容词。N) surplus\"剩余的\"用在这里表示\"剩余电力\",符合语境。",
      "explanation": "1978年颁布的《公共事业管制政策法》允许院校向公用事业公司出售剩余电力，从而鼓励更多的电力生产。",
      "question_order": 4,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 7,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 31,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "M",
      "analysis": "动词辨析题。空格前方动词 aims 后接不定式 to,后面是名词短语 greenhouse gas emissions,说明空格处应该填入一个动词原形。上一段提到,许多燃煤的高校已经签署了2007年启动的\"美国高校校长气候承诺\",可以推断出这个承诺的目的应该是让气候变得更好,如果要符合这个期盼的话就应该减少温室气体排放,备选项中只有 M) slash\"大幅度削减\"符合语境。",
      "explanation": "大约665所学校参与了该计划，旨在减少温室气体排放。",
      "question_order": 5,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 8,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 32,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "I",
      "analysis": "名词辨析题。由句子结构可判断,空格处的词应和前面的 carbon 共同组成名词短语,作 to be 的表语,由此可知,空格处应该填入一个名词。备选项中的名词 I) neutral 和 carbon 是固定搭配,carbon neutral 表示\"碳中和\",符合语境。",
      "explanation": "30%的参与者承诺在20年内实现碳中和。",
      "question_order": 6,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 9,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 33,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "F",
      "analysis": "名词辨析题。空格前面是形容词性物主代词 their,后面是地点状语,由此可推断出空格处应该填入名词。F) investments表示\"投资\",用在这里表示\"减少对煤炭和其他燃料的投资\",符合语境。",
      "explanation": "塞拉俱乐部发起的\"超越煤炭运动\"还领导了高校撤回对煤炭和其他化石燃料投资的运动。",
      "question_order": 7,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 10,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 34,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "J",
      "analysis": "名词辨析题。空格前面是名词短语coal use,后面是地点状语,且空格所在部分the largest coal use at colleges是整句话的主语,由此可推断该部分没有谓语动词,所以空格处应填入的是一个名词。下一句提到印第安纳州的高校煤炭使用量具体缩减了多少,说明上文中讲的也是缩减煤炭使用量的内容,各选项中的J) reductions\"减少\"符合文意。",
      "explanation": "密歇根州、密苏里州、田纳西州和印第安纳州的高校煤炭使用量减少幅度最大。",
      "question_order": 8,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 11,
      "section_id": 3,
      "question_type": "blank_filling",
      "question_number": 35,
      "question_text": "",
      "options": "[\"A. abandoned\", \"B. access\", \"C. consumption\", \"D. neutral\", \"E. duplications\", \"F. investments\", \"G. mobilized\", \"H. negligent\", \"I. neutral\", \"J. reductions\", \"K. released\", \"L. replacement\", \"M. slash\", \"N. surplus\", \"O. void\"]",
      "correct_answer": "C",
      "analysis": "名词辨析题。空格所在句结构完整,空格前是名词coal,后面是介词by引出状语,由此可推断空格处应该填入一个名词,和coal组成名词短语。上下文中都提到各州高校减少煤炭的使用,因此空格处的名词也应该与\"使用\"的意思相近,各选项中只有C) consumption\"消耗\"可以搭配动词cut,且符合文意。",
      "explanation": "在2008年至2015年期间，仅印第安纳州的高校就减少了81%的煤炭消耗。",
      "question_order": 9,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 12,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 36,
      "question_text": "It was not a rare occurrence that audiences behaved wildly while listening to classical music.",
      "options": "[]",
      "correct_answer": "E",
      "analysis": "细节归纳题。E段第一句提到，古典音乐的听众并不总是那么有礼貌，接着以观众迫切要求乐团重新演奏某些乐章的例子来佐证这一观点。该段最后一句又提到，在过去的几十年里，歌剧表演中的许多观众已经放弃了伪装，他们喜欢表演时就会大喊\"Bravo(好极了)\"。由此可知，题干是对E段定位句的归纳概括：观众在听古典音乐时经常出现狂热失控的行为。",
      "explanation": "E段第一句：'The truth is that classical music audiences weren't always so polite.' 和最后一句：'And in the last few decades, he said, many audiences at opera performances have abandoned pretenses, yelling \"Bravo\" when they feel like it.'",
      "question_order": 10,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 13,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 37,
      "question_text": "Some high-art institutions don't actually mean it when they say they want more general audiences.",
      "options": "[]",
      "correct_answer": "L",
      "analysis": "细节推断题。L段定位句指出，这些高级艺术机构都表示希望有更多的普通观众，以打破文化障碍，但后来他们却提出了一些非常目中无人的要求，这些要求会让观众发疯。由此可以推断，这些高级艺术机构并非真心实意地欢迎更多的普通观众。",
      "explanation": "L段最后两句：'On one hand, these organizations are all saying the same thing: we want more general audiences, to break down cultural barriers,' he said. 'But then they come up with some very snooty thing that makes you crazy.'",
      "question_order": 11,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 14,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 38,
      "question_text": "The theatre was in chaos when an unconventional ballet was first put on stage in the capital of France.",
      "options": "[]",
      "correct_answer": "A",
      "analysis": "同义转述题。A段定位句提到，1913年，在巴黎，伊戈尔·斯特拉文斯基向世界展示了他革命性的芭蕾舞《春之祭》，旋律不和谐，编舞非正统，人群中的纯粹主义者大声而明确地表达了他们的不满，因而引发了一场骚乱。题干中的was in chaos对应原文中的sparked a riot;题干中的unconventional是原文中unorthodox的同义词；题干中的was first put on stage是对原文中introducing的同义转述。",
      "explanation": "A段第一句：'In 1913, classical music sparked a riot in Paris. Igor Stravinsky was introducing his revolutionary \"Rite of Spring\" ballet to the world, with its discordant melodies and unorthodox choreography, and the purists in the crowd expressed their disapproval loud and clear.'",
      "question_order": 12,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 15,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 39,
      "question_text": "According to one critic, the audience's warm response would encourage the musicians to do a better job.",
      "options": "[]",
      "correct_answer": "M",
      "analysis": "同义转述题。M段定位句提到，约翰·特劳德斯是一位曾广泛报道过多伦多古典音乐界的评论家，他认为观众越热情，音乐家们自己的反应就越好。题干是对原文的同义转述。",
      "explanation": "M段前两句：'John Terauds, a critic who has covered Toronto's classical music scene extensively, also wants to do away with the stuffiness. He suggested that the warmer an audience is, the better the musicians themselves will respond.'",
      "question_order": 13,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 16,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 40,
      "question_text": "Many commenters argued for the audience enjoying classical music quietly.",
      "options": "[]",
      "correct_answer": "D",
      "analysis": "细节推断题。D段定位句首先提出问题：我们是否应该觉得在古典音乐活动中\"鼓掌\"是可以接受的，即使其他人没有这样做？为什么我们不能像在摇滚音乐会上那样为伟大的作品欢呼呢？接着提到，《赫芬顿邮报》最近就这个问题进行了一场辩论，许多评论员都站在\"保持安静\"一边。由此可推断，许多评论员认为听众应该安静地去欣赏古典音乐。",
      "explanation": "D段前三句：'For example, should we feel OK \"clapping\" during classical music events, even if nobody else is? Why shouldn't we cheer for something great, like we do at a rock concert? The Huffington Post recently ran a Great Debate on this issue and many commenters came out on the side of silence.'",
      "question_order": 14,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 17,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 41,
      "question_text": "What appears on the seatback screen makes it unnecessary for the audience to study the works beforehand.",
      "options": "[]",
      "correct_answer": "H",
      "analysis": "细节推断题。H段定位句指出，当歌剧首次在演出期间设置字幕时，许多纯粹主义者不喜欢这个想法，他们认为观众应该在观看之前先研究一下作品。但现在观众普遍可以在座椅靠背上找到字幕，很容易就能明白作品的内容。由此可推断出，有了这些座椅屏幕上的字幕，观众就没有必要再事先研究作品了。",
      "explanation": "H段最后两句：'When operas first instituted subtitles during shows, he said, many purists didn't like the idea, believing that the audience should instead study the works before attending. But now it's commonplace to find titles on the seatback in front of you—choose a language, sit back, and understand what's going on.'",
      "question_order": 15,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 18,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 42,
      "question_text": "It is generally accepted that there should be no disturbance from the audience during classical music performance.",
      "options": "[]",
      "correct_answer": "B",
      "analysis": "细节归纳题。B段第一句衔接上文，表示很难想象今天在美国神圣的交响乐大厅内会发生类似的骚乱，接着提到平时在欣赏古典音乐表演时即便手机响了也相当小心。最后一句又指出，大多数古典音乐的表演过程都被一种彬彬有礼的氛围笼罩着。由此可见，题干是对B段的归纳概括：这种骚乱在古典音乐表演中极为罕见，说明人们都认为在欣赏表演的过程中观众不应有干扰性的行为。",
      "explanation": "B段：'It's difficult to imagine a similar disturbance occurring today within America's sacred symphony halls. In fact, it's hard to picture any kind of disruptive activity at all (unless someone's cell phone happens to go off and then you'd better watch your back). A mannerly aura hangs over most classical proceedings, and many of the genre's biggest supporters would have it no other way.'",
      "question_order": 16,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 19,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 43,
      "question_text": "Higher institutions will be concerned about compromising the integrity of classical music if they have to resort to the television medium.",
      "options": "[]",
      "correct_answer": "O",
      "analysis": "同义转述题。O段定位句提出疑问：面对如今电视节目中非正统歌剧演员深受好评的现象，更高级的机构如果求助于这些表演平台寻求改变，是否有可能损害音乐的完整性或智慧？题干和原文内容意思相符。",
      "explanation": "O段最后两句：'Nowadays, there are unknown, unorthodox opera singers wowing viewers on TV programs like \"America's Got Talent\" and \"The Voice\". What can higher institutions do with any of that? And if they appeal to these outlets, do they risk compromising the integrity or the intelligence of the music?'",
      "question_order": 17,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 20,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 44,
      "question_text": "Heavily discounted rush tickets help attract many young students to attend classical concerts.",
      "options": "[]",
      "correct_answer": "K",
      "analysis": "细节归纳题。K段定位句指出，乐团向费城学生出售会员资格，他们可以买日程表上每场音乐会的抢购票。乐团的主席瓦尔格莫也提到，每晚大约有300或350个孩子参加这些音乐会。由此可知，题干是对K段定位句的归纳概括。",
      "explanation": "K段前两句：'The orchestra also continues to offer $25 annual memberships to Philadelphia students, who can buy rush tickets to every concert on the schedule. \"Students line up for the concerts they want, and we get roughly 300 or 350 kids a night coming to these.\"'",
      "question_order": 18,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 21,
      "section_id": 4,
      "question_type": "paragraph_matching",
      "question_number": 45,
      "question_text": "The formalities of high-art theatres can intimidate some people attending a performance.",
      "options": "[]",
      "correct_answer": "N",
      "analysis": "细节归纳题。N段第一句指出，早在今年2月，特劳德斯在他的博客上表示欣赏古典表演会令人生畏，之后又具体解释原因：有人认为必须盛装打扮，有人认为在去之前必须对音乐有所了解，还有人可能会担心自己鼓掌的时机不对。这些都是高级艺术剧院中涉及古典音乐表演的一些礼节要求，而这些要求令人对欣赏古典表演感到胆怯。",
      "explanation": "N段：'Back in February, Terauds wrote on his blog about how going to classical performances can be intimidating. Certain people \"think they have to dress up,\" he wrote. \"They think they have to know something about the music before they go. And, I'm sure, sitting in a seat, trembling in fear that this might be the wrong time to applaud, is also one of the factors.\"'",
      "question_order": 19,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 22,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 46,
      "question_text": "What have scientists come to know better today?",
      "options": "[\"A) Why people age at different rates.\", \"B) How genes influence the aging process.\", \"C) How various genes express themselves in aging.\", \"D) Why people have long been concerned about aging.\"]",
      "correct_answer": "A",
      "analysis": "事实细节题。文章首段第一、二句指出，几千年来，人类一直在追问一个问题：为什么一个人可以享受健康，而另一个人却看起来未老先衰？最近，科学家们越来越清楚地认识到，人们衰老速度的差异在于基因、社会关系、环境和生活方式之间复杂的相互作用。由此可知，科学家们最近了解到的是人们衰老速度差异的原因，故答案为A)。",
      "explanation": "首段第一、二句：'How can one person enjoy good health, while another person looks old before her time? Humans have been asking this question for thousands of years, and recently, it's becoming clearer and clearer to scientists that the differences between people's rates of aging lie in the complex interactions among genes, social relationships, environments and lifestyles.'",
      "question_order": 20,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 23,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 47,
      "question_text": "Why are some lifestyle factors considered extremely important?",
      "options": "[\"A) They may shorten the process of cell division.\", \"B) They may determine how genes function.\", \"C) They may affect the lifespan of telomeres.\", \"D) They may account for the stresses on cells.\"]",
      "correct_answer": "B",
      "analysis": "事实细节题。文章首段第三、四句提到，即使你生来就有一组特定的基因，你的生活方式也会影响它们的表达方式。一些生活方式方面的因素甚至可能会打开或关闭这些基因。由此可知，生活方式方面的因素甚至可以决定基因是否能发挥作用，因此极其重要，故答案为B)。",
      "explanation": "首段第三、四句：'Even though you were born with a particular set of genes, the way you live can influence how they express themselves. Some lifestyle factors may even turn genes on or shut them off.'",
      "question_order": 21,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 24,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 48,
      "question_text": "What have the author and his colleagues discovered about telomeres?",
      "options": "[\"A) Their number affects the growth of cells.\", \"B) Their length determines the quality of life.\", \"C) Their shortening process can be reversed.\", \"D) Their health impacts the division of cells.\"]",
      "correct_answer": "C",
      "analysis": "推理判断题。文章最后一段第一句指出，衰老是一个动态的过程，有可能加速或减缓，而且在某些方面甚至可以逆转。通过前文可知，端粒的缩短是细胞衰老的主要原因之一，由此可推断出细胞衰老过程就是端粒缩短过程，而这个过程是可以被逆转的，故答案为C)。",
      "explanation": "最后一段第一句：'What this means: aging is a dynamic process that could possibly be accelerated or slowed—and, in some aspects, even reversed.' 和第二段最后一句：'We've devoted most of our careers to studying telomeres, and one extraordinary discovery from our labs is that telomeres can actually lengthen.'",
      "question_order": 22,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 25,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 49,
      "question_text": "What have scientists learned about cynical hostility?",
      "options": "[\"A) It may lead to confrontational thought patterns.\", \"B) It may produce an adverse effect on telomeres.\", \"C) It may cause people to lose their temper frequently.\", \"D) It may stir up agitation among those in long lines.\"]",
      "correct_answer": "B",
      "analysis": "事实细节题。第三段第一句指出，科学家们已经了解到，有几种思维模式似乎会对端粒产生不利影响，其中之一就是愤世嫉俗的敌意。由此可知答案为B)。",
      "explanation": "第三段第一句：'Scientists have learned that several thought patterns appear to be unhealthy for telomeres, and one of them is cynical hostility.'",
      "question_order": 23,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 26,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 50,
      "question_text": "What do we learn from the last paragraph about the process of aging?",
      "options": "[\"A) It may vary from individual to individual.\", \"B) It challenges scientists to explore further.\", \"C) It depends on one's genetic code.\", \"D) It may be controlled to a degree.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。文章最后一段第一句提到，衰老是一个动态的过程，有可能加速或减缓，而且在某些方面甚至可以逆转；最后一句又提到，享受良好健康的关键之一就是简单地尽你自己的一份力来促进有益于健康的细胞更新。说明衰老的过程是可以发生改变的，而且我们可以通过自己的努力来促进有益健康的细胞更新，从而延缓衰老。由此可推断衰老的过程在一定程度上是可以得到控制的，故答案为D)。",
      "explanation": "最后一段第一句：'What this means: aging is a dynamic process that could possibly be accelerated or slowed—and, in some aspects, even reversed.' 和最后一句：'One of the keys to enjoying good health is simply doing your part to foster healthy cell renewal.'",
      "question_order": 24,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 27,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 51,
      "question_text": "What do we learn from the passage about an enzyme scientists have created?",
      "options": "[\"A) It was identified during a lab experiment accident.\", \"B) It may make full recycling of plastic bottles a reality.\", \"C) It was a breakthrough made with persistent efforts.\", \"D) It may initiate a radical reform in plastic industry.\"]",
      "correct_answer": "B",
      "analysis": "事实细节题。定位句指出，科学家偶然制出了一种能分解塑料饮料瓶的酶，随后一句说，这一突破将首次实现塑料瓶的完全回收，可见B)为该句的同义表述，故为答案。",
      "explanation": "第一段：'Scientists have created by accident an enzyme that breaks down plastic drinks bottles. The breakthrough could help solve the global plastic pollution crisis by enabling for the first time the full recycling of bottles.'",
      "question_order": 25,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 28,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 52,
      "question_text": "What does the passage say about the bug that produces the important enzyme?",
      "options": "[\"A) It has a natural ability to consume plastics.\", \"B) It is a bacterium that reproduces at a high rate.\", \"C) It is essential to the recycling of plastic bottles.\", \"D) It has a chemical structure unknown to scientists.\"]",
      "correct_answer": "A",
      "analysis": "事实细节题。第二段第二句提到了bug,由上下文可知，这里的bug就是指前一句中提到的bacterium。第二段首句指出，这种细菌是第一种自然进化出的以塑料为食的细菌，可知它具有消耗塑料的天然能力，故答案为A)。",
      "explanation": "第二段第一句：'The new research was spurred by the discovery in 2016 of the first bacterium that had naturally evolved to eat plastic at a waste dump in Japan.'",
      "question_order": 26,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 29,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 53,
      "question_text": "By adjusting the enzyme produced by the bug, the scientists ______.",
      "options": "[\"A) made it more effective by chance\", \"B) discovered an extraordinary chemical\", \"C) altered its basic molecular composition\", \"D) found its evolutionary process sped up\"]",
      "correct_answer": "A",
      "analysis": "事实细节题。定位句提到，科学家对这种酶进行了调整，原本的目的是观察它们如何进化，但测试结果显示，他们意外地增强了这种分子分解饮料瓶所用的塑料时的作用，可知A)为该句信息的表述，故为答案。",
      "explanation": "第三段：'An international team then adjusted the enzyme to see how it had evolved, but tests showed they had accidentally made the molecule even better at breaking down the plastic used for drinks bottles. \"What actually turned out was we improved the enzyme, which was a bit of a shock,\" said head researcher Prof. McGeehan.'",
      "question_order": 27,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 30,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 54,
      "question_text": "What does Prof. McGeehan say about the recycling of plastic bottles?",
      "options": "[\"A) Manufacturers are implementing it on an increasingly larger scale.\", \"B) It generates huge business opportunities for plastic manufacturers.\", \"C) It has aroused persistent interest among the general public.\", \"D) Manufacturers are beginning to explore ways of doing it.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。该段最后一句提到，对于制造商而言，生产更多的塑料比试图回收更容易，但由于回收塑料涉及公众利益，导致人们的看法也发生了巨大变化，所以这些制造商公司也开始考虑如何适当地回收这些瓶子，可知D)是对该句部分信息的表述，故为答案。",
      "explanation": "第八段最后一句：'It is so easy for manufacturers to generate more of that stuff, rather than even try to recycle, but I believe there is a public interest here: perception is changing so much that companies are starting to look at how they can properly recycle these bottles.'",
      "question_order": 28,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 31,
      "section_id": 5,
      "question_type": "single_choice",
      "question_number": 55,
      "question_text": "What is Prof. Adisa Azapagic's advice concerning the application of the enzyme?",
      "options": "[\"A) Developing technologies to address greenhouse gas emissions.\", \"B) Considering the extra cost involved in producing the enzyme.\", \"C) Assessing its possible negative impact on the environment.\", \"D) Studying the full life cycle of the enzyme as the first step.\"]",
      "correct_answer": "C",
      "analysis": "推理判断题。在该段引用这位教授的话中，提及需要进行一个全生命周期的评估，目的在于确保新的塑料分解技术不会以引起其他环境问题为代价，可知评估的目的在于这项新技术会不会对环境造成负面影响，故答案为C)。",
      "explanation": "最后一段：'Prof. Adisa Azapagic, at the University of Manchester in the UK, agreed the enzyme could be useful but added: \"A full life-cycle assessment would be needed to ensure that the technology does not solve one environmental problem—waste—at the expense of others, including additional greenhouse gas emissions.\"'",
      "question_order": 29,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 32,
      "section_id": 6,
      "question_type": "translation",
      "question_number": 56,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "翻译题目，需要学生将中文段落准确翻译成英文，注意语法、词汇和句式结构的正确性",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 30,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    }
  ]
}