{
  "exam_papers": [
    {
      "id": 2,
      "exam_type": "CET-6",
      "year": 2022,
      "month": 9,
      "paper_number": 1,
      "title": "2022年9月大学英语六级考试真题（一）",
      "description": "2022年9月大学英语六级考试真题（第一套），包含写作、听力、阅读理解和翻译四个部分",
      "total_score": 710,
      "time_allowed": 130,
      "questions_count": 57,
      "sections_count": 8,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_sections": [
    {
      "id": 9,
      "paper_id": 2,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to write an essay that begins with the sentence \"Nowadays more and more students are becoming increasingly aware of the importance of developing digital skills.\" You can make comments, cite examples or use your personal experiences to develop your essay. You should write at least 150 words but no more than 200 words.",
      "passage_content": "",
      "passage_title": "The Importance of Developing Digital Skills",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 10,
      "paper_id": 2,
      "section_type": "listening",
      "section_name": "听力部分 - Section A",
      "section_order": 1,
      "time_allowed": 30,
      "directions": "In this section, you will hear two long conversations. At the end of each conversation, you will hear four questions. Both the conversation and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 8,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 11,
      "paper_id": 2,
      "section_type": "listening",
      "section_name": "听力部分 - Section B",
      "section_order": 2,
      "time_allowed": 30,
      "directions": "In this section, you will hear two passages. At the end of each passage, you will hear three or four questions. Both the passage and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 7,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 12,
      "paper_id": 2,
      "section_type": "listening",
      "section_name": "听力部分 - Section C",
      "section_order": 3,
      "time_allowed": 30,
      "directions": "In this section, you will hear three recordings of lectures or talks followed by three or four questions. The recordings will be played only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 13,
      "paper_id": 2,
      "section_type": "reading",
      "section_name": "阅读理解 - Section A",
      "section_order": 4,
      "time_allowed": 40,
      "directions": "In this section, there is a passage with ten blanks. You are required to select one word for each blank from a list of choices given in a word bank following the passage. Read the passage through carefully before making your choices. Each choice in the bank is identified by a letter. Please mark the corresponding letter for each item on Answer Sheet 2 with a single line through the centre. You may not use any of the words in the bank more than once.",
      "passage_content": "The now extinct passenger pigeon has the dubious honor of being the last species anyone ever expected to disappear. At one point, there were more passenger pigeons than any other species of bird. Rough ______ of their population went as high as five billion and they accounted for around 40 percent of the total indigenous bird population of North America in the early 19th century.\n\nDespite their huge population, passenger pigeons were ______ to human intrusion into their nesting territory. Their nests were shabby things and two weeks after the eggs ______, the parent pigeons would abandon their offspring, leaving them to take care of themselves. People discovered that these baby pigeons were really tasty, and the adult birds were also quite ______. First the Native Americans and then the transplanted Europeans came to consider the birds a great ______.\n\nBy the 1850s, commercial trapping of passenger pigeons was proceeding at an ______ pace. Hundreds of thousands of the birds were being harvested every day to be made into popular pigeon pies. In addition, large ______ of the pigeons' nesting territory were being cleared away for planting crops and creating pasture land. As numerous as the passenger pigeons were, they were not an ______ resource. By the 1880s, it was noticed that the bird population had become seriously ______. The last passenger pigeons killed in the wild were shot in 1899.\n\nEventually those billions and billions of birds shrank to a single remaining ______, a passenger pigeon named Martha, who died on September 1, 1914, in captivity at the Cincinnati Zoo. In addition to being the end of an era, it was also the first time humans were able to exactly time the extinction of a species.",
      "passage_title": "Passenger Pigeon Extinction",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 14,
      "paper_id": 2,
      "section_type": "reading",
      "section_name": "阅读理解 - Section B",
      "section_order": 5,
      "time_allowed": 40,
      "directions": "In this section, you are going to read a passage with ten statements attached to it. Each statement contains information given in one of the paragraphs. Identify the paragraph from which the information is derived. You may choose a paragraph more than once. Each paragraph is marked with a letter. Answer the questions by marking the corresponding letter on Answer Sheet 2.",
      "passage_content": "A. As computer coding has become an increasingly sought-after skill, more K-12 schools are working it into their curriculums. Some states have considered allowing students to forgo (放弃) foreign language for coding classes, despite opposition from educators.\n\nB. There's a debate over whether it's appropriate to teach coding in elementary schools, with fierce opinions on each side. When it comes to allowing coding to fill foreign language requirements, though, most educators agree: Coding should be added to curriculums, but not at the expense of foreign language classes.\n\nC. The idea is that computer programming is a language, allowing people to communicate with machines and programs. It's the language of the 21st century and more valuable than a natural language, some advocates argue. The computer science field is growing faster than schools can keep up because of budget constraints and a lack of skills training for teachers.\n\nD. According to the 2016 U.S. News/Raytheon STEM Index, computer science jobs have helped boost wages in the U.S., and computer-related jobs hold the top seven positions in STEM fields for highest number of workers. Foreign language interest, on the other hand, is declining for the first time since 1995. The number of higher education language enrollments declined between 2009 and 2013 by more than 111,000 spots, according to the Modern Language Association of America.\n\nE. \"I think the opportunity to give people a choice is important,\" says Florida state Senator Jeremy Ring, who introduced a bill last year that would allow Florida students to choose between foreign language and coding classes for the purpose of university admissions requirements. \"I think if you're going to give two years of language in high school, you might as well do computer coding.\"\n\nF. The Florida bill died this year after passing 35:5 in the state Senate when the full Legislature failed to take action. It would have been the first state to try this initiative. Ring says that although he will be out of office, an identical bill will be reintroduced within the next year by others on his behalf. \"In the speech I gave on the Senate floor, I said, 'We can be the first state to do this, or we can be the 50th state to do it. It's our choice. It's going to happen,'\" Ring says.\n\nG. A Kentucky bill similar to the one in Florida was met with complaints from educators, and was then amended to promote computer science education initiatives with no mention of foreign language requirements. Instead, the state will provide support for higher quality certified teachers for programming classes. Under the Washington bill, public universities would accept two years of computer science classes in place of two years of foreign language for admission purposes. A report detailing the opinions of state university officials is due to the Legislature by November 2017.\n\nH. Texas passed a bill in 2013 that allows students to substitute computer coding only after they have attempted and performed poorly in a foreign language class. Srini Mandyam, CTO and co-founder of kid-friendly instructional coding company Tynker, believes allowing students to forgo foreign language because they struggle with it is unproductive because every subject, whether art, math or language, is a significant contribution to a well-rounded existence. \"Many students don't fare well with algebra but we never discuss eliminating it or... say chemistry is now counted as an algebra class,\" he said via email. \"We teach algebra because it's important and we should teach foreign language and coding for the same reason. Exposure to a wide breadth of subjects and material results in well-rounded students who are able to make informed decisions... about what they want to pursue.\"\n\nI. Computer science courses already fulfill a math or science high school graduation requirement in 28 states and the District of Columbia, up from only 12 states in 2013. And while advocates of the bills say they should count as foreign language instead, opponents stress the importance of balancing computer and foreign language skills.\n\nJ. Studies show that bilingualism (双语) correlates with cognitive development, intelligence, memory and problem solving abilities, according to the American Council on the Teaching of Foreign Languages. A 2007 study showed that foreign language students outperformed their non-foreign language peers on standardized tests after only two to three years of study. And while a 2014 report from German and American universities suggests that programmers are using language (but not mathematical) regions of the brain when understanding code, critics remain wary. They say that regardless of cognitive functions, being monolingual is a disadvantage in the increasingly international economy, even if English has become the de facto (事实上的) language of business.\n\nK. \"Our world is shrinking but its problems are really growing,\" says ACTFL National Language Teacher of the Year Ted Zarrow, who teaches high school Latin in Westwood, Massachusetts, and has also studied Spanish, French, German, Italian and Greek. \"We need to find a way to put ourselves at the global table and to treat each other with mutual respect. And learning languages allows us to do that because language is not part of culture, language is culture.\"\n\nL. Even with the benefits and skill sets languages provide, recruiters and employers value computer skills more. According to the National Association of Colleges and Employers' 2016 report, study abroad and foreign language fluency were not very influential in the employee hiring processes, but 55 percent of employers looked for computer skills on applicants' resumes. However, although 2016 computer science graduates can expect to make the second highest starting salary compared with other jobs this year, the Bureau of Labor predicts the demand for computer programmers will decrease 8 percent or by 26,500 jobs by 2024.\n\nM. Ring says foreign language skills are important, but expresses doubt that school districts could work both coding and language into their curriculum in a significant way because they lack the time in the school day. \"Nothing against language,\" he says. \"I just think it's something you have to start early and not just have something that you do for a couple of years in high school,\" he says.\n\nN. Zarrow agrees that foreign language education should begin earlier, but says it is possible to work both computer programming and foreign language learning into schools evenly. He suggests an immersive, dual language program where students spend half the day in English and half the day in another language, as several schools around the country have successfully implemented. \"The study of language fosters a respect for diversity, a respect for ethnicity and really a respect for language,\" Zarrow says.\n\nO. Though the benefits of computer programming skills are vast, foreign language and coding experts agree that computer science should be negotiated into curriculums rather than replacing foreign language outright. Mandyam says the two skill sets are essential but unrelated. \"Coding is an incredibly important 21st century skill for our kids to learn, and that's why we spend so much time trying to teach it,\" Mandyam says via email. \"But I believe it is the same as or even really comparable to learning a foreign language. It would be a shame to lose something so important for the sake of adding something else, even something as important as coding. Clearly, education leaders must figure out a way to teach both.\"",
      "passage_title": "Is computer coding a foreign language?",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 15,
      "paper_id": 2,
      "section_type": "reading",
      "section_name": "阅读理解 - Section C",
      "section_order": 6,
      "time_allowed": 40,
      "directions": "There are 2 passages in this section. Each passage is followed by some questions or unfinished statements. For each of them there are four choices marked A), B), C) and D). You should decide on the best choice and mark the corresponding letter on Answer Sheet 2 with a single line through the centre.",
      "passage_content": "Passage One\n\nThe U.S. and China don't agree on much these days. Germany and France share a border and a currency but are frequently at odds. The U.K. and India like to march to their own drum. But there's one issue on which all these countries see eye to eye: Technology companies are too big, too powerful, and too profitable. And that power is only likely to intensify, leaving governments with no choice but to confront it head-on by taking the companies to court, passing new competition laws, and perhaps even breaking up the tech giants.\n\nChina is the latest to implement an anti-trust crackdown, unveiling anti-monopoly rules last month. The draft rules followed the surprise suspension of a $37 billion stock offering by billionaire Jack Ma's Ant Group Co., making clear that no company can evade the government's regulation. The moves in China coincide with accelerating efforts in the U.S. and Europe to rein in Amazon.com, Apple, Facebook, and Google.\n\n\"The big get bigger and bigger but without being better,\" says Andreas Schwab, a German member of the European Parliament who championed a 2014 resolution to break up Google. \"Growing economic power, growing influence on local markets all over the world, and a growing concern of competitors and consumers altogether have made it happen now.\"\n\nIn this new anti-trust era, the old focus on pricing power no longer applies, because several of the biggest tech companies have established trillion-dollar monopolies by charging consumers next to nothing. Tech giants are increasingly assuming powerful positions in banking, finance, advertising, retail, and other markets that force smaller businesses to rely on their platforms to reach customers.\n\nFor years, Europe alone confronted the power of digital giants. Governments were alarmed that European companies were failing to match Silicon Valley's innovations or to stop Google and Facebook from vacuuming up personal data and, with that, advertising revenue. Led by Margrethe Vestager, the European Union's competition chief, countries have sought to police the market and encourage fair play.\n\nIn China the crackdown has been driven at least partly by fear that the homegrown tech industry is becoming too powerful. The country has long championed Alibaba and Tencent, but their massive accumulation of data on the Chinese citizenry is a growing concern for Beijing.\n\nIn the U.S., a new breed of anti-trust experts argues that consideration should be given to privacy, control over data, workers' rights, and the overall impact on smaller companies. And the public in general have grown increasingly skeptical of social media companies. More than 60% say the sector has a negative effect on the country, and almost half want more regulation for social media, according to a 2020 Pew Research Center study.\n\nPassage Two\n\nBorn from the accessibility of mass air travel, modern international tourism has been popularized as \"holiday-making\" in regions that offer comparative advantages of sand, sun and sea. Travel is often portrayed as a tool for personal growth and tourism as an economic motor for destination countries and cities. There is a tendency to assume that tourism is good for everyone involved.\n\nToday the big bang of tourism drives over 1.2 billion tourists across international borders annually. Many popular places are literally being loved to death. Recent protests in ports of call like Venice and Barcelona against disturbances created by cruise ships show the unfortunate consequences of emphasizing quantity over quality in tourism.\n\nUncontrolled tourism development has become a primary driver of social and environmental disruption. Tourism studies provide much documentation of the many negative social impacts of tourism and resulting resentment that local populations direct toward visitors.\n\nAntagonism toward tourists typically develops in mature, heavily visited destinations. Protests in heavily visited destinations suggest that traditional tourism has overstayed its welcome.\n\nResidents often become frustrated when the benefits of tourism are not felt locally. Although it can generate foreign exchange, income and employment, there's no guarantee that multinational hotel chains will allocate these benefits equitably among local communities.\n\nOn the contrary, when people stay at large resorts or on cruise ships, they make most of their purchases there, leaving local communities little opportunity to benefit from tourist spending. These forms of tourism widen economic and political gaps between haves and have-nots at local destinations.\n\nIn recent decades, local residents in destination communities also have found themselves negotiating new cultural boundaries, class dynamics, service industry roles and lifestyle transformations. For example, data show that tourism activity corresponds to increased social problems as local residents adopt the behaviors of tourists.\n\nWhat does all this mean for the everyday traveler? First, all tourists should make every effort to honor their hosts and respect local conditions. This means being prepared to adapt to local customs and norms, rather than expecting local conditions to adapt to travelers. Second, tourism is a market-based activity and works best when consumers reward better performers. In the information age, there's little excuse for travelers being uninformed about where their vacation money goes and who it enriches. Informed travelers also are better able to distinguish between multinational companies and local entrepreneurs whose businesses provide direct social, environmental, and economic benefits for local residents. Such businesses are in love with the destination and are therefore deserving of market reward. In the long run, being a responsible traveler means ensuring net positive impacts for local people and environments. With the information available at our fingertips, there has never been more opportunity to do so.",
      "passage_title": "",
      "passage_type": "reading",
      "has_multiple_passages": 1,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 16,
      "paper_id": 2,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 7,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "贴春联(Spring Festival couplets)是中国人欢度春节的一个重要习俗。春联由一对诗句和四字横批(horizontal scroll)组成，诗句和横批用金色或黑色写在红纸上，红色代表幸运，金色代表财富。春联贴在大门左右两侧和门框上方。春联的诗句体现中国传统诗词的特点，两句诗的字数相同，内容相关。横批凸显春联的主题，更是锦上添花。春联以简洁的文字描绘生动的形象，抒发美好的愿望。当家家户户贴春联时，人们就会意识到春节已经正式拉开序幕。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_questions": [
    {
      "id": 58,
      "section_id": 9,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write an essay that begins with the sentence \"Nowadays more and more students are becoming increasingly aware of the importance of developing digital skills.\"",
      "options": "[]",
      "correct_answer": "",
      "analysis": "写作题目，需要学生以\"如今越来越多的学生日益意识到培养数字技能的重要性\"为开头写一篇议论文",
      "explanation": "考查学生的议论文写作能力，包括论点阐述、论证支持和结论总结",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 59,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 1,
      "question_text": "What does the man say about the weekly program?",
      "options": "[\"A) It enables people to earn more money.\", \"B) It teaches the importance of financing.\", \"C) It helps people with budgeting.\", \"D) It introduces a novel way to invest.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。男士介绍说，《金钱很重要》是每周一期的节目，旨在帮助人们管理好自己的财务事宜。而本期节目中，他将与嘉宾一起讨论预算问题。因此，该节目是可以帮助人们编制预算的。",
      "explanation": "对话开头：'Welcome to Money Matters, a weekly program that helps you manage your money. Tonight, I'll be talking to Mary Johnson about budgeting.'",
      "question_order": 0,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 60,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 2,
      "question_text": "What did the man read recently?",
      "options": "[\"A) Many Americans are not satisfied with their income.\", \"B) Many Americans have no idea about how to invest.\", \"C) Most Americans do not know how to save money.\", \"D) Most Americans do not stick to a budget.\"]",
      "correct_answer": "D",
      "analysis": "细节理解题。男士说他最近看到只有41%的美国人能够坚定地执行预算。也就是说，大部分美国人不能坚定地执行预算。",
      "explanation": "对话中提到：'I read recently that only 41% of Americans adhere to a budget.'",
      "question_order": 1,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 61,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 3,
      "question_text": "What does the woman suggest the man do first to avoid getting into debt?",
      "options": "[\"A) Keep track of his money.\", \"B) Live within his means.\", \"C) Find more sources of income.\", \"D) Refrain from buying luxuries.\"]",
      "correct_answer": "A",
      "analysis": "细节理解题。当男士问女士采取什么措施才能防止钱财消失时，女士回答说，这其实就是一个对金钱进行追踪的问题。当男士说追踪钱财不容易时，女士说了解自己的收入和支出一开始就可以确保你不会负债。也就是说，女士建议男士第一步就应该对钱财进行追踪。",
      "explanation": "对话中提到：'Well, it's all about keeping track of your money. If you don't do that, you'll never be able to set any goals for your budget or have the discipline to stick to them.'",
      "question_order": 2,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 62,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 4,
      "question_text": "What does the woman say about online shopping?",
      "options": "[\"A) It offers a greater variety of items.\", \"B) It helps avoid unnecessary spending.\", \"C) It changes one's way of living.\", \"D) It saves one's time for shopping.\"]",
      "correct_answer": "B",
      "analysis": "细节推断题。女士得知男士入不敷出的情况后认为他需要做出一些改变，其中就提到了男士可以在网上购物。网上购物可以让人们避开某些像巧克力这样的不必要的诱惑。也就是说，女士认为网上购物能够帮助人们避免很多不必要的支出。",
      "explanation": "对话中提到：'shop online to avoid unnecessary temptations like chocolate.'",
      "question_order": 3,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 63,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 5,
      "question_text": "What does the woman say about the flat?",
      "options": "[\"A) It is brand-new.\", \"B) It has plenty of rooms.\", \"C) It belongs to her mother.\", \"D) It has been vacant for months.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。女士明确告诉男士，这套公寓属于她母亲。",
      "explanation": "对话中提到：'The place actually belongs to my mother.'",
      "question_order": 4,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 64,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 6,
      "question_text": "What is the man's chief consideration in looking for a flat?",
      "options": "[\"A) Space.\", \"B) Tranquillity.\", \"C) Appliances.\", \"D) Location.\"]",
      "correct_answer": "B",
      "analysis": "细节归纳题。噪音和邻居的情况对男士来说是最大的问题。女士提到如果男士想要安静，这个房子就很完美。男士表示这是一个好消息。综合来看，在男士的房标准中，安静是放在第一位的。",
      "explanation": "对话中提到：'Now the big question, what about noise and the neighbours?' 'So it's perfect if tranquility is what you are looking for.' 'That's good news.'",
      "question_order": 5,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 65,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 7,
      "question_text": "What does the man have to do on signing the contract?",
      "options": "[\"A) Talk to his wife about the contract terms.\", \"B) Pay the first month's rent and a deposit.\", \"C) Check the references of the flat owner.\", \"D) Consult his solicitor one more time.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。女士告诉男士，签合同时必须支付第一个月的租金和押金。",
      "explanation": "对话中提到：'The first month's rent and a deposit are mandatory on signing the contract.'",
      "question_order": 6,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 66,
      "section_id": 10,
      "question_type": "single_choice",
      "question_number": 8,
      "question_text": "Why does the man say his wife will feel very excited if they move into the flat?",
      "options": "[\"A) She can have a wonderful view of the pond.\", \"B) She will be much closer to her work place.\", \"C) She can make friends with new neighbours.\", \"D) She will have plenty of space for her shoes.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。男士提到，如果妻子知道他们能够从现在住的破地方搬出来，还能把鞋都放到柜子里，她会很兴奋的。",
      "explanation": "对话中提到：'My wife will be thrilled to get out of the shabby place we are now in and start filling those wardrobes with all those shoes.'",
      "question_order": 7,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 67,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 9,
      "question_text": "What has the new study found about children watching television?",
      "options": "[\"A) The more commercials they see, the more brands they get to know.\", \"B) The more commercials they see, the more they adore celebrities.\", \"C) The more television they watch, the fewer conflicts in the family.\", \"D) The more television they watch, the greater their parents' stress.\"]",
      "correct_answer": "D",
      "analysis": "细节理解题。一项新研究发现，孩子看电视的时间与父母的压力水平之间存在正向关联。所谓正向关联，就是孩子看电视的时间越长，父母的压力越大。",
      "explanation": "短文中提到：'A new study has found a positive correlation between how much television children watch and their parents' stress levels.'",
      "question_order": 8,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 68,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 10,
      "question_text": "What are parents advised to do to reduce the impact of TV commercials?",
      "options": "[\"A) Inform children of the family's financial situation.\", \"B) Shift children's attention to interesting activities.\", \"C) Involve children in making purchasing decisions.\", \"D) Help children understand advertising's intent.\"]",
      "correct_answer": "C",
      "analysis": "细节理解题。研究人员建议父母在做家庭购买决策时去寻求孩子的意见。也就是说，建议父母们在做购买决策时能让孩子参与进来。",
      "explanation": "短文中提到：'The researchers suggest that parents seek input from their children on family purchasing decisions.'",
      "question_order": 9,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 69,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 11,
      "question_text": "What makes children particularly vulnerable to TV commercials?",
      "options": "[\"A) Their limited cognitive ability.\", \"B) Their strong natural curiosity.\", \"C) Their admiration for celebrities.\", \"D) Their lack of social experience.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。儿童没有充分理解广告意图的认知能力，这让他们特别容易受到广告的影响。",
      "explanation": "短文中提到：'Plus, children don't have the cognitive ability to fully understand advertising's intent. That makes them particularly vulnerable to advertisements.'",
      "question_order": 10,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 70,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 12,
      "question_text": "What baffling phenomenon is discussed in the passage?",
      "options": "[\"A) Bad guys may do good deeds.\", \"B) Bad guys may go unpunished.\", \"C) Good guys may not always cooperate.\", \"D) Good guys may get unfair treatment.\"]",
      "correct_answer": "D",
      "analysis": "细节理解题。有时候，好人也会被惩罚或被批评，而原因却是他们太好了。这看起来令人费解，因为这不利于团队合作。也就是说，好人可能会受到不公平的对待，这让人费解。",
      "explanation": "短文中提到：'But sometimes the good guys also get punished or criticized, specifically because they are so good.'",
      "question_order": 11,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 71,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 13,
      "question_text": "How are we all judged according to the passage?",
      "options": "[\"A) By what we do.\", \"B) By fair evaluation.\", \"C) In comparison with others.\", \"D) In accordance with set standards.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。我们都是通过与他人的比较来被评判的。",
      "explanation": "短文中提到：'we're all judged in comparison with others.'",
      "question_order": 12,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 72,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 14,
      "question_text": "What can a normal person do when faced with people who perform better?",
      "options": "[\"A) Learn from them earnestly.\", \"B) Compete with them actively.\", \"C) Leave them alone temporarily.\", \"D) Cooperate with them sincerely.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。当面对更好的人时，一个正常人能做什么？一种选择是积极竞争。",
      "explanation": "短文中提到：'One option is to actively compete.'",
      "question_order": 13,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 73,
      "section_id": 11,
      "question_type": "single_choice",
      "question_number": 15,
      "question_text": "What may discourage people from performing good deeds?",
      "options": "[\"A) Being dismissed as hypocritical.\", \"B) Not getting the reward they deserve.\", \"C) Having to make too many sacrifices.\", \"D) Being misunderstood by people around.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。做好事却会被不做好事的人视为幼稚或虚伪，而这样的指责最终会打消人们做好事的念头。",
      "explanation": "短文中提到：'Such good deeds are dismissed as naive or hypocritical by those who do not perform those deeds. This criticism may ultimately discourage people from doing good deeds.'",
      "question_order": 14,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 74,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 16,
      "question_text": "What does the speaker say about most preteen children?",
      "options": "[\"A) They are increasingly aware of gender differences.\", \"B) They engage themselves in positive recollection.\", \"C) They begin to see the importance of friendship.\", \"D) They make friends with peers of the same sex.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。大多数十一二岁的孩子都有一个好朋友，这个好朋友通常与他们同性别且年龄相仿。也就是说，这个年龄段的孩子愿意与同性别的同龄人交朋友。",
      "explanation": "讲座中提到：'Most preteen children have a best friend who is usually someone of the same sex and similar age.'",
      "question_order": 15,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 75,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 17,
      "question_text": "What do most males devote much of their energy to during adolescence?",
      "options": "[\"A) Competing for position.\", \"B) Pursuing fashion.\", \"C) Forging close ties with friends.\", \"D) Fulfilling family obligations.\"]",
      "correct_answer": "A",
      "analysis": "细节理解题。到了青春期，虽然男性仍与同性别的朋友十分亲密，但他们已经把相当多的精力投入到争夺职位的竞争中。",
      "explanation": "讲座中提到：'considerable energy is devoted to competing for position and a definite undercurrent of competition permeates the relationship.'",
      "question_order": 16,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 76,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 18,
      "question_text": "What do children do when they reach late adolescence?",
      "options": "[\"A) They prioritize romance over friendship.\", \"B) They try to strengthen same-sex friendships.\", \"C) They begin to take friendship more seriously.\", \"D) They compete intensely for romantic partners.\"]",
      "correct_answer": "A",
      "analysis": "细节理解题。到青春期后期，对于女孩子们来说，与男孩的关系比姐妹关系更为重要，而对于男孩子们来说，浪漫的约会也降低了同性友谊的强度。也就是说，对于青春期后期的孩子们来说，爱情的地位是高于友谊的。",
      "explanation": "讲座中提到：'This is most apt to be the case in late adolescence when dating and relationships with boys take sharper precedence over sisterhood.'",
      "question_order": 17,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 77,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 19,
      "question_text": "Why do disabled job applicants feel reluctant to disclose their disability information?",
      "options": "[\"A) They regard it as a matter of sheer privacy.\", \"B) They are worried about being turned down.\", \"C) They fear that their condition will be made widely known.\", \"D) They are afraid to be discriminated against once recruited.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。许多求职者担心，他们会因为披露了这些个人信息而被排除在某个职位之外。也就是说，这些人之所以不愿意暴露自己身有残疾的事实，是因为害怕被直接拒绝，不再有应聘的机会。",
      "explanation": "讲座中提到：'many candidates fear they wouldn't be considered for a position as a result of disclosing this personal information.'",
      "question_order": 18,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 78,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 20,
      "question_text": "When does the speaker suggest applicants reveal their disability information?",
      "options": "[\"A) After receiving a job offer.\", \"B) During a job interview.\", \"C) When confirming an interview.\", \"D) Upon completing a cover letter.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。给出回复进行面试确认的时候来讨论残疾问题是最合适的。",
      "explanation": "讲座中提到：'It's most appropriate to discuss a disability when they reply to confirm an interview.'",
      "question_order": 19,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 79,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 21,
      "question_text": "What are people advised to do when filling out their job application form?",
      "options": "[\"A) Describe the true state of their health.\", \"B) Provide all the information required.\", \"C) Stress the irrelevance of their disability to the job.\", \"D) Avoid mentioning the name of their disability.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。公司有时会为求职者提供在申请表上披露残疾信息的机会，但人们不应受到这种方法或时间的限制。人们应该避免分享他们所患残疾的名称或状态。",
      "explanation": "讲座中提到：'People should avoid sharing the name of their disability or condition.'",
      "question_order": 20,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 80,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 22,
      "question_text": "What does the passage say about students' comprehension?",
      "options": "[\"A) Their scores were least affected by music with speech.\", \"B) It was the poorest when there was background speech.\", \"C) Their scores were most depressed with instrumental music.\", \"D) It was disrupted by the sound of an air conditioner or fan.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。在有背景语音的情况下，学生的分数下降得最多。",
      "explanation": "讲座中提到：'Students' scores were most depressed in the presence of background speech.'",
      "question_order": 21,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 81,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 23,
      "question_text": "What does the degree of interference from background noise depend on?",
      "options": "[\"A) It has to do with the type and volume of the background noise.\", \"B) It has to do with short-term memory for listening comprehension.\", \"C) It depends on the overlap in processing different kinds of information.\", \"D) It depends on the participants' ability to concentrate on the task at hand.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。背景噪音的干扰程度似乎取决于任务所需的处理过程与筛选背景噪音所需的处理过程之间的重叠程度。",
      "explanation": "讲座中提到：'It seems the degree of interference from background noise depends on the overlap between the processing required on the task and the processing required to screen out the background noise.'",
      "question_order": 22,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 82,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 24,
      "question_text": "What does the speaker suggest students do when writing essays?",
      "options": "[\"A) Keep everything as quiet as possible.\", \"B) Play nothing but instrumental music.\", \"C) Use vocal material as little as possible.\", \"D) Wear a pair of earphones or headphones.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。然而，当学生写论文时，其他研究发现最好尽可能减少所有背景噪音。",
      "explanation": "讲座中提到：'When students write essays, however, other research has found it is best to reduce all background noise as much as possible.'",
      "question_order": 23,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 83,
      "section_id": 12,
      "question_type": "single_choice",
      "question_number": 25,
      "question_text": "What did the study find about different personality types?",
      "options": "[\"A) Sociable people were immune to all distractions.\", \"B) Shy quiet people were most adversely impacted.\", \"C) Less outgoing people were more affected by silence.\", \"D) Confident people were unaffected by high-arousal music.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。研究人员让害羞安静的人和自信外向的人听高唤醒或低唤醒的背景音乐、一般噪音或保持安静，同时要求他们记住单词。害羞安静的人在听高唤醒音乐时表现最差。",
      "explanation": "讲座中提到：'The researchers subjected shy quiet people and confident outgoing ones to higher arousal or lower arousal background music... Shy quiet people performed worst when listening to high-arousal music.'",
      "question_order": 24,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 84,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 26,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "L",
      "analysis": "名词辨析题。空格前面是形容词Rough，空格后面是介词of，因此空格处应填入一个名词。空格所在部分意思是：据粗略______，在19世纪早期，北美旅鸽的数量高达50亿只。L) estimates\"估计\"符合语法及语境，故为答案。",
      "explanation": "estimates表示估计，这里指对旅鸽数量的粗略估计。",
      "question_order": 25,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 85,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 27,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "A",
      "analysis": "形容词辨析题。空格前有系动词were，可知空格处应填一个形容词作表语。空格所在部分意思是：尽管旅鸽的数量庞大，但它们______人类入侵其筑巢领地。A) vulnerable\"易受伤害的，脆弱的\"符合语境，故为答案。",
      "explanation": "vulnerable表示脆弱的、易受伤害的，这里指旅鸽容易受到人类入侵的影响。",
      "question_order": 26,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 86,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 28,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "I",
      "analysis": "动词辨析题。空格位于two weeks after the eggs ______这一部分为该分句的时间状语从句，该状语从句的主语为名词eggs，因此空格处需填入一个动词作谓语。此句意思是\"蛋孵化两周后，鸽子的父母就会抛弃它们的孩子\"。I) hatched\"孵化\"符合语法及语境，故为答案。",
      "explanation": "hatched表示孵化，这里指蛋孵化两周后。",
      "question_order": 27,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 87,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 29,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "M",
      "analysis": "形容词辨析题。空格前有系动词were和副词quite，可知空格处应填一个形容词作表语。空格所在句是当前面的部分提到these baby pigeons were really tasty（这些乳鸽非常美味），可知空格所在处是指\"成年鸽子也很好吃\"。备选项中的形容词edible表示\"可食用的\"，符合语境，故答案为M。",
      "explanation": "edible表示可食用的，这里指成年鸽子也很好吃。",
      "question_order": 28,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 88,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 30,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "O",
      "analysis": "名词辨析题。空格前面是不定冠词a和形容词great，因此空格处应填入一个名词。空格所在句的上一句提到乳鸽和成年鸽子好吃，可判断空格所在句是说美洲原住民和移居的欧洲人认为这种鸟是一种美味。O) delicacy\"珍馐，佳肴\"符合语境，故为答案。",
      "explanation": "delicacy表示美味佳肴，这里指旅鸽被视为一种美食。",
      "question_order": 29,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 89,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 31,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "B",
      "analysis": "形容词辨析题。空格前是不定冠词an，空格后面是名词pace，可知空格处应填一个形容词或名词作定语。空格所在句提到commercial trapping of passenger pigeons（商业捕获旅鸽），接下来的句又提到hundreds of thousands of the birds were being harvested every day（每天都有数十万只旅鸽被捕获），可判断此处是指商业捕获旅鸽的速度非常快。备选项中的形容词unprecedented表示\"前所未有的\"，用在此处符合语境，故答案为B。",
      "explanation": "unprecedented表示前所未有的，这里指商业捕获旅鸽的速度达到了前所未有的水平。",
      "question_order": 30,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 90,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 32,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "C",
      "analysis": "名词辨析题。空格前面是形容词large，空格后面是介词of，因此空格处应填入一个名词。由of后面的the pigeons' nesting territory（鸽子筑巢的领地）可知，空格处的词意思应与土地面积相关。C) tracts\"（土地的一大片\"符合语境，故为答案。",
      "explanation": "tracts表示大片土地，这里指鸽子筑巢的大片领地被清理。",
      "question_order": 31,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 91,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 33,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "H",
      "analysis": "形容词辨析题。空格前是不定冠词an，空格后面是名词resource，可知空格处应填一个形容词。空格所在句前半部分是一个让步状语从句，意为\"尽管旅鸽数量众多\"，空格所在句语义进行转折，结合句中出现的not一词可知，空格处所在词意思应与前面的numerous\"很多的\"一词语义一致。备选项中的形容词infinite表示\"无限的，无穷尽的\"，符合语境，故答案为H。",
      "explanation": "infinite表示无限的，这里指旅鸽并不是无穷无尽的资源。",
      "question_order": 32,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 92,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 34,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "N",
      "analysis": "形容词辨析题。空格所在句中it为形式主语，真正的主语为that引导的主语从句，该主语从句是个主系表结构，表语部分不完整。空格前是副词seriously，可知空格处应填一个形容词作表语。根据上下文可知，此处意思是\"到19世纪80年代，人们注意到这一鸟类的数量已经严重减少\"。备选项中的depleted用作动词意为\"消减，损耗\"，其过去分词也可用作形容词，意为\"减少的\"，符合语境，故答案为N。",
      "explanation": "depleted表示减少的、耗尽的，这里指旅鸽数量严重减少。",
      "question_order": 33,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 93,
      "section_id": 13,
      "question_type": "blank_filling",
      "question_number": 35,
      "question_text": "",
      "options": "[\"A) vulnerable\", \"B) unprecedented\", \"C) tracts\", \"D) specimen\", \"E) robust\", \"F) refuge\", \"G) literally\", \"H) infinite\", \"I) hatched\", \"J) expired\", \"K) species\", \"L) estimates\", \"M) edible\", \"N) depleted\", \"O) delicacy\"]",
      "correct_answer": "D",
      "analysis": "名词辨析题。空格前面是形容词remaining，因此空格处应填入一个名词。根据上下文意思可知，空格所在部分意思是\"这数十亿只旅鸽缩减为唯一的______\"。D) specimen\"标本，样品\"符合语境，故为答案。",
      "explanation": "specimen表示标本，这里指旅鸽只剩下最后一个标本。",
      "question_order": 34,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 94,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 36,
      "question_text": "Employers attach more importance to applicants' computer skills than their language competence.",
      "options": "[]",
      "correct_answer": "L",
      "analysis": "同义转述题。L段第一句指出，尽管语言带来了益处和一系列技能，但招聘人员和雇主更看重计算机技能。由此可知，相比语言能力，雇主更重视计算机技能，题干是对定位句的同义转述。题干中的attach more importance to applicants' computer skills对应原文中的value computer skills more，故答案为L。",
      "explanation": "L段第一句：'Even with the benefits and skill sets languages provide, recruiters and employers value computer skills more.'",
      "question_order": 35,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 95,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 37,
      "question_text": "One U.S. state senator proposed that high school students be allowed to study either foreign language or computer coding.",
      "options": "[]",
      "correct_answer": "E",
      "analysis": "同义转述题。E段第一句提到了佛罗里达州参议员杰里米·林，随后指出他去年提出的一项法案允许佛罗里达州的学生在外语和编码课程之间做出选择，以满足大学入学要求。题干中的study either foreign language or computer coding是对原文中的choose between foreign language and coding classes的同义转述，故答案为E。",
      "explanation": "E段第一句：'\"I think the opportunity to give people a choice is important,\" says Florida state Senator Jeremy Ring, who introduced a bill last year that would allow Florida students to choose between foreign language and coding classes for the purpose of university admissions requirements.'",
      "question_order": 36,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 96,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 38,
      "question_text": "Learning languages broadens students' international perspective and nurtures mutual respect among peoples, according to a high school language teacher.",
      "options": "[]",
      "correct_answer": "K",
      "analysis": "细节归纳题。K段第一句提到一位高中语言教师，而随后的两句话，我们需要找到一种方法，让自己立足于全球舞台并相互尊重，而学习语言能够让我们做到这一点。可知题干对这两处信息进行了归纳。题干中的broadens students' international perspective对应原文中的put ourselves at the global table，而mutual respect among peoples是对原文中treat each other with mutual respect的同义转述，故答案为K。",
      "explanation": "K段：'\"Our world is shrinking but its problems are really growing,\" says ACTFL National Language Teacher of the Year Ted Zarrow... \"We need to find a way to put ourselves at the global table and to treat each other with mutual respect. And learning languages allows us to do that because language is not part of culture, language is culture.\"'",
      "question_order": 37,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 97,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 39,
      "question_text": "One U.S. state will see to it that programming classes are taught by quality teachers.",
      "options": "[]",
      "correct_answer": "G",
      "analysis": "同义转述题。G段开头提到肯塔基州有关计算机编程教育的法案，其中第二句话，该州将为编程课程的高质量认证教师提供支持。题干中see to it对应原文中的provide support for，题干中的quality teachers对应原文中的higher quality certified teachers，故答案为G。",
      "explanation": "G段第二句：'Instead, the state will provide support for higher quality certified teachers for programming classes.'",
      "question_order": 38,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 98,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 40,
      "question_text": "Statistics show while computer-related jobs have been on the rise, foreign languages have become less appealing to American students since mid-1990s.",
      "options": "[]",
      "correct_answer": "D",
      "analysis": "细节归纳题。D段定位句提到，根据2016年美国新闻/雷神公司STEM指数，计算机相关工作在STEM领域内占据前七位，从业人员数量最多。另一方面，对于外语的兴趣自1995年以来首次下降。由此可知，题干是对该处信息的归纳。题干中的have been on the rise对应原文中的hold the top seven positions in STEM fields for highest number of workers，题干中的foreign languages have become less appealing是原文中\"Foreign language interest...is declining\"的同义表达，故答案为D。",
      "explanation": "D段前两句：'According to the 2016 U.S. News/Raytheon STEM Index, computer science jobs have helped boost wages in the U.S., and computer-related jobs hold the top seven positions in STEM fields for highest number of workers. Foreign language interest, on the other hand, is declining for the first time since 1995.'",
      "question_order": 39,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 99,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 41,
      "question_text": "All school subjects are said to be essential to students' well-rounded development.",
      "options": "[]",
      "correct_answer": "H",
      "analysis": "同义转述题。H段定位部分提到，每门学科，无论是艺术、数学还是语言，都对全面发展有着重要贡献。题干是对该部分的同义转述。题干中的essential是原文中a significant contribution的同义表达，题干中的well-rounded development则对应原文中的a well-rounded existence，故答案为H。",
      "explanation": "H段第二句后半部分：'because every subject, whether art, math or language, is a significant contribution to a well-rounded existence.'",
      "question_order": 40,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 100,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 42,
      "question_text": "There is consensus among most educators that coding should be taught in schools but should not replace foreign language.",
      "options": "[]",
      "correct_answer": "B",
      "analysis": "同义转述题。B段定位句指出，大多数教育者的意见都是一致的：编码应该被添加到课程中，但不能以牺牲外语课程为代价。题干是对该句的同义转述。题干中的consensus对应原文中的agree，题干中的coding should be taught in schools是对原文中的coding should be added to curriculums的转述，而replace foreign language则是原文中at the expense of foreign language classes的同义表达，故答案为B。",
      "explanation": "B段第二句：'When it comes to allowing coding to fill foreign language requirements, though, most educators agree: Coding should be added to curriculums, but not at the expense of foreign language classes.'",
      "question_order": 41,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 101,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 43,
      "question_text": "One study showed that foreign language learning improved students' academic performance.",
      "options": "[]",
      "correct_answer": "J",
      "analysis": "细节推断题。J段定位句指出，2007年的一项研究表明，仅需经过两年到三年的外语学习，学生在标准化测试中就有优于非外语同龄人的表现。也就是说，外语学习改善了他们的学习能力，提高了其成绩。题干中的improved students' academic performance对应原文中的outperformed their non-foreign language peers on standardized tests，故答案为J。",
      "explanation": "J段第二句：'A 2007 study showed that foreign language students outperformed their non-foreign language peers on standardized tests after only two to three years of study.'",
      "question_order": 42,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 102,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 44,
      "question_text": "Being short of funding and qualified teachers, schools lag behind the fast developing computer science field.",
      "options": "[]",
      "correct_answer": "C",
      "analysis": "同义转述题。C段第三句提到，由于预算限制和缺乏对教师的技能培训，计算机科学领域的发展速度远不是学校所能跟上的。题干中的short of funding and qualified teachers是对原文中的budget constraints and a lack of skills training for teachers的同义转述，题干中的schools lag behind则对应原文中的is growing faster than schools can keep up，故答案为C。",
      "explanation": "C段第三句：'The computer science field is growing faster than schools can keep up because of budget constraints and a lack of skills training for teachers.'",
      "question_order": 43,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 103,
      "section_id": 14,
      "question_type": "paragraph_matching",
      "question_number": 45,
      "question_text": "A distinguished high school language teacher also believes it is advisable to start learning a foreign language at an earlier age.",
      "options": "[]",
      "correct_answer": "N",
      "analysis": "细节归纳题。N段定位句指出，扎罗赞成外语教育应该更早开始，而根据之前K段中的ACTFL National Language Teacher of the Year和who teaches high school Latin可知，扎罗正是一位杰出的高中语言教师。题干是对文中信息的归纳，其中的a distinguished high school language teacher是指Zarrow，题干中的believes对应原文中的agrees，题干中的it is advisable to start learning a foreign language at an earlier age转述原文中的foreign language education should begin earlier，故答案为N。",
      "explanation": "N段第一句：'Zarrow agrees that foreign language education should begin earlier, but says it is possible to work both computer programming and foreign language learning into schools evenly.'",
      "question_order": 44,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 104,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 46,
      "question_text": "What does the author say is the issue all major economic powers have to address?",
      "options": "[\"A) How to ensure the sustainable growth of their tech giants.\", \"B) How to keep the competitiveness of their tech companies.\", \"C) How to break up the powerful giant tech companies.\", \"D) How to stop tech companies from gaining monopoly.\"]",
      "correct_answer": "D",
      "analysis": "细节推断题。文章首段第四、五句指出，在一个问题上，所有这些国家的看法都是一致的：科技公司规模太大，实力太强大，太有利可图。而且这种力量只能增强，使得政府别无选择，而只能通过将公司告上法庭，通过新的竞争法，其政策分这些科技巨头来进行积极对抗。由此可知，各经济大国必须做的事情是阻止科技公司获得垄断地位，故答案为D。",
      "explanation": "首段第四、五句：'But there's one issue on which all these countries see eye to eye: Technology companies are too big, too powerful, and too profitable. And that power is only likely to intensify, leaving governments with no choice but to confront it head-on by taking the companies to court, passing new competition laws, and perhaps even breaking up the tech giants.'",
      "question_order": 45,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 105,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 47,
      "question_text": "What does the suspension of Ant Group Co.'s stock offering suggest?",
      "options": "[\"A) All attempts to evade regulation are doomed to failure.\", \"B) All attempts to monopolize sales must be cracked down.\", \"C) All companies must be regulated by the government.\", \"D) All companies, domestic or foreign, are created equal.\"]",
      "correct_answer": "C",
      "analysis": "事实细节题。文章第二段第一句提到，在亿万富翁马云的蚂蚁科技集团股份有限公司出人意料地暂停了370亿美元的股票发行之后，国家发布了这些规则草案，明确表示没有一家公司可以逃避政府的监管。由此可知，该事件说明所有公司都必须受政府监管，故答案为C。",
      "explanation": "第二段第二句：'The draft rules followed the surprise suspension of a $37 billion stock offering by billionaire Jack Ma's Ant Group Co., making clear that no company can evade the government's regulation.'",
      "question_order": 46,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 106,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 48,
      "question_text": "How are smaller companies impacted by tech giants' business expansion?",
      "options": "[\"A) They can no longer do business independent of tech giants.\", \"B) They are frequently denied access to tech giants' platforms.\", \"C) They have to change marketing strategies to keep customers.\", \"D) They no longer have the power to price their own products.\"]",
      "correct_answer": "A",
      "analysis": "细节推断题。文章第四段最后一句指出，科技巨头越来越多地在银行、金融、广告、零售和其他市场占据强大的地位，迫使小型企业依靠它们的平台来接触客户。由此可知，这些小公司无法再独立于这些科技巨头来做生意，故答案为A。",
      "explanation": "第四段最后一句：'Tech giants are increasingly assuming powerful positions in banking, finance, advertising, retail, and other markets that force smaller businesses to rely on their platforms to reach customers.'",
      "question_order": 47,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 107,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 49,
      "question_text": "What have EU countries done to confront the power of digital giants?",
      "options": "[\"A) They have imposed strict regulation over digital giants' advertising.\", \"B) They have considered regulatory action to promote fair competition.\", \"C) They have limited sales of digital giants' products.\", \"D) They have sought to protect consumers' privacy.\"]",
      "correct_answer": "B",
      "analysis": "事实细节题。第五段最后一句提到，在欧盟委员会竞争主管玛格丽特·维斯特格的领导下，各国都在寻求监管市场，并鼓励公平竞争，故答案为B。",
      "explanation": "第五段最后一句：'Led by Margrethe Vestager, the European Union's competition chief, countries have sought to police the market and encourage fair play.'",
      "question_order": 48,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 108,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 50,
      "question_text": "What do Americans generally think of social media companies according to the author?",
      "options": "[\"A) They are invading people's privacy.\", \"B) They are increasingly influential.\", \"C) They are becoming untrustworthy.\", \"D) They are growing out of control.\"]",
      "correct_answer": "C",
      "analysis": "事实细节题。最后一段最后两句指出，公众普遍对社交媒体公司越来越怀疑。根据皮尤研究中心2020年的一项研究，超过60%的人认为这个行业对国家有负面影响，几乎一半的人希望对社交媒体进行更多的监管。由此可知，社交媒体公司正逐渐失去人们的信任，故答案为C。",
      "explanation": "最后一段最后两句：'And the public in general have grown increasingly skeptical of social media companies. More than 60% say the sector has a negative effect on the country, and almost half want more regulation for social media, according to a 2020 Pew Research Center study.'",
      "question_order": 49,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 109,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 51,
      "question_text": "What is the popular assumption about international tourism?",
      "options": "[\"A) Its benefits may compensate for the adverse environmental consequences.\", \"B) Its rapid development is attributed to people's improved living standard.\", \"C) It appeals to people in places with favorable geographical conditions.\", \"D) It contributes to the economy of destination countries and regions.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。文章首段第一句提到现代国际旅游业流行的原因。紧接着第二句指出，旅游业往往被描述为目的地国家和城市的经济引擎。由此可知，人们普遍认为国际旅游业有助于目的地国家和地区的经济发展。故答案为D。",
      "explanation": "首段第二句：'Travel is often portrayed as a tool for personal growth and tourism as an economic motor for destination countries and cities.'",
      "question_order": 50,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 110,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 52,
      "question_text": "What do we learn from some studies about uncontrolled tourism development?",
      "options": "[\"A) It gives rise to an increase in mass confrontations.\", \"B) It incurs local residents' antagonism to tourists.\", \"C) It inhibits the steady growth of local economy.\", \"D) It brings in a large chunk of mobile population.\"]",
      "correct_answer": "B",
      "analysis": "事实细节题。第三段第一句提到未加控制的旅游业开发已成为社会和环境破坏的主要驱动因素。紧接着第二句指出，旅游业研究提供了大量文献资料证明该行业的众多负面社会影响以及由此导致当地居民对游客的愤恨。第四段第一句则进一步强调这种对游客的敌意通常出现在人满为患的成熟目的地。由此可知，对未加控制的旅游业开发进行的一些研究表明它引起当地居民对游客的愤恨和敌意。故答案为B。",
      "explanation": "第三段第二句：'Tourism studies provide much documentation of the many negative social impacts of tourism and resulting resentment that local populations direct toward visitors.'",
      "question_order": 51,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 111,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 53,
      "question_text": "Why does the author say local residents of popular destinations often feel frustrated?",
      "options": "[\"A) They fall victim to social conflicts and environmental disturbances.\", \"B) They have little opportunity to enjoy themselves on cruise ships.\", \"C) They cannot find employment in multinational hotel chains.\", \"D) They do not think they benefit as much as they deserve.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。第五段第一句提到当地方感受不到旅游业带来的好处时，当地居民往往就会变得沮丧。紧接着第二句进一步解释原因是旅游业无法保证跨国连锁酒店会在当地社区公平分配这些好处。由此可知，当地居民经常感到沮丧是因为他们无法公平获得旅游业带来的好处，即未获得应得的好处。故答案为D。",
      "explanation": "第五段第一句：'Residents often become frustrated when the benefits of tourism are not felt locally.'",
      "question_order": 52,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 112,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 54,
      "question_text": "How does the author say local residents in destination communities respond to tourism activity?",
      "options": "[\"A) They endeavor to adapt to it.\", \"B) They readily adopt new lifestyles.\", \"C) They immerse tourists in their culture.\", \"D) They try to upgrade their business models.\"]",
      "correct_answer": "A",
      "analysis": "事实细节题。第七段第一句提到目的地社区的当地居民发现自己一直在适应新的文化边界、阶级动态、服务行业角色和生活方式转变。紧接着第二句具体举例进行说明，因为当地居民出现了同游客一样的种种不良行为，即当地居民在适应旅游活动的负面影响，所以旅游活动相应地带来了社会问题的增加。综合可知，目的地社区的当地居民对旅游活动的回应是尽力去适应它。故答案为A。",
      "explanation": "第七段第一句：'In recent decades, local residents in destination communities also have found themselves negotiating new cultural boundaries, class dynamics, service industry roles and lifestyle transformations.'",
      "question_order": 53,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 113,
      "section_id": 15,
      "question_type": "single_choice",
      "question_number": 55,
      "question_text": "What can tourists do to exert more positive impacts on the tourist destinations?",
      "options": "[\"A) Show interest in local customs and lifestyles.\", \"B) Seek possibilities to invest in local companies.\", \"C) Use the services provided by local businesses.\", \"D) Give favorable comments about their services.\"]",
      "correct_answer": "C",
      "analysis": "推理判断题。最后一段第三句提到从长远来看，做一个负责任的旅行者意味着确保对当地人和当地环境具有积极影响。而前两句指出，本土企业为当地居民提供直接的社会、环境和经济效益，应该得到市场回报。由此可知，负责任的旅行者应使用本土企业提供的服务，让本土企业从中获利，从而对当地产生积极影响。故答案为C。",
      "explanation": "最后一段第三句：'In the long run, being a responsible traveler means ensuring net positive impacts for local people and environments.' 结合前文提到的本土企业为当地居民提供直接的社会、环境和经济效益，应该得到市场回报。",
      "question_order": 54,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 114,
      "section_id": 16,
      "question_type": "translation",
      "question_number": 56,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "翻译题目，需要学生将中文段落准确翻译成英文，注意语法、词汇和句式结构的正确性",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 55,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    }
  ]
}