{
  "exam_papers": [
    {
      "id": 1,
      "exam_type": "CET-6",
      "year": 2023,
      "month": 12,
      "paper_number": 1,
      "title": "2023年12月大学英语六级考试真题（一）",
      "description": "2023年12月大学英语六级考试真题（第一套），包含写作、听力、阅读理解和翻译四个部分",
      "total_score": 710,
      "time_allowed": 130,
      "questions_count": 55,
      "sections_count": 8,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_sections": [
    {
      "id": 1,
      "paper_id": 1,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to write an essay that begins with the sentence \"As is known to all, gaining a sound knowledge of the basics is of vital importance for students to master an academic subject.\" You can make comments, cite examples or use your personal experiences to develop your essay. You should write at least 150 words but no more than 200 words (not including the sentence given).",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "paper_id": 1,
      "section_type": "listening",
      "section_name": "听力部分 - Section A",
      "section_order": 1,
      "time_allowed": 30,
      "directions": "In this section, you will hear two long conversations. At the end of each conversation, you will hear four questions. Both the conversation and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C), and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 8,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "paper_id": 1,
      "section_type": "listening",
      "section_name": "听力部分 - Section B",
      "section_order": 2,
      "time_allowed": 30,
      "directions": "In this section, you will hear two passages. At the end of each passage, you will hear three or four questions. Both the passage and the questions will be spoken only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 7,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "paper_id": 1,
      "section_type": "listening",
      "section_name": "听力部分 - Section C",
      "section_order": 3,
      "time_allowed": 30,
      "directions": "In this section, you will hear three recordings of lectures or talks followed by three or four questions. The recordings will be played only once. After you hear a question, you must choose the best answer from the four choices marked A), B), C) and D). Then mark the corresponding letter on Answer Sheet 1 with a single line through the centre.",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "listening",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section A",
      "section_order": 4,
      "time_allowed": 40,
      "directions": "In this section, there is a passage with ten blanks. You are required to select one word for each blank from a list of choices given in a word bank following the passage. Read the passage through carefully before making your choices. Each choice in the bank is identified by a letter. Please mark the corresponding letter for each item on Answer Sheet 2 with a single line through the centre. You may not use any of the words in the bank more than once.",
      "passage_content": "The desert is deceiving. At first glance it looks lifeless, barren, and bone-dry. For most passersby humming through the Mojave on their way to try their luck in Las Vegas or heading towards the Grand Canyon, it's just a ___26___ stretch of land with some mountains in the distance and more ___27___ to be a setting for a movie that takes place on Mars. The desert, however, is ___28___ with life, mystery, and magic.\n\nThe Mojave desert sees less than two inches of rain a year, and like most deserts, is a land of ___29___. Temperature fluctuations vary from freezing to ___30___ hot, not only between seasons, but even within the same day.\n\nAt the heart of this vast, 25,000-square-mile desert is Mojave National Preserve. The folks managing and working there wear the wide-brimmed (宽边的) hats that have become ___31___ with places like Yosemite. The preserve is rich with history, culture, biodiversity, and endless opportunities to ___32___ your interest, especially for anyone who loves the outdoors. For a photographer, it requires patience and ___33___ a few spare tires to maneuver the network of unpaved \"roads\", but the rewards are plenty.\n\nPhotographing here requires a good, ___34___ pair of shoes and a lot of preparation. Plenty of water, spare tires, and a full tank of gas are needed to explore this unit of the national park system, which is the third largest in the country.\n\nLike all deserts, though, if you are patient, you will be rewarded, as they often reveal their secrets slowly. During my last outing, I was surprised to see how much of the area was shaped by ancient volcanoes and geological forces, much of which remains today, giving the area a ___35___ feel and painting a colorful background for great photographs.",
      "passage_title": "The Deceiving Desert",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 6,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section B",
      "section_order": 5,
      "time_allowed": 40,
      "directions": "In this section, you are going to read a passage with ten statements attached to it. Each statement contains information given in one of the paragraphs. Identify the paragraph from which the information is derived. You may choose a paragraph more than once. Each paragraph is marked with a letter. Answer the question by marking the corresponding letter on Answer Sheet 2.",
      "passage_content": "A) On the hills of central Kenya, almost lime-green with the sparkle of tea bushes in the sunlight, farmers know all about climate change. \"The rainy season is no longer predictable,\" says one. \"When it is supposed to rain it doesn't, then it all comes at once.\" Climate change is an issue that will affect everyone on the planet. For Africans its consequences will be particularly bitter: whereas other regions were able to grow rich by burning coal and oil, Africa will pay much of the human price without having enjoyed the benefits. \"Africa only represents 2% of global greenhouse gas emissions but it is the continent that is expected to suffer the most from climate impacts,\" says Mafalda Duarte, who runs the World Bank's S8bn Climate Investment Funds.\n\nB) Although there are huge uncertainties as to the precise impacts of climate change, enough is known to say that global warming represents one of the main threats to Africa's prosperity. Parts of the continent are already warming much more quickly than the average: temperatures in southern Africa have increased by about twice the global rate over the past 50 years. Even if the world were to cut emissions enough to keep global warming below 1.59°C, heat-waves would intensify in Africa and diseases would spread to areas not currently affected. Farming would also be hit hard. About 40% of the land now used to grow maize (玉米) would no longer be suitable for it. Overall, it is estimated that maize yields would fall by 18-22%.\n\nC) Africa is particularly vulnerable, in part because it is already struggling to feed itself and it will have to vastly increase yields and productivity if it is to put food on the plates of a fast- growing population, even without climate change. The UN's Food and Agriculture Organisation reckons that by 2050 global food production would have to rise by about 70% over its level of 2009 to meet demand from a population that is growing in numbers and appetite. Much of this new demand will be in Africa. Yet the continent already imports about $50bn-worth of food a year and that figure is expected to more than double over the next five years. Self-sufficiency is not Africa's goal, but the fact that it spends more money importing food than it does buying capital goods suggests it has room for improvement.\n\nD) Finding out why is not hard. Most farms are tiny, ploughed by hand and reliant on rain. More than half of Africa's people make their living from farming. Although its total harvest has climbed over the past few decades, this is mainly because there are more people farming more land. But in many places there is no spare land to farm. Plots in Rwanda are so small that you could fit 250 of them onto the average American farm. And although output per worker has improved by more than half over the past 30 years in Africa, that is still far behind the 2.5 times improvement in Asia. Yields of maize are generally less than two tonnes per hectare, a fifth the level in America.\n\nE) The low productivity of African farmers is reflected in national economic statistics—despite absorbing so much labour, farming generates just 15% of GDP. \"They can't even feed their families,\" says Jennifer Blanke, a vice-president of the African Development Bank in charge of agriculture. \"Farm productivity hasn't improved in many parts of Africa for 100 years.\"\n\nF) One reason is that in the first few decades of independence, many African governments neglected farming as they focused on industrialising their economies. Others damaged it by pushing down the prices that state monopolies paid for their crops in order to subsidise workers in cities with cheap food. Ghana taxed cocoa (可可粉) exports so heavily that production collapsed by half between the 1960s and 1980s, despite a jump in the global price of cocoa. Yet over the past two decades or so governments and donors have begun to look again at farming as a way of providing jobs for the 13 million young people entering the workforce each year. Much of the focus has been on getting small farmers to use fertiliser and, more important, better seeds. The results can be impressive. Improved varieties of sorghum (高梁), for instance, can produce a crop that is 40% larger than the usual variety. Infrastructure is important. A World Bank irrigation project in Ethiopia helped farmers increase their potato harvest from about 8 tonnes per hectare to 35 tonnes.\n\nG) Better techniques help, too. Small coffee farmers in Kenya are able to increase their incomes by 40% by following a few simple guidelines on caring for their bushes, such as trimming all but three of their stems. Many of their neighbours do not follow the advice, because it seems counter-intuitive. More stems ought to lead to more coffee beans, they say. Yet after seeing those following the advice get bigger harvests for a season or two, many others start doing the same.\n\nH) One way of spreading knowledge is to link farms to big buyers of their harvests. When Diageo, a British drinks giant, built a brewery in western Kenya, it wanted to use local crops to make a beer cheap enough to compete with illicit home brew. It organised farmers into groups, improved supply chains for them to get seeds and fertiliser and then agreed to buy their grain. It now provides a market to about 17,000 farmers. Across the region it has doubled its use of local raw material to about 80% over five years, says John O'Keeffe, who runs its Africa business.\n\nI) An even more important change is the move from traditional farming to building businesses that can profitably bring technology and investment to small farmers. Taita Ngetich, a young Kenyan, was studying engineering when he wanted to earn a little money on the side. He scraped together 20,000 Kenyan shillings (about $200) to plant tomatoes. Everything went wrong. The crop was attacked by pests. \"Then there was a massive flood that swallowed all our capital,\" he says. Mr. Ngetich persevered by looking into buying a greenhouse to protect his plants from bugs and rain. The cheapest ones cost more than $2,500 each, so he designed his own for half the price. Soon neighbouring farmers started placing orders with him, and now his firm, Illuminum Greenhouses, has sold more than 1,400 greenhouses that provide livelihoods to about 6,000 people. The business does not stop there; he also supplies fertiliser, high-quality seedlings and smart sensors that increase yields.\n\nJ) Illuminum's success shows how technology can help even small farms become more productive. Because such a large share of Africa's population earns a living from agriculture, even small improvements in productivity can lift the incomes of millions of people. But over the longer run small-scale farming can go only so far, especially in the face of climate change and population pressure.\n\nK) \"If we really want to lift people out of poverty we have to finance projects that will get them an income of at least $100 a month so that they can pay for health care and education,\" says Mr. Ngetich. \"Projects that give them an extra $2 a month from growing beans or maize aren't going to get them there.\" Getting those big jumps will need better jobs in factories and cities.",
      "passage_title": "African countries must get smarter with their agriculture",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 7,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section C",
      "section_order": 6,
      "time_allowed": 40,
      "directions": "There are 2 passages in this section. Each passage is followed by some questions or unfinished statements. For each of them there are four choices marked A), B), C) and D). You should decide on the best choice and mark the corresponding letter on Answer Sheet 2 with a single line through the centre.",
      "passage_content": "Passage One\n\nOne of the great successes of the Republican Party in recent decades is the relentless propagation of a simple formula for economic growth: tax cuts.\n\nThe formula doesn't work, but that has not affected its popularity. And while the cult of tax cuts has attracted many critics, it lacks for obvious rivals.\n\nDemocratic politicians have tended to campaign on helping people left behind by economic growth. When Democrats do talk about encouraging economic growth, they often sound like Republicans.\n\nThis is not just a political problem for Democrats; it is an economic problem for the United States. The nation needs a better story about the drivers of economic growth. The painful lessons of recent decades point to a promising candidate: higher wages.\n\nRaising the wages of American workers ought to be the priority of economic policymakers. We'd all be better off paying less attention to quarterly updates on the growth of the nation's gross domestic product (GDP) and focusing instead on the growth of workers' paychecks.\n\nSet aside, for the moment, the familiar argument for higher wages: fairness. The argument here is that higher wages can fuel the engine of economic growth.\n\nPerhaps the most famous illustration of the benefits is the story of Henry Ford's decision in 1914 to pay $5 a day to workers on his Model T assembly lines. He did it to increase production—he was paying a premium to maintain a reliable workforce. The unexpected benefit was that Ford's factory workers became Ford customers, too.\n\nThe same logic still holds: Consumption drives the American economy, and workers who are paid more can spend more.\n\nMainstream economists insist that it is impossible to order up a sustainable increase in wages because compensation levels reflect the unerring judgment of market forces.\n\nThe conventional wisdom held that productivity growth was the only route to higher wages. Through that lens, efforts to negotiate higher wages were counterproductive. Minimum-wage laws would raise unemployment because there was only so much money in the wage pool, and if some people got more, others would get none.\n\nIt was in the context of this worldview that it became popular to argue that tax cuts would drive prosperity. Rich people would invest, productivity would increase, wages would rise.\n\nIn the real world, things are more complicated. Wages are influenced by a tug of war between employers and workers, and employers have been winning. One clear piece of evidence is the widening gap between productivity growth and wage growth since roughly 1970. Productivity has more than doubled; wages have lagged far behind.\n\nA focus on wage growth would provide an antidote (矫正方法) to the attractive simplicity of the belief in the magical power of tax cuts.\n\nPassage Two\n\nJournal editors decide what gets published and what doesn't, affecting the careers of other academics and influencing the direction that a field takes. You'd hope, then, that journals would do everything they can to establish a diverse editorial board, reflecting a variety of voices, experiences, and identities.\n\nUnfortunately a new study in Nature Neuroscience makes for disheartening reading. The team finds that the majority of editors in top psychology and neuroscience journals are male and based in the United States: a situation that may be amplifying existing gender inequalities in the field and influencing the kind of research that gets published.\n\nMen were found to account for 60% of the editors of psychology journals. There were significantly more male than female editors at each level of seniority, and men made up the majority of editors in over three quarters of the journals. Crucially, the proportion of female editors was significantly lower than the overall proportion of women psychology researchers.\n\nThe differences were even starker in the neuroscience journals: 70% of editors were male, and men held the majority of editorial positions in 88% of journals. In this case, the proportion of female editors was not significantly lower than the proportion of female researchers working in neuroscience—a finding that reveals enduring gender disparities in the field more broadly.\n\nBased on their results, the team concludes that \"the ideas, values and decision-making biases of men are overrepresented in the editorial positions of the most recognized academic journals in psychology and neuroscience.\"\n\nGender inequality in science is often attributed to the fact that senior academics are more likely to be male, because historically science was male—dominated: it's argued that as time goes on and more women rise to senior roles, the field will become more equal. Yet this study showed that even the junior roles in psychology journals tended to be held disproportionately by men, despite the fact that there are actually more female than male junior psychology faculty.\n\nThis implies that a lack of female academics is not the problem. Instead, there are structural reasons that women are disadvantaged in science. Women receive lower salaries and face greater childcare demands, for instance, which can result in fewer publications and grants—the kinds of things that journals look for when deciding who to appoint. Rather than simply blaming the inequality of editorial boards on tradition, we should be actively breaking down these existing barriers.\n\nA lack of diversity among journal editors also likely contributes to psychology's WEIRD problem. If journal editors are largely men from the United States, then they will probably place higher value on papers that are relevant to Western, male populations, whether consciously or not.",
      "passage_title": "",
      "passage_type": "reading",
      "has_multiple_passages": 1,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 8,
      "paper_id": 1,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 7,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "在中国，随着老龄化社会的到来，养老受到普遍关注。人们谈论最多的是应当采取什么样的养老模式。多数人认为，养老模式需要多元化。可以通过政府引导和社会参与，建立更多更好的养老服务机构，改进社区服务中心，鼓励居家自助养老，还可以推行家庭养老与社会养老相结合的模式。随着政府和社会对养老服务事业投入的持续增加，养老设施将不断升级，服务质量逐步改进，老年人的生活将会更加方便舒适、健康快乐。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_questions": [
    {
      "id": 1,
      "section_id": 1,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write an essay that begins with the sentence \"As is known to all, gaining a sound knowledge of the basics is of vital importance for students to master an academic subject.\"",
      "options": "[]",
      "correct_answer": "",
      "analysis": "写作题目，需要学生以给定句子开头，写一篇关于基础知识重要性的议论文",
      "explanation": "考查学生的议论文写作能力，包括论点阐述、论证支持和结论总结",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 1,
      "question_text": "What do we learn about the man from his test results?",
      "options": "[\"A. It is clear that he is expected to enjoy a healthy life.\", \"B. There is nothing wrong with his digestive system.\", \"C. There is some indication of an issue with his blood circulation.\", \"D. He doesn't know he has long been suffering from poor health.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。对话开头交代了男士的检查结果，医生对男士说：\"我这有你的检查结果，是个好消息。验血结果没有问题。没有任何消化问题的迹象。\"由此可知，B项与对话内容相符。",
      "explanation": "对话中提到：'There is no indication of any digestive issues.'",
      "question_order": 0,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 2,
      "question_text": "What does the woman think is a common phenomenon among many people?",
      "options": "[\"A. Mistaking symptoms of illness for stress.\", \"B. Complaining they are being overworked.\", \"C. Being unaware of the stress they are under.\", \"D. Suffering from illness without recognising it.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。对话中问，女士说男士感觉不舒服可能是因为过于繁重的工作和压力，男士却反驳说自己从没感到过压力，女士说男士描述的这种看法是普通的，随后指明这一普通看法是指\"许多受压力的人没有意识到这一点\"，故C项与对话内容相符。",
      "explanation": "对话中提到：'Many people who suffer from stress fail to recognise it.'",
      "question_order": 1,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 3,
      "question_text": "What does the woman say she will do for the man?",
      "options": "[\"A. Prescribe some medication for him.\", \"B. Give him another physical check-up.\", \"C. Explain to him the common consequence of stress.\", \"D. Buy some sleeping pills for him from the drugstore.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。对话中问，男士询问女士自己总觉得很累，晚上睡不好觉是怎么回事，女士解释说这些症状都是压力带来的常见后果，并说：\"我将给你开一些专门的安眠药。\"由此可知，A项与对话内容相符。",
      "explanation": "对话中提到：'I'm going to prescribe some special sleeping pills for you.'",
      "question_order": 2,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 4,
      "question_text": "What does the man say about the industry he is engaged in?",
      "options": "[\"A. It calls for responsible management.\", \"B. It proves to be quite profitable.\", \"C. It is remarkably promising.\", \"D. It is full of competition.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。对话最后，女士建议男士应该少干点活，并询问男士有什么办法可以减少他的工作量，男士回答说：\"我是一名餐厅经理，这个行业竞争非常激烈。\"由此可知，男士所从事的行业充满了竞争，D项与对话内容相符。",
      "explanation": "对话中提到：'I'm a restaurant manager and this industry is very competitive.'",
      "question_order": 3,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 6,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 5,
      "question_text": "Why did John Williams leave the sport of basketball at just 25?",
      "options": "[\"A. To avoid being in the limelight.\", \"B. To seek medical help for his injury.\", \"C. To pursue a less competitive career.\", \"D. To stay away from his hostile teammates.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。对话开头，女士问男士为什么这么早退役，男士回答说自己不喜欢当名人，并说道：\"我是一个害羞的孩子，而且我没准备好接受所有媒体的关注。\"由此可知，约翰年纪轻轻就从篮球运动退役，是为了避免成为焦点，A项与对话内容相符。",
      "explanation": "对话中提到：'I was a shy kid and I wasn't ready for all the media attention.'",
      "question_order": 4,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 7,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 6,
      "question_text": "What does the man say about basketball as a career for most players?",
      "options": "[\"A. It has ups and downs.\", \"B. It proves rewarding.\", \"C. It does not last long.\", \"D. It is not so profitable.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。对话中，男士说：\"我知道对大多数球员来说，（打）篮球并不是一项长久的职业，所以我想在还年轻的时候改变职业。\"由此可知，C项与对话内容相符。",
      "explanation": "对话中提到：'I knew basketball wasn't a career with a lot of longevity for most players.'",
      "question_order": 5,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 8,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 7,
      "question_text": "What do we learn from the woman about John Williams 20 years later?",
      "options": "[\"A. He was a financial advisor.\", \"B. He suffered from poor health.\", \"C. He became a basketball coach.\", \"D. He was back in the news.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。对话中女士对男士说：\"好吧，那是20年前的事了，现在你又上新闻了。\"由此可知，D项与对话内容相符。",
      "explanation": "对话中提到：'Okay, that was 20 years ago, and you're back in the news.'",
      "question_order": 6,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 9,
      "section_id": 2,
      "question_type": "single_choice",
      "question_number": 8,
      "question_text": "What has the man spent the last two decades trying to do?",
      "options": "[\"A. Study issues of public health.\", \"B. Alleviate the obesity problem.\", \"C. Raise sufficient public funding.\", \"D. Train young basketball players.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。对话最后，男士说自己大学的专业是公共卫生，他了解到肥胖症流行的严重性，在过去的20年里，一直都致力于缓解这一问题。由此可知，B项与对话内容相符。",
      "explanation": "对话中提到：'I've spent the last two decades trying to alleviate the problem.'",
      "question_order": 7,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 10,
      "section_id": 3,
      "question_type": "single_choice",
      "question_number": 9,
      "question_text": "When did Kate Atkinson begin to write for women's magazines?",
      "options": "[\"A. When she started teaching at Edinburgh University in Scotland.\", \"B. While she was doing her doctoral studies on American Literature.\", \"C. After publishing her first novel Behind the Scenes at the Museum.\", \"D. After winning the 1986 Woman's Own Short Story Competition.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。文章开头部分提到，1986年，她在\"女性自己的短篇小说比赛\"中获奖，之后开始为女性杂志写文章。由此可知，凯特·阿特金森是在作品获奖之后开始为女性杂志撰稿的，故选项D正确。",
      "explanation": "文章中提到：'She began writing for women's magazines after winning the 1986 Woman's Own Short Story Competition.'",
      "question_order": 8,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 11,
      "section_id": 3,
      "question_type": "single_choice",
      "question_number": 10,
      "question_text": "What did Kate Atkinson's books touch on?",
      "options": "[\"A. The themes of love and loss.\", \"B. The code of human behaviour.\", \"C. The sins and flaws of eccentrics.\", \"D. The manners of fashionable circles.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。文章中间部分提到，无论阿特金森以何种体裁写作，她的作品都涉及爱与失去，以及如何继续下去的主题，选项A是文中的原词，故为正确选项。",
      "explanation": "文章中提到：'Whatever genre Atkinson writes in, her books touch on the themes of love and loss and how to carry on.'",
      "question_order": 9,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 12,
      "section_id": 3,
      "question_type": "single_choice",
      "question_number": 11,
      "question_text": "What do we learn about the clever and deceitful characters in a comedy of manners?",
      "options": "[\"A. They are usually ignorant of complex human relations.\", \"B. They successfully imitate the manners of celebrities.\", \"C. They often get rewarded instead of being punished.\", \"D. They are generally looked down upon in society.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。文章后半部分介绍了阿特金森的文章风格，被称为风俗喜剧，并在结尾处指出了风俗喜剧的一个特点：风俗喜剧往往会奖励那些聪明而又狡诈的人物，而不是惩罚他们的恶行。选项C是对reward its clever and deceitful characters, rather than punish their bad deeds的同义转述，故为正确选项。",
      "explanation": "文章中提到：'A comedy of manners tends to reward its clever and deceitful characters, rather than punish their bad deeds.'",
      "question_order": 10,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 13,
      "section_id": 3,
      "question_type": "single_choice",
      "question_number": 12,
      "question_text": "Why does the speaker say adaptability is an important skill to exercise in the workplace?",
      "options": "[\"A. It is what members use to alleviate tension in a team.\", \"B. It is what employers are increasingly seeking after.\", \"C. It is conducive to getting over a recession.\", \"D. It is necessary for learning a new task.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。文章开头便提出问题：为什么说话应能力是在职场中要锻炼的一项重要技能？接下来第二句就回答了这个问题：适应能力是雇主越来越追求的一项技能。因此，选项B正确。",
      "explanation": "文章中提到：'adaptability is a skill employers are increasingly looking for.'",
      "question_order": 11,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 14,
      "section_id": 3,
      "question_type": "single_choice",
      "question_number": 13,
      "question_text": "What does adaptability enable us to do according to strategy consultant Dorie Clark?",
      "options": "[\"A. Make better choices.\", \"B. Follow innovative ideas.\", \"C. Achieve recognition duly.\", \"D. Accumulate work experience.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。文章开头在提出了适应能力的重要性之后，引出了战略顾问多莉·克拉克的解释。她的解释很长，还列举了几个例子，最后才得出结论——适应能力能让你根据实际情况采取适当的行动，做出更准确、更明智和更有效的选择。选项A是对这个结论的概括，为正确选项。",
      "explanation": "文章中提到：'That enables you to make more accurate, informed and effective choices.'",
      "question_order": 12,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 15,
      "section_id": 3,
      "question_type": "single_choice",
      "question_number": 14,
      "question_text": "What do we learn about today's work culture from the passage?",
      "options": "[\"A. Workers show more emotional intelligence.\", \"B. Workers use brains more than muscles.\", \"C. People usually work flexible hours.\", \"D. People often work in teams.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。文章后半部分提到，如今的工作文化和管理方式往往基于团队合作，而不是过于严格的等级制度。因此，选项D正确。",
      "explanation": "文章中提到：'Today's work culture and management style is often based on teamwork.'",
      "question_order": 13,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 16,
      "section_id": 3,
      "question_type": "single_choice",
      "question_number": 15,
      "question_text": "What are employees with adaptability able to do when changes occur?",
      "options": "[\"A. Leave the group as soon as possible.\", \"B. Anticipate setbacks well in advance.\", \"C. Decide on new priorities speedily.\", \"D. Stick to original goals confidently.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。文章最后指出，灵活的员工能在变化发生时迅速调整优先次序，并在某些事情行不通时提出额外的调整建议。因此选项C正确。",
      "explanation": "文章中提到：'They can reprioritize quickly when changes occur.'",
      "question_order": 14,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 17,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 16,
      "question_text": "What question does the speaker address in this talk?",
      "options": "[\"A. What differentiates people from animals.\", \"B. Why philosophers disagree with scientists.\", \"C. Where humans' great cognitive capacity originates.\", \"D. When being creative becomes a biological mandate.\"]",
      "correct_answer": "A",
      "analysis": "主旨大意题。在讲座开头，讲话者便提出了\"是什么让人类与其他物种不同\"这个问题。由此很容易得出正确答案为选项A。",
      "explanation": "讲座中提到：'What makes humans different from other species?'",
      "question_order": 15,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 18,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 17,
      "question_text": "What does the speaker believe about innovation?",
      "options": "[\"A. It is what tells apart two adjacent generations.\", \"B. It is what sharpens our appetite for novelty.\", \"C. It is something only geniuses can achieve.\", \"D. It is something every human being can do.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。讲话者在中间部分提到，许多人都认为只有天才才能创新，但讲话者相信，创新不是只有少数人才能做到的事情。由此可知，选项D为正确答案。",
      "explanation": "讲座中提到：'I believe that innovation is not something that only a few people do.'",
      "question_order": 16,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 19,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 18,
      "question_text": "How does the human brain work according to the speaker?",
      "options": "[\"A. It seeks inspiration for novel inventions.\", \"B. It constantly absorbs new information.\", \"C. It uses existing ideas to create new ones.\", \"D. It repeats precedent on a regular basis.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。讲话者提到，人类的大脑是依托先例运作的。我们把继承下来的想法组合在一起，形成新的形态。由此可知，选项C为正确答案。",
      "explanation": "讲座中提到：'The human brain works from precedent. We take the ideas we've inherited and put them together into some new shape.'",
      "question_order": 17,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 20,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 19,
      "question_text": "What view of many dog owners win support from researchers studying dog cognition?",
      "options": "[\"A. Dogs know when their owners are not feeling well.\", \"B. Dogs have the cognition for telling right from wrong.\", \"C. Dogs have an aptitude for developing skills to interact with humans.\", \"D. Dogs know when their human companions can no longer stand them.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。讲者在开头就提到，许多养狗人士会告诉你，当他们生病或心烦意乱时，他们的狗不知怎么就会知道，而且根据研究狗认知的研究人员的说法，这些宠物主人的感觉是对的。由此很容易得出，选项A为正确答案。",
      "explanation": "讲座中提到：'Many dog owners would tell you that their dog somehow knows when they're ill or upset, and according to researchers who study dog cognition, those pet owners are right.'",
      "question_order": 18,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 21,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 20,
      "question_text": "Why can dogs detect their owner's abnormal odor according to the speaker?",
      "options": "[\"A. They can readily detect different ill smells of viruses.\", \"B. They can easily tell what bacteria cause odor change.\", \"C. They are particularly sensitive to strange smells.\", \"D. They have an extremely powerful sense of smell.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。讲者在前半部分提到，如果一个人感染了病毒或细菌，他们的气味就会有异常，即使人类不能，狗也能闻出这种气味的变化，因为狗的嗅觉比人类强大得多。由此可知，选项D为正确答案。",
      "explanation": "讲座中提到：'dogs have a much more powerful sense of smell than humans.'",
      "question_order": 19,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 22,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 21,
      "question_text": "What does research suggest for now about dog ownership?",
      "options": "[\"A. It can ensure owners suffer fewer chronic diseases.\", \"B. It can benefit owners both physically and mentally.\", \"C. It can reduce owners' risk of getting cancer or diabetes.\", \"D. It can alert owners to the seriousness of their conditions.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。讲者在最后提到，目前，有研究表明，养狗本身就有很多好处，可以促进健康和改善情绪。由此可知，选项B为正确答案。",
      "explanation": "讲座中提到：'research suggests dog ownership can have an array of benefits in and of itself. Keeping a pet dog has been shown to bolster health and boost mood.'",
      "question_order": 20,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 23,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 22,
      "question_text": "What does Onward's report propose ministers should do?",
      "options": "[\"A. Crack down on courses like science, technology, engineering and math.\", \"B. Restrict the ability of creative arts courses to recruit new students.\", \"C. Look at how to reform technical and vocational education.\", \"D. Ensure creative arts students get better value for money.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。讲者者在开头提到，智库Onward发表了一份题为\"学位问题\"的报告，该报告认为创意艺术专业的学位并非物有所值。Onward认为，部长们应该\"严厉打击那些为毕业10年后的学生提供的性价比极其有限的课程\"，如果毕业生的平均收入低于学生贷款支付门槛，就应该限制这类课程招收新生的能力。由此可知，Onward认为创意艺术专业给学生提供的课程性价比极其有限，应该限制创意艺术课程招收新生的能力，故选项B为正确答案。",
      "explanation": "讲座中提到：'Ministers, according to Onward, should \"crack down on courses that offer extremely limited value for money to students ten years after graduation\", restricting the ability of such courses to recruit new students.'",
      "question_order": 21,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 24,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 23,
      "question_text": "What does the speaker think of Onward's arguments?",
      "options": "[\"A. Seemingly reasonable.\", \"B. Clearly well-grounded.\", \"C. Extremely irrational.\", \"D. Apparently simplistic.\"]",
      "correct_answer": "A",
      "analysis": "观点态度题。讲者者提到，乍一看，Onward的观点似乎有道理，故选项A为正确答案。",
      "explanation": "讲座中提到：'At first glance, it might even seem like Onward have a point.'",
      "question_order": 22,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 25,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 24,
      "question_text": "What do we learn about British college graduates five years after graduation?",
      "options": "[\"A. A high proportion of them haven't tried to save money.\", \"B. Most of them never hope to buy a house or to retire.\", \"C. Forty percent of them earn less than £25,000 a year.\", \"D. The majority of them have fairly well-paying jobs.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。讲者者提到，40%的毕业生——无论什么样的学位——毕业5年后的年薪还不到2.5万英镑，故选项C为正确答案。",
      "explanation": "讲座中提到：'40 percent of all graduates—regardless of their degree—are on less than 25,000 pounds a year, 5 years after graduation.'",
      "question_order": 23,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 26,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 25,
      "question_text": "What does the speaker say actually accounts for the problem identified by Onward?",
      "options": "[\"A. The context of a bank balance.\", \"B. Britain's economy as a whole.\", \"C. The specific degree a student earns.\", \"D. Britain's defective educational system.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。讲者在后半部分提到，问题并不真正在于那些攻读特定学位的学生，而在于整个经济。由此可知，选项B为正确答案。",
      "explanation": "讲座中提到：'This suggests that the problem isn't really to do with specific students studying specific degrees, but really with the economy as a whole.'",
      "question_order": 24,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 27,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 26,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "D",
      "analysis": "形容词辨析题。空格前是不定冠词a，空格后是名词stretch及介词of，由此可知，此处是a stretch of的固定短语，意为\"一段；一大片\"。所以，空格处应填入一个形容词或分词，充当名词stretch的定语。文章开头提及沙漠具有欺骗性，然后提到了莫哈韦沙漠，由此可知，此处进一步解释莫哈韦沙漠是一片什么样的土地，根据常识可知，沙漠一般是\"平坦的\"，故备选形容词和分词中flat符合语境。",
      "explanation": "根据上下文，莫哈韦沙漠是一片平坦的土地，远处有山脉。",
      "question_order": 25,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 28,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 27,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "A",
      "analysis": "形容词辨析题。空格前是more，空格后是不定式to be，由此可知，空格处应填入一个形容词，构成\"be+形容词+to do sth.\"的结构。根据本句的介绍，莫哈韦沙漠是一片平坦之地，远处有山脉，这样的地理特征\"易于\"联想到发生在火星上的电影的场景。(be) apt to do sth.为固定短语，意为\"易于做某事，倾向于做某事\"，符合语境。",
      "explanation": "apt表示\"易于……的\"，这里指沙漠的地貌容易让人联想到火星电影的场景。",
      "question_order": 26,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 29,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 28,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "F",
      "analysis": "动词辨析题。空格前是be动词is，空格后是介词with，由此可知，此处应填入一个介词或形容词，构成\"be...with...\"的结构。文章开篇提到沙漠具有欺骗性，乍一看，它看起来毫无生气、贫瘠且干燥至极。而此处使用however表示转折，指出沙漠其实\"充满了\"生命、神秘和魔力。be overflowing with是固定短语，意为\"充满\"，符合语境。",
      "explanation": "overflowing with表示\"充满\"，这里指沙漠实际上充满了生命、神秘和魔力。",
      "question_order": 27,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 30,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 29,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "C",
      "analysis": "名词辨析题。空格前面是land of，空格后是句点，由此可知，空格处应填入名词，充当介词的宾语。下文提及，这片沙漠温度波动的范围从严寒到______热不等，不仅在季节之间，甚至在同一天内也是如此。从严寒到______热是两个极端，由此可知，此处是说，和大多数沙漠一样，这里也是一片\"极端\"之地，故extremes符合语境。",
      "explanation": "extremes表示极端，这里指沙漠是极端之地，温度变化极大。",
      "question_order": 28,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 31,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 30,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "B",
      "analysis": "形容词辨析题。空格前是vary from freezing to，空格后是hot，由此可知，freezing和hot是语义对等的两种情况。根据常识可知，沙漠地区昼夜温差大，属于极端地区，与\"严寒\"对应的应该是\"酷热\"，burning hot是固定短语，意为\"酷热\"，符合语境。",
      "explanation": "burning hot表示酷热，与freezing（严寒）形成对比。",
      "question_order": 29,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 32,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 31,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "N",
      "analysis": "形容词辨析题。空格前是have become，空格后是介词短语with places，由此可知，空格处应填入一个形容词或分词，构成\"be/become+形容词/分词+with\"的结构。上文提及在那里管理和工作的人都戴着宽边帽，这属于特征描述，由此可知，此处要表达的意思是，这已经成为约塞米蒂这样的地方的代名词。be/become synonymous with是固定短语，意为\"与……同义；等同于……\"，符合此处语境。",
      "explanation": "synonymous with表示\"与……同义\"，这里指宽边帽已经成为约塞米蒂等地方的标志。",
      "question_order": 30,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 33,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 32,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "L",
      "analysis": "动词辨析题。空格前是动词不定式标志to，空格后是名词短语your interest，由此可知，空格处应填入一个动词原形，与your interest构成动宾搭配。由于\"尤其是对于任何热爱户外活动的人来说\"可知，此处是说，该保护区拥有丰富的历史、文化、生物多样性和无尽的机会来\"激发\"你的兴趣，故stimulate符合语境。",
      "explanation": "stimulate表示刺激、激发，这里指激发兴趣。",
      "question_order": 31,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 34,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 33,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "H",
      "analysis": "副词辨析题。空格前是连词and，连接并列成分patience和a few spare tires，由此可知，空格处应填入副词，起修饰和限制作用。由于\"要想驾驭这些未铺设的'道路'网络\"可知，此处是说，驾驭这些未铺设的\"道路\"网络需要耐心，还需要一些备用轮胎。顾名思义，备用轮胎是备用的，可能用得上，可能用不上，因此，空格处应填入probably，表示一种不确定的说法。",
      "explanation": "probably表示可能，这里指可能需要备用轮胎。",
      "question_order": 32,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 35,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 34,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "M",
      "analysis": "形容词辨析题。空格前是good，空格后是pair of shoes，由此可知，此处使用了a pair of（一双）这一固定短语，故空格前应填入一个形容词，与good一起修饰pair。根据常识可知，在户外，尤其是恶劣的自然环境中行走，需要一双\"结实的\"好鞋，故sturdy符合语境。",
      "explanation": "sturdy表示结实的，这里指需要一双结实的鞋子。",
      "question_order": 33,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 36,
      "section_id": 5,
      "question_type": "blank_filling",
      "question_number": 35,
      "question_text": "",
      "options": "[\"A. apt\", \"B. burning\", \"C. extremes\", \"D. flat\", \"E. fractions\", \"F. overflowing\", \"G. parasites\", \"H. probably\", \"I. sparingly\", \"J. sprinkle\", \"K. steer\", \"L. stimulate\", \"M. sturdy\", \"N. synonymous\", \"O. unique\"]",
      "correct_answer": "O",
      "analysis": "形容词辨析题。空格前是不定冠词a，空格后是名词feel，由此可知，空格处应填入一个形容词或分词，充当feel的定语。上文提及，在\"我\"上一次旅行中，\"我\"惊讶地发现这一地区的很多地方都是由古火山和地质力量塑造而成的，其中大部分至今仍保留着。由此可知，该地区地貌奇特，会给人留下\"独特的\"感觉，故unique符合语境。",
      "explanation": "unique表示独特的，这里指该地区给人独特的感觉。",
      "question_order": 34,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 37,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 36,
      "question_text": "It is said that agricultural productivity in many African countries has remained low for a century.",
      "options": "[]",
      "correct_answer": "E",
      "analysis": "细节辨认题。由题干关键信息has remained low和for a century定位到E段。该段第一句提到，非洲农民的生产率低体现在国家经济统计数据中——尽管吸收了如此多的劳动力，农业只创造了15%的国内生产总值。随后在该段最后一句引用詹妮弗·布兰克的话，提到\"100年来，非洲许多地区的农业生产力没有提高\"。由此可知，题干是对原文的同义表述。",
      "explanation": "E段最后一句：'Farm productivity hasn't improved in many parts of Africa for 100 years.'",
      "question_order": 35,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 38,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 37,
      "question_text": "Building connections between farms and major purchasers of their produce can promote African farmers' use of advanced farming techniques.",
      "options": "[]",
      "correct_answer": "H",
      "analysis": "细节辨认题。由题干关键信息Building connections between farms and major purchasers和use of advanced farming techniques定位到H段。该段第一句指出，传播知识的一种方法是把农场和收购他们收成的大买家联系起来。随后举例说明英国饮料巨头蒂亚吉欧在肯尼亚西部建了一个啤酒厂，并将农民组织成小组，改善供应链，让他们获得种子和肥料，然后同意购买他们产出的粮食。由此可知，题干是对原文的同义表述。",
      "explanation": "H段第一句：'One way of spreading knowledge is to link farms to big buyers of their harvests.'",
      "question_order": 36,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 39,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 38,
      "question_text": "Parts of Africa are getting warmer much faster than the average, with southern Africa witnessing roughly twice the global warming rate over the last half century.",
      "options": "[]",
      "correct_answer": "B",
      "analysis": "细节辨认题。由题干关键信息getting warmer much faster than the average和roughly twice the global warming rate定位到B段。该段第二句指出，非洲大陆部分地区的变暖速度已经远超全球平均水平：在过去的50年里，非洲南部的气温上升速度大约是全球的两倍。由此可知，题干是对原文的同义表述。",
      "explanation": "B段第二句：'Parts of the continent are already warming much more quickly than the average: temperatures in southern Africa have increased by about twice the global rate over the past 50 years.'",
      "question_order": 37,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 40,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 39,
      "question_text": "Improved farming practices have enabled Kenyan farmers to increase farm produce remarkably.",
      "options": "[]",
      "correct_answer": "G",
      "analysis": "细节辨认题。由题干关键信息Improved farming practices、Kenyan farmers和increase farm produce remarkably定位到G段。该段前两句指出，更好的技术也有帮助。肯尼亚的咖啡种植小农只需遵循一些简单的指导原则来打理他们的树丛，比如修剪咖啡树枝，只保留三根枝条，他们的收入就能增加40%。随后进一步指出，刚开始很多邻居并没有听从这个建议，但过了一两年，在看到那些遵循建议的人收成大增之后，他们也开始这样做。由此可知，题干是对原文的同义表述。",
      "explanation": "G段前两句：'Better techniques help, too. Small coffee farmers in Kenya are able to increase their incomes by 40% by following a few simple guidelines on caring for their bushes.'",
      "question_order": 38,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 41,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 40,
      "question_text": "Africa is especially susceptible to the effects of global warming partly because it has difficulty feeding its increasing population even without climate change.",
      "options": "[]",
      "correct_answer": "C",
      "analysis": "细节辨认题。由题干关键信息especially susceptible、has difficulty feeding和even without climate change定位到C段。该段第一句指出，非洲尤其容易受到影响，部分原因在于它本身已经很难养活自己，如果要为其快速增长的人口提供食物，即使没有气候变化，它也必须大幅提高产量和生产力。由此可知，题干是对原文的同义表述。",
      "explanation": "C段第一句：'Africa is particularly vulnerable, in part because it is already struggling to feed itself and it will have to vastly increase yields and productivity if it is to put food on the plates of a fast- growing population, even without climate change.'",
      "question_order": 39,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 42,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 41,
      "question_text": "The use of fertiliser and improved seeds can help Africa's small farmers impressively increase crop yields.",
      "options": "[]",
      "correct_answer": "F",
      "analysis": "细节辨认题。由题干关键信息use of fertiliser and improved seeds和impressively increase crop yields定位到F段。该段最后几句话指出，当地开始重视农业后，焦点主要集中在让小麦使用肥料上，更重要的是，用更好的种子。效果十分显著。例如，高粱的改良品种可以比普通品种的产量高出40%。由此可知，题干是对原文的同义表述。",
      "explanation": "F段倒数第三、四句：'Much of the focus has been on getting small farmers to use fertiliser and, more important, better seeds. The results can be impressive.'",
      "question_order": 40,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 43,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 42,
      "question_text": "It has proved even more important to shift from traditional farming to setting up businesses that can bring technology and investment to small farmers in Africa.",
      "options": "[]",
      "correct_answer": "I",
      "analysis": "细节辨认题。由题干关键信息shift from traditional farming和setting up businesses that can bring technology and investment to small farmers定位到I段。该段第一句指出，一个更重要的转变是从传统农业转向创立能为小农户带来技术和投资，并从中获利的企业。由此可知，题干是对原文的同义表述。",
      "explanation": "I段第一句：'An even more important change is the move from traditional farming to building businesses that can profitably bring technology and investment to small farmers.'",
      "question_order": 41,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 44,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 43,
      "question_text": "Everyone in the world will have to bear the consequences of climate change, especially Africans.",
      "options": "[]",
      "correct_answer": "A",
      "analysis": "细节辨认题。由题干关键信息Everyone in the world和especially Africans定位到A段。该段第四句和第五句指出，气候变化是一个会影响地球上每一个人的问题。对非洲人来说，其后果将尤为严重。由此可知，题干是对原文的同义表述。",
      "explanation": "A段第四、五句：'Climate change is an issue that will affect everyone on the planet. For Africans its consequences will be particularly bitter.'",
      "question_order": 42,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 45,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 44,
      "question_text": "Improvement in farm output per worker in Africa falls far short of that in Asia.",
      "options": "[]",
      "correct_answer": "D",
      "analysis": "细节辨认题。由题干关键信息Improvement in farm output per worker和far short of that in Asia定位到D段。该段倒数第二句指出，尽管非洲的人均（农业）产量在过去30年里提高了一半以上，但仍远远落后于亚洲2.5倍的增幅。由此可知，题干是对原文的同义表述。",
      "explanation": "D段倒数第二句：'And although output per worker has improved by more than half over the past 30 years in Africa, that is still far behind the 2.5 times improvement in Asia.'",
      "question_order": 43,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 46,
      "section_id": 6,
      "question_type": "paragraph_matching",
      "question_number": 45,
      "question_text": "In the long term, the potential for small farms in Africa to increase productivity is quite limited, especially owing to the warming climate and a growing population.",
      "options": "[]",
      "correct_answer": "J",
      "analysis": "细节辨认题。由题干关键信息small farms、quite limited和especially owing to the warming climate and a growing population定位到J段。该段指出，Illuminum公司的成功表明，技术可以帮助小农场提高生产力。由于非洲如此大规模的人口以农业为主，因此即使生产力的小幅提升也能提高数百万人的收入。但从更长远来看，小规模农业只能起到一定作用，尤其是在面对气候变化和人口压力的情况下。由此可知，题干是对原文的同义表述。",
      "explanation": "J段最后一句：'But over the longer run small-scale farming can go only so far, especially in the face of climate change and population pressure.'",
      "question_order": 44,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 47,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 46,
      "question_text": "Why does the formula of tax cuts remain popular though ineffective?",
      "options": "[\"A. Its critics' voice has not been heard throughout the country.\", \"B. There seem to be no other options available to replace it.\", \"C. The cult of tax cuts has been relentlessly propagated by all policymakers.\", \"D. There appears to be a misunderstanding of the formula among the public.\"]",
      "correct_answer": "B",
      "analysis": "推理判断题。根据题干信息词formula of tax cuts remain popular though ineffective可将答案线索定位至第二段。第二段提及，这个方案虽然不起作用，但这并没有影响它的受欢迎程度。对减税的推崇引来了许多批评人士，但它缺乏明显的竞争对手。由此可知，原文所说的\"竞争对手\"就是指其他解决方案，即没有其他可替代的方案，故答案为B。",
      "explanation": "第二段：'The formula doesn't work, but that has not affected its popularity. And while the cult of tax cuts has attracted many critics, it lacks for obvious rivals.'",
      "question_order": 45,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 48,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 47,
      "question_text": "What does the author think is a more effective measure for driving economic growth in the U.S.?",
      "options": "[\"A. Aiding people left behind by economic growth.\", \"B. Prioritizing the growth of the nation's GDP.\", \"C. Increasing the compensation for labor.\", \"D. Introducing even more extensive tax cuts.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。根据题干信息词a more effective measure for driving economic growth可将答案线索定位至第四段。第四段第二句提及，关于经济增长动力，美国需要一个更好的故事。随后第三句说明，近几十年的惨痛教训指向了一个大有可为的候选方案：提高工资。因此C项符合题意。",
      "explanation": "第四段最后一句：'The painful lessons of recent decades point to a promising candidate: higher wages.'",
      "question_order": 46,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 49,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 48,
      "question_text": "What is the logic underlying the author's viewpoint?",
      "options": "[\"A. The growth of workers' paychecks ultimately boosts the nation's economy.\", \"B. Paying a premium to maintain a reliable workforce attracts more customers.\", \"C. Consumption stimulates the desire for higher wages.\", \"D. Familiar arguments for higher wages are outdated.\"]",
      "correct_answer": "A",
      "analysis": "推理判断题。根据题干信息词logic可将答案线索定位至第八段。第八段中作者指出，同样的逻辑仍然成立，即消费推动美国经济的发展，工资更高的工人消费也会更高。也就是说，工资的增长会推动国家经济的发展，因此答案为A。",
      "explanation": "第八段：'The same logic still holds: Consumption drives the American economy, and workers who are paid more can spend more.'",
      "question_order": 47,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 50,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 49,
      "question_text": "What is the basis for higher wages according to the conventional wisdom?",
      "options": "[\"A. Fairness in distribution.\", \"B. Increase in productivity.\", \"C. The priority of economic policymakers.\", \"D. The unerring judgment of market forces.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。根据题干信息词conventional wisdom可将答案线索定位至倒数第四段第一句。倒数第四段第一句指出，传统观点认为，生产率增长是提高工资的唯一途径，因此B项符合题意。",
      "explanation": "倒数第四段第一句：'The conventional wisdom held that productivity growth was the only route to higher wages.'",
      "question_order": 48,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 51,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 50,
      "question_text": "What do we learn about things in the real world in America for the past 50 years or so?",
      "options": "[\"A. People have failed to see a corresponding increase in wages and in productivity.\", \"B. People have been disheartened by the widening gap between the haves and have-nots.\", \"C. People have witnessed a tug of war between Republicans and Democrats over tax cuts.\", \"D. People have seen the link disappearing between productivity and workers' well-being.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。根据题干信息词real world，the past 50 years or so可将答案线索定位至倒数第二段。倒数第二段开头总结道，在现实世界中，情况更为复杂，工资受到雇主和工人之间激烈争夺的影响，而获胜的一直是雇主。随后说明一个具体论据：大约自1970年以来，生产率增幅与工资增幅之间的差距不断扩大，生产率增长了一倍多，而工资增长却远远落后。由此可知，A项符合题意。",
      "explanation": "倒数第二段：'One clear piece of evidence is the widening gap between productivity growth and wage growth since roughly 1970. Productivity has more than doubled; wages have lagged far behind.'",
      "question_order": 49,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 52,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 51,
      "question_text": "What would we expect an editorial board of an academic journal to exhibit in view of its important responsibilities?",
      "options": "[\"A. Insight.\", \"B. Expertise.\", \"C. Integrity.\", \"D. Diversity.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。根据题干信息词an editorial board of an academic journal可将答案线索定位于第一段。第一段有两句话，第一句提到期刊编辑决定发表的内容，这影响一个领域的发展；第二句指出人们的期望，即希望期刊尽其所能建立一个多元化的编委会，反映各种声音、经历和身份。原文中的diverse和选项D的Diversity基本属于原词复现，由此可知选项D为正确答案。",
      "explanation": "第一段最后一句：'You'd hope, then, that journals would do everything they can to establish a diverse editorial board, reflecting a variety of voices, experiences, and identities.'",
      "question_order": 50,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 53,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 52,
      "question_text": "What do we learn from the findings of a new study in Nature Neuroscience?",
      "options": "[\"A. The majority of top psychology and neuroscience journals reflect a variety of voices, experiences and identities.\", \"B. The editorial boards of most psychology and neuroscience journals do influence the direction their field takes.\", \"C. The editorial boards of the most important journals in psychology and neuroscience are male-dominated.\", \"D. The majority of editors in top psychology and neuroscience journals have relevant backgrounds.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。根据题干信息词the findings of a new study in Nature Neuroscience可将答案线索定位于第二段。第二段第二句提到，该研究团队发现，顶尖心理学和神经科学期刊的大多数编辑都是男性。很显然，选项C是对这句话的同义转述，其中male-dominated对应原文中的the majority of editors are male，most important对应原文中的top，故选C。",
      "explanation": "第二段：'The team finds that the majority of editors in top psychology and neuroscience journals are male and based in the United States.'",
      "question_order": 51,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 54,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 53,
      "question_text": "What fact does the author highlight concerning the gender differences in editors of psychology journals?",
      "options": "[\"A. There were quite a few female editors who also distinguished themselves as influential psychology researchers.\", \"B. The number of female editors was simply disproportionate to that of women engaged in psychology research.\", \"C. The proportion of female editors was increasingly lower at senior levels.\", \"D. There were few female editors who could move up to senior positions.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。根据题干信息词gender differences in editors of psychology journals可将答案线索定位于第三段。第三段主要阐述了心理学期刊编辑中的性别差异。该段最后一句提到，女性编辑的比例明显低于女性心理学研究人员的总体比例。选项B是对这句话的同义转述，故为正确答案。",
      "explanation": "第三段最后一句：'Crucially, the proportion of female editors was significantly lower than the overall proportion of women psychology researchers.'",
      "question_order": 52,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 55,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 54,
      "question_text": "What can we infer from the conclusion drawn by the team of the new study on the basis of their findings?",
      "options": "[\"A. Women's views are underrepresented in the editorial boards of top psychology and neuroscience journals.\", \"B. Male editors of top psychology and neuroscience journals tend to be biased against their female colleagues.\", \"C. Male researchers have enough representation in the editorial boards to ensure their publications.\", \"D. Female editors have to struggle to get women's research articles published in academic journals.\"]",
      "correct_answer": "A",
      "analysis": "推理判断题。根据题干信息词the conclusion drawn by the team可将答案线索定位于第五段。第五段引导中的内容就是研究小组根据新发现得出的结论：在心理学和神经科学领域最知名的学术期刊中，男性的想法、价值观和决策偏好在编辑职位上被过度代表了。从另一方面来看，在顶尖心理学和神经科学期刊中，女性编辑占比较小，那么女性的想法、价值观和决策偏好没有在编辑职位上得到充分代表，选项A符合该句推论，故为正确答案。",
      "explanation": "第五段：'Based on their results, the team concludes that \"the ideas, values and decision-making biases of men are overrepresented in the editorial positions of the most recognized academic journals in psychology and neuroscience.\"'",
      "question_order": 53,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 56,
      "section_id": 7,
      "question_type": "single_choice",
      "question_number": 55,
      "question_text": "What does the author suggest we do instead of simply blaming the inequality of editorial boards on tradition?",
      "options": "[\"A. Strike a balance between male and female editors.\", \"B. Increase women's employment in senior positions.\", \"C. Enlarge the body of female academics.\", \"D. Implement overall structural reforms.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。根据题干信息词blaming the inequality of editorial boards on tradition可将答案线索定位于第七段。第七段最后一句提到，我们不应该简单地将编委会的不平等归咎于传统，而应该积极打破这些现有的障碍。这些障碍是什么，需要考生在前寻找。该段开头提到女性编辑数量少不是因为缺乏女性学者，其实女性在科学领域处于不利地位有结构性原因的，随后举例说明，比如女性的工资较低，面临更大的育儿需求，从而导致其发表的论文和获得的经费较少，而论文少，经费低又导致女性学者达不到期刊任命编辑职位的标准，这些都是女性面临的障碍。因此作者建议我们实施整体结构改革，故选项D正确。",
      "explanation": "第七段最后一句：'Rather than simply blaming the inequality of editorial boards on tradition, we should be actively breaking down these existing barriers.'",
      "question_order": 54,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 57,
      "section_id": 8,
      "question_type": "translation",
      "question_number": 56,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "In China, with the arrival of an aging society, the elderly care has received widespread attention. What people talk about the most is what kind of elderly care model should be adopted. Most people believe that the elderly care model needs to be diversified. Through government guidance and social participation, we can establish more and better elderly care service institutions, improve community service centers, encourage home-based self-help elderly care, and promote a model combining family and social elderly care. With the increasing investment in elderly care services from the government and society, elderly care facilities will continue to be upgraded, service quality will be gradually improved, and the elderly will live a more convenient, more comfortable, healthier and happier life.",
      "analysis": "翻译题目，需要学生将中文段落准确翻译成英文，注意语法、词汇和句式结构的正确性",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 55,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    }
  ]
}