{
  "exam_papers": [
    {
      "id": 1,
      "exam_type": "CET-6",
      "year": 2023,
      "month": 12,
      "paper_number": 3,
      "title": "2023年12月大学英语六级考试真题（三）",
      "description": "2023年12月大学英语六级考试真题（第三套），包含写作、阅读理解和翻译三个部分",
      "total_score": 710,
      "time_allowed": 130,
      "questions_count": 32,
      "sections_count": 5,
      "difficulty": "medium",
      "is_active": 1,
      "created_at": "2024-01-01 00:00:00",
      "updated_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_sections": [
    {
      "id": 1,
      "paper_id": 1,
      "section_type": "writing",
      "section_name": "写作部分",
      "section_order": 0,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to write an essay that begins with the sentence \"With their valuable skills and experience, elderly people can continue to make significant contributions to society.\" You can make comments, cite examples or use your personal observations to develop your essay. You should write at least 150 words but no more than 200 words (not including the sentence given).",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "writing",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section A",
      "section_order": 1,
      "time_allowed": 40,
      "directions": "In this section, there is a passage with ten blanks. You are required to select one word for each blank from a list of choices given in a word bank following the passage. Read the passage through carefully before making your choices. Each choice in the bank is identified by a letter. Please mark the corresponding letter for each item on Answer Sheet 2 with a single line through the centre. You may not use any of the words in the bank more than once.",
      "passage_content": "Modern U.S. cities were designed to make exercise unnecessary. Cars and elevators once symbolized urban areas as machines for more efficient living. Now it is clear that these improvements provide great benefits but also ___26___ health costs. Recent studies show that urban ___27___ encourages more driving and is associated with heavier weight. This ___28___ suggests that the layout and design of cities can hinder or promote healthier lifestyle choices and it is ___29___ that urban planners bear this in mind.\n\nUnfortunately, urban planning still centers in large part on solving the problems of the past. Of course cities still need to ___30___ standard public health practices, such as separating toxic facilities from homes and restricting heavy truck traffic through ___31___ residential areas. But it's also important to create healthier cities—and the discussion is already underway. More and more city planners are paying increasing attention to encouraging physical activity by making it easier and safer for people to recreate, walk, bike and take public transportation. Many studies of ___32___ show that people live the longest in environments where physical activity is part of everyday life.\n\nProviding more walkable spaces, better protected bike lanes and more ___33___ spaces are important steps. But even smaller changes can be effective.\n\nCities can close off streets on weekends to encourage communities to get out and walk. They also can provide more seating in public places, so that less-fit residents can rest during their journeys. Using public spaces in cities as places where people can exercise promotes ___34___ , rather than allowing physical activity to become restricted to private gyms with often-expensive monthly fees that ___35___ less wealthy people from joining.",
      "passage_title": "Urban Planning and Health",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section B",
      "section_order": 2,
      "time_allowed": 40,
      "directions": "In this section, you are going to read a passage with ten statements attached to it. Each statement contains information given in one of the paragraphs. Identify the paragraph from which the information is derived. You may choose a paragraph more than once. Each paragraph is marked with a letter. Answer the question by marking the corresponding letter on Answer Sheet 2.",
      "passage_content": "A. You may have heard that learning another language is one method for preventing or at least postponing the onset of dementia. Dementia refers to the loss of cognitive abilities, and one of its most common forms is Alzheimer's disease (阿尔茨海默氏病). At this time, the causes of the disease are not well understood, and consequently, there are no proven steps that people can take to prevent it. Nonetheless, some researchers have suggested that learning a foreign language might help delay the onset of dementia.\n\nB. To explore this possibility more deeply, let's look at some of the common misconceptions about dementia and the aging brain. First of all, dementia is not an inevitable part of the normal aging process. Most older adults do not develop Alzheimer's disease or other forms of dementia. It is also important to remember that dementia is not the same thing as normal forgetfulness. At any age, we might experience difficulty finding the exact word we want or have trouble remembering the name of the person we just met. People with dementia have more serious problems, like feeling confused or getting lost in a familiar place. Think of it this way: If you forget where you parked your car at the mall, that's normal; if you forget how to drive a car, that may be a signal that something more serious is going on.\n\nC. The idea that dementia can be prevented is based on the comparison of the brain to a muscle. When people talk about the brain, they sometimes say things like \"It is important to exercise your brain\" or \"To stay mentally fit, you have to give your brain a workout.\" Although these are colorful analogies, in reality the brain is not a muscle. Unlike muscles, the brain is always active and works even during periods of rest and sleep. In addition, although some muscle cells have a lifespan of only a few days, brain cells last a lifetime. Not only that, but it has been shown that new brain cells are being created throughout one's lifespan.\n\nD. While it makes for a colorful analogy, comparing the brain to a muscle is inaccurate and misleading. So, if the brain is not a muscle, can it still be exercised? Once again, researchers don't know for sure. There are now many computer, online, and mobile device applications that claim to be able to \"train your brain,\" and they typically tap into a variety of cognitive abilities. However, research suggests that although this type of training may improve one's abilities at the tasks themselves, they don't seem to improve other abilities. In other words, practicing a letter-detection task will, over time, improve your letter-detection skills, but it will not necessarily enhance your other perceptual abilities.\n\nE. However, there is some reason to believe that learning languages might be different. The best evidence that foreign language learning confers cognitive benefits comes from research with those who are already bilingual (双语的). Bilingualism most commonly occurs when children are exposed to two languages, either in the home (mom speaks Dutch, dad speaks Spanish) or more formally in early schooling. But bilingualism certainly occurs in adulthood as well.\n\nF. Bilingualism and multilingualism are actually more common than you might think. In fact, it has been estimated that there are fewer monolingual speakers in the world than bilinguals and multilinguals. Although in many countries most inhabitants share just one language, other countries have several official languages. Switzerland, for example, has four official languages: German, French, Italian, and Romansh. Throughout large parts of Africa, Arabic, Swahili, French, and English are often known and used by individuals who speak a different, native language in their home than they do in the marketplace. So bilingualism and multilingualism are to be found throughout the world. And with regard to cognitive abilities, the research on those who speak more than one language paints an encouraging picture.\n\nG. For one thing, bilinguals are better at multitasking. One explanation of this superiority is that speakers of two languages are continually inhibiting one of their languages, and this process of inhibition confers general cognitive benefits to other activities. In fact, bilingual individuals outperform their monolingual counterparts on a variety of cognitive tasks, such as following complex instructions, and switching to new instructions. For the sake of completeness, it should be noted that the advantages of being bilingual are not universal across all cognitive domains. Bilingual individuals have been shown to have smaller vocabularies and to take longer in retrieving words from memory when compared to monolinguals. In the long run, however, the cognitive and linguistic advantages of being bilingual far outweigh these two drawbacks.\n\nH. If the benefits of being bilingual spill over to other aspects of cognition, then we would expect to see a lower incidence of Alzheimer's disease in bilinguals than in monolinguals, or at least a later onset of Alzheimer's for bilinguals. In fact, there is evidence to support this claim. The psychologist Ellen Bialystok and her colleagues obtained the histories of 184 individuals who had made use of a memory clinic in Toronto. For those who showed signs of dementia, the monolinguals in the sample had an average age of 71.4 years at time of onset. The bilinguals, in contrast, received their diagnosis at 75.5 years, on average. In a study of this sort, a difference of four years is highly significant, and could not be explained by other systematic differences between the two groups. For example, the monolinguals reported, on average, a year and a half more schooling than their bilingual counterparts, so the effect was clearly not due to formal education.\n\nI. A separate study, conducted in India, found strikingly similar results: bilingual patients developed symptoms of dementia 4.5 years later than monolinguals, even after other potential factors, such as gender and occupation, were controlled for. In addition, researchers have reported other positive effects of bilingualism for cognitive abilities in later life, even when the person acquired the language in adulthood. Crucially, Bialystok suggested that the positive benefits of being bilingual were only found in those who used both languages all the time.\n\nJ. But encouraging as these kinds of studies are, they still have not established exactly how or why differences between bilinguals and monolinguals exist. Because these studies looked back at the histories of people who were already bilingual, the results can only say that a difference between the two groups was found, but not why that difference occurred. Further research is needed to determine what caused the differences in age of onset between the two groups.\n\nK. Other studies of successful aging suggest that being connected to one's community and having plenty of social interaction is also important in delaying or even preventing the onset of dementia. Once again, however, the results are far less clear than the popular media might lead you to believe. Older individuals who lead active social lives are, almost by definition, healthier than their counterparts who rarely leave their homes or interact with others. So we can't really say whether being socially active prevents the onset of dementia, or if people who don't have dementia are more likely to be socially active.\n\nL. But even if studying a foreign language is not a magical cure-all, there is one thing it will do: It will make you a better speaker of a foreign language. Doing that confers a whole host of advantages we do know about.",
      "passage_title": "Can Learning a Foreign Language Prevent Dementia?",
      "passage_type": "reading",
      "has_multiple_passages": 0,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "paper_id": 1,
      "section_type": "reading",
      "section_name": "阅读理解 - Section C",
      "section_order": 3,
      "time_allowed": 40,
      "directions": "There are 2 passages in this section. Each passage is followed by some questions or unfinished statements. For each of them there are four choices marked A), B), C) and D). You should decide on the best choice and mark the corresponding letter on Answer Sheet 2 with a single line through the centre.",
      "passage_content": "Passage One\n\nResearch is meant to benefit society by raising public awareness and creating products and innovations that enhance development. For research to serve its full purpose, the results must leave the confines of research laboratories and academic journals.\n\nFindings effectively communicated can go a long way to serve the interests of the public. They can help address social injustices or improve treatments offered to patients.\n\nMany researchers seem to be content with sharing the results of their studies in academic journals or at conferences. But few journals allow everybody to read the findings. Even articles freely available are usually written in academic language incomprehensible to the average reader.\n\nFor researchers in the tenure-track system, their main goal is winning tenure, which in part can be achieved by getting a number of papers published in prominent journals. Pressures like this mean community-level outreach is not prioritised.\n\nMany researchers lack the writing skills to describe their results to a general audience. They may also worry about whether the public will understand their findings, or about findings being used to influence controversial policies. These concerns cause some researchers to shy away from communicating their findings outside the academic community.\n\nPropagating research findings beyond academic publications is particularly crucial for addressing certain social discrepancies. It can help families, communities, healthcare providers, policymakers, government agencies and other stakeholders to understand and respond to crises that plague society.\n\nThe benefits of sharing findings flow both ways. Engaging with other researchers and the public can lead to unexpected new connections and new ideas that could suggest fruitful new directions for research.\n\nTo benefit both researchers and the communities, the need to find innovative, accessible ways to share the work cannot be overstated.\n\nInstitutions and funding organisations should support more researchers to publish in open access journals so that the public doesn't have to pay to read them. Institutions and researchers should invest in partnerships that expand capacity for sharing results more broadly.\n\nFurthermore, ethics committees should make it mandatory for researchers to share their results with the public. Every research participant should opt in or out of receiving results, as part of the process of giving informed consent.\n\nThere could be misunderstanding of the findings presented by the researcher because of technical terms. But this can be resolved by researchers engaging the services of professional writers or communication officers to help with translating their study into more accessible language and share it widely with media outlets and the public.\n\nSharing results with the people who are most affected by them makes us better researchers and ensures that our work can be used to improve people's lives. Institutions and collaborators must recognise the value of doing so.\n\nPassage Two\n\nSpiders make their presence felt in late August and through early autumn. This is the mating season of some of the most common varieties, when male house spiders come out of hidden corners to look for females, and garden spiders reach adult size and spin their most dazzling webs.\n\nYet while the spider is a familiar fixture of nursery poems or songs and Halloween decorations, its relationship with humans is complicated. Fear of spiders is common and has serious impacts on the lives of sufferers. Its prevalence appears unrelated to any rational assessment of risk. Spiders in the UK are almost all harmless. Farmland species perform valuable ecosystem services, by preying on insects that are our competitors for crops. But they are a constant source of human anxieties—with a cultural association with witches and wickedness dating back to the middle ages.\n\nDoes this perhaps explain, in part, the lack of data about how spiders are faring in our age of ecological crisis? British butterflies are the most studied group of insects in the world, due to the long tradition of collecting and observing them. But spider conservationists point out that it was only in the 1980s that the classification of house spiders was properly sorted out. And while information about insect populations is gathered by experiments that measure the numbers hitting windscreens or traps, there have been few attempts to count spiders.\n\nThe huge reductions in the numbers of flying insects can only mean a reduction in spiders' food supply. A recent landmark study identified a 75% fall in insect populations between 1989 and 2016, with pesticide use thought to be to blame along with the destruction of wild areas for development. This means the overall picture for spiders is worrying, as it is for most creatures. But conservationists are most concerned about those varieties that are threatened due to habitat loss and fragmentation, which makes it impossible for them to migrate.\n\nOf around 650 spider species regularly recorded in the UK, the majority thrive in marshes and wasteland. Conservation efforts, often led by determined individuals, have helped some species to recover by reintroducing them to new areas. With rewilding now firmly on the environmental policy agenda, the hope is that in future, spiders will be enabled to migrate by themselves, adapting to climate change by moving along wildlife corridors.\n\nIt seems unlikely that spiders will ever attract the same level of human enthusiasm as bees, birds or butterflies, in spite of their unique status as nature's spinners. But as they reveal themselves in all their splendour this autumn, it would be a good thing if more animal lovers recognised the ways in which spiders are simply terrific.",
      "passage_title": "",
      "passage_type": "reading",
      "has_multiple_passages": 1,
      "questions_count": 10,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "paper_id": 1,
      "section_type": "translation",
      "section_name": "翻译部分",
      "section_order": 4,
      "time_allowed": 30,
      "directions": "For this part, you are allowed 30 minutes to translate a passage from Chinese into English. You should write your answer on Answer Sheet 2.",
      "translation_content": "近年来，中国老龄人口持续增长。中国政府正采取各种措施，推进养老服务体系建设，使老年人晚年生活健康幸福。全国兴建了各类养老服务机构。为了提升养老机构的服务质量，政府颁布了一系列标准，加强对养老机构的监管。许多城市为方便老年人用餐，开设了社区食堂，为他们提供价格实惠的饭菜。行动不便的老年人还能享受上门送餐服务。同时，中国还在积极探索居家和社区养老等其他养老模式，以确保所有老年人老有所养。",
      "translation_requirements": "请将以下中文段落准确翻译成英文，注意语法正确和表达流畅",
      "passage_content": "",
      "passage_title": "",
      "passage_type": "translation",
      "has_multiple_passages": 0,
      "questions_count": 1,
      "created_at": "2024-01-01 00:00:00"
    }
  ],
  "exam_questions": [
    {
      "id": 1,
      "section_id": 1,
      "question_type": "essay",
      "question_number": 1,
      "question_text": "Write an essay that begins with the sentence \"With their valuable skills and experience, elderly people can continue to make significant contributions to society.\"",
      "options": "[]",
      "correct_answer": "",
      "analysis": "写作题目，需要学生以给定句子开头，写一篇关于老年人继续为社会做贡献的议论文",
      "explanation": "考查学生的议论文写作能力，包括论点阐述、论证支持和结论总结",
      "question_order": 0,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 2,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 26,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "G",
      "analysis": "动词辨析题。空格前是复合连词but also，前后连接并列成分，空格后是名词短语health costs，由此可知，空格处应填入一个动词原形，与前面的provide构成并列关系，同时与health costs构成动宾搭配。but also前面的内容是这些改进提供了巨大的好处，由此可推断，but also后面的内容是说，但这也带来了健康成本。impose可意为\"使承受\"，impose health cost即\"使人们承受了健康成本\"，符合语境。",
      "explanation": "impose health costs表示\"使人们承受健康成本\"，与前文的benefits形成对比。",
      "question_order": 1,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 3,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 27,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "M",
      "analysis": "名词辨析题。分析句子结构可知，此处是that引导的宾语从句，空格前是形容词urban，空格后是动词第三人称单数encourages，由此可知，该宾语从句缺少主语，空格处应填入名词。上文提到（城市的）改进提供了巨大的好处，但也增加了健康成本，本句承接上文内容，用研究结果说明城市改进给人们带来的不利之处，由此可推断，本句是说，城市\"扩张\"推动了驾驶人数的增多，并与体重增加有关，故sprawl符合语境。",
      "explanation": "urban sprawl表示\"城市扩张\"，是城市规划中的常用术语。",
      "question_order": 2,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 4,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 28,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "A",
      "analysis": "名词辨析题。空格前是指示代词This，空格后是第三人称单数形式的谓语动词suggests，由此可知，空格处应填入一个名词，充当句子的主语。上文讲述了城市扩张推动了驾驶人数的增多，并与体重增加有关，可知这是一种关联性，This指代上文的内容，可知This后面应填入表示\"关联性\"的名词，故correlation符合语境。",
      "explanation": "correlation表示\"相关性，关联\"，指城市扩张与体重增加之间的关联。",
      "question_order": 3,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 5,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 29,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "F",
      "analysis": "形容词辨析题。由空格前的and可知，此处为并列分句，该分句采用了\"it is+形容词或分词+that从句\"的句式，可知空格处应填入一个形容词或分词，充当is的表语。and前面的并列分句指出，城市的布局和设计能够阻碍或促进更健康的生活方式选择，由此可推断，and后面的并列分句是指，城市规划者\"必须\"牢记这一点。It is imperative that...是固定句式，意为\"……必须……\"，故imperative符合语境。",
      "explanation": "imperative表示\"必要的，必须的\"，强调城市规划者必须考虑这一点。",
      "question_order": 4,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 6,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 30,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "E",
      "analysis": "动词辨析题。空格前是need to，空格后是一个名词短语，由此可知，空格处应填入动词原形，构成need to do sth的结构。上文提到，遗憾的是，城市规划在很大程度上仍然以解决过去的问题为中心，由本句首的Of course和still可知，本句仍承上启下，指出问题仍未解决，城市规划仍然需要做出努力。将备选动词代入原文可知，foster符合语境，foster standard public health practices意为\"促进标准的公共卫生实践\"。",
      "explanation": "foster表示\"促进，培养\"，指城市需要促进标准的公共卫生实践。",
      "question_order": 5,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 7,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 31,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "B",
      "analysis": "形容词辨析题。空格前是介词through，空格后是名词短语residential areas，由此可知，空格处应填入一个形容词，与residential一起修饰名词areas。上文提及城市应促进标准的公共卫生实践，此处举例说明，如将有毒设施与住宅分开，限制重型卡车通过居民区，剩余选项中只有dense\"密集的\"符合语境。",
      "explanation": "dense residential areas表示\"密集的居民区\"，是城市规划中的常用表达。",
      "question_order": 6,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 8,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 32,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "I",
      "analysis": "名词辨析题。空格前是介词of，空格后是谓语动词show，由此可知，空格处应填入一个名词，与of一起构成介宾短语。由show后面that引导的宾语从句\"在体育活动成为日常生活一部分的环境中，人们的寿命最长\"可知，填人的名词与寿命长短有关，由此可知，longevity（长寿）符合语境。",
      "explanation": "longevity表示\"长寿\"，指在体育活动成为日常生活一部分的环境中人们寿命更长。",
      "question_order": 7,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 9,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 33,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "K",
      "analysis": "形容词辨析题。空格前是more，空格后是名词spaces，由此可知，空格处应填入一个形容词。前半句指出，提供更多可步行的空间，受到更好保护的自行车道，and连接的并列成分应与其语义一致，将备选形容词代入可知recreational符合语境，即\"更多的娱乐空间\"。",
      "explanation": "recreational spaces表示\"娱乐空间\"，指供人们休闲娱乐的公共场所。",
      "question_order": 8,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 10,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 34,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "D",
      "analysis": "名词辨析题。空格前是第三人称单数形式的谓语动词promotes，空格后是逗号，由此可知，空格处应填入一个名词，与promotes构成动宾关系。前半句提及将城市的公共空间用作人们可以锻炼的地方，空格后的内容指出，而不是让体育活动仅限于私人健身房，因为私人健身房的月费往往很高。分析前后转折关系可知，此处是说，将城市的公共空间用作人们可以锻炼的地方可以促进\"公平\"，equity符合语境。",
      "explanation": "equity表示\"公平，公正\"，指公共空间的使用促进了社会公平。",
      "question_order": 9,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 11,
      "section_id": 2,
      "question_type": "blank_filling",
      "question_number": 35,
      "question_text": "",
      "options": "[\"A. correlation\", \"B. dense\", \"C. deter\", \"D. equity\", \"E. foster\", \"F. imperative\", \"G. impose\", \"H. irrespective\", \"I. longevity\", \"J. navigate\", \"K. recreational\", \"L. rotten\", \"M. sprawl\", \"N. vibrate\", \"O. vicinity\"]",
      "correct_answer": "C",
      "analysis": "动词辨析题。分析句子结构可知，此处是that引导的定语从句，修饰先行词fees，空格前是关系代词that，空格后是less wealthy people from joining，可知that是定语从句的主语，谓语和宾语部分由\".…sb. from doing sth.\"的结构充当，故空格处应填入一个动词，且能构成以上结构。前文提及，而不是让体育活动仅限于私人健身房，因为私人健身房的月费往往很高，由此推断，此处是说高额的费用\"阻止\"不太富裕的人加入。备选动词中deter可以构成deter sb. from doing sth.（阻止某人做某事）的结构，符合语境，故应填入deter。",
      "explanation": "deter表示\"阻止，威慑\"，指高昂的费用阻止了不太富裕的人加入健身房。",
      "question_order": 10,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 12,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 36,
      "question_text": "Research indicates that brain training is likely to boost one's ability at specific tasks, but not one's other cognitive abilities.",
      "options": "[]",
      "correct_answer": "D",
      "analysis": "细节辨认题。由题干关键词信息brain training、tasks和abilities定位到D段。该段第1句提到，研究表明，尽管这种训练可能会提高一个人完成任务所需的能力，但似乎不会提高其他能力，而结合前文，这种训练指的是对大脑的训练，题干显然是对该句的同义转述。",
      "explanation": "D段最后两句：'However, research suggests that although this type of training may improve one's abilities at the tasks themselves, they don't seem to improve other abilities. In other words, practicing a letter-detection task will, over time, improve your letter-detection skills, but it will not necessarily enhance your other perceptual abilities.'",
      "question_order": 11,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 13,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 37,
      "question_text": "According to estimates, the number of people who speak two languages or more is greater than those who speak one language only.",
      "options": "[]",
      "correct_answer": "F",
      "analysis": "同义转述题。由题干关键信息estimates、people who speak two languages or more和those who speak one language only定位到F段第二句。该句提到，据估计，世界上只讲一种语言的人比讲两种语言和多种语言的人更少，可见，题干是对原文的同义表述。题干中的people who speak two languages or more对应原文中的bilinguals和multilinguals；题干中的those who speak one language only对应原文中的monolingual speakers；题干中的the number...is greater than从反面转述原文中的there are fewer...than。",
      "explanation": "F段第二句：'In fact, it has been estimated that there are fewer monolingual speakers in the world than bilinguals and multilinguals.'",
      "question_order": 12,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 14,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 38,
      "question_text": "For the time being, we do not know what causes people to lose their cognitive abilities, or what we can do to prevent it.",
      "options": "[]",
      "correct_answer": "A",
      "analysis": "细节归纳题。由题干关键信息causes和lose their cognitive abilities定位到A段。该段第二句指出，痴呆症是指认知能力的丧失，最常见的一种是阿尔茨海默氏病。随后的第三句则说，人们目前还不清楚这种疾病的病因，因此还没有已经证实有效的措施来预防这种病症。题干是对原文的概括性表述。",
      "explanation": "A段第二、三句：'Dementia refers to the loss of cognitive abilities, and one of its most common forms is Alzheimer's disease. At this time, the causes of the disease are not well understood, and consequently, there are no proven steps that people can take to prevent it.'",
      "question_order": 13,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 15,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 39,
      "question_text": "It is hard to determine whether people who are free from dementia tend to have more social activities, or more social activities keep people away from dementia.",
      "options": "[]",
      "correct_answer": "K",
      "analysis": "同义转述题。由题干关键信息social activities和dementia定位到K段最后一句。定位句指出，我们真的不能断言到底是社交活动能预防痴呆症的发作，还是没有痴呆症的人更有可能在社交方面活跃。题干是对原文的同义表述。题干中的It is hard to determine对应原文中的we can't really say；题干中的people who are free from dementia对应原文中的people who don't have dementia；题干中的keep people away from dementia是对原文中的prevents the onset of dementia的同义表述。",
      "explanation": "K段最后一句：'So we can't really say whether being socially active prevents the onset of dementia, or if people who don't have dementia are more likely to be socially active.'",
      "question_order": 14,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 16,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 40,
      "question_text": "There is evidence that learning foreign languages might be beneficial to boosting one's cognitive abilities.",
      "options": "[]",
      "correct_answer": "E",
      "analysis": "细节辨认题。由题干关键信息evidence和learning foreign languages定位到E段第二句。该句指出，外语学习在认知方面带来益处的最好证据源于针对那些已经会讲两种语言的人的研究。换言之，有证据表明，学习外语对于提高认知能力是有帮助的。题干是对原文的同义表述。题干中的beneficial to boosting one's cognitive abilities对应原文中的confers cognitive benefits。",
      "explanation": "E段第二句：'The best evidence that foreign language learning confers cognitive benefits comes from research with those who are already bilingual.'",
      "question_order": 15,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 17,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 41,
      "question_text": "It was suggested that only those who always spoke two languages could benefit from bilingualism.",
      "options": "[]",
      "correct_answer": "I",
      "analysis": "细节辨认题。由题干关键信息suggested和always spoke two languages定位到I段最后一句。定位句指出，比亚利斯托克提出，会讲两种语言的积极作用只存在于那些一直都使用两种语言的人身上。可见，题干是对原文的同义表述。题干中的benefit from bilingualism对应原文中的positive benefits of being bilingual。",
      "explanation": "I段最后一句：'Crucially, Bialystok suggested that the positive benefits of being bilingual were only found in those who used both languages all the time.'",
      "question_order": 16,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 18,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 42,
      "question_text": "The brain is different from muscles in that it keeps working even when the body is at rest.",
      "options": "[]",
      "correct_answer": "C",
      "analysis": "细节辨认题。由题干关键信息different from muscles和rest定位到C段第四句。根据定位句，与肌肉不同的是，大脑总是活跃的，即使在休息和睡眠期间也在工作。可见，题干是对原文的同义表述。题干中的keeps working对应原文中的is always active and works；题干中的at rest是对原文中的during periods of rest and sleep的表述。",
      "explanation": "C段第四句：'Unlike muscles, the brain is always active and works even during periods of rest and sleep.'",
      "question_order": 17,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 19,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 43,
      "question_text": "People who speak two languages do better at a number of cognitive tasks than those who speak only one language.",
      "options": "[]",
      "correct_answer": "G",
      "analysis": "细节辨认题。由题干关键信息cognitive tasks定位到G段第三句。定位句明确说，讲两种语言的人在各种认知任务上都优于讲一种语言的人，并列举了具体的任务，如遵循复杂的指令和切换到新的指令。可见，题干是对原文的同义表述。题干中的People who speak two languages和those who speak only one language分别对应原文中的bilingual individuals和monolingual counterparts；题干中的do better是对原文中的outperform的表述。",
      "explanation": "G段第三句：'In fact, bilingual individuals outperform their monolingual counterparts on a variety of cognitive tasks, such as following complex instructions, and switching to new instructions.'",
      "question_order": 18,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 20,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 44,
      "question_text": "Dementia is different from being merely forgetful and entails more serious trouble.",
      "options": "[]",
      "correct_answer": "B",
      "analysis": "细节归纳题。由题干关键信息Dementia、merely forgetful和more serious定位到B段第四句和第六句。定位段第四句说，痴呆症与正常的健忘不同，接下来对正常的健忘进行了举例，之后的第六句说，痴呆症患者的问题则要更加严重，可见，题干是对本段这两处信息的概括性表述。题干中的different from对应原文中的is not the same thing as；题干中的merely forgetful对应原文中的normal forgetfulness；题干中的entails more serious trouble对应原文中的have more serious problems。",
      "explanation": "B段第四、六句：'It is also important to remember that dementia is not the same thing as normal forgetfulness. ... People with dementia have more serious problems, like feeling confused or getting lost in a familiar place.'",
      "question_order": 19,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 21,
      "section_id": 3,
      "question_type": "paragraph_matching",
      "question_number": 45,
      "question_text": "It is claimed that more monolinguals suffer from Alzheimer's disease than bilinguals.",
      "options": "[]",
      "correct_answer": "H",
      "analysis": "推理判断题。由题干关键词是monolinguals、Alzheimer's disease和bilinguals定位到H段前两句。该段首句说，如果会讲两种语言的好处扩展到认知的其他方面，那么我们有望看到讲两种语言的人患阿尔茨海默病的几率低于讲一种语言的人，或者至少讲两种语言的人的发病时间会更晚。随后的第二句话说，是有证据支持这一说法的。可见，题干是对这两句内容的概括性表述。题干中的more monolinguals suffer from Alzheimer's disease than bilinguals从后面转述原文中的lower incidence of Alzheimer's disease in bilinguals than in monolinguals。",
      "explanation": "H段前两句：'If the benefits of being bilingual spill over to other aspects of cognition, then we would expect to see a lower incidence of Alzheimer's disease in bilinguals than in monolinguals, or at least a later onset of Alzheimer's for bilinguals. In fact, there is evidence to support this claim.'",
      "question_order": 20,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 22,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 46,
      "question_text": "How can research serve its full purpose according to the author?",
      "options": "[\"A) With researchers being aware of public interests.\", \"B) With its findings published in prominent journals.\", \"C) With researchers creating products that enhance social development.\", \"D) With its findings properly communicated beyond the academic circle.\"]",
      "correct_answer": "D",
      "analysis": "细节辨认题。根据题干信息词serve its full purpose可将答案线索定位至第一段第二句。第一段第二句直接给出答案：要使研究充分发挥作用，研究成果必须走出研究实验室和学术期刊的范围，即研究成果在学术界以外也得到传播，故D项符合题意。",
      "explanation": "第一段第二句：'For research to serve its full purpose, the results must leave the confines of research laboratories and academic journals.'",
      "question_order": 21,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 23,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 47,
      "question_text": "Why do ordinary readers find it difficult to access the results of researchers' studies?",
      "options": "[\"A) They cannot understand the academic language used for reporting these results.\", \"B) They feel intimidated by the jargon researchers use to describe their findings.\", \"C) They do not attend conferences where these results are freely available.\", \"D) They have few chances to locate the journals that publish these findings.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。根据题干信息词ordinary readers和access the results of researchers' studies可将答案线索定位至第三段。第二段第一句提及，许多研究人员似乎满足于在学术期刊或会议上分享他们的研究成果。随后表明这对普通读者的困扰：没几家期刊允许所有人阅读研究成果，即使是免费提供的文章，通常也是用普通读者无法理解的学术语言撰写的。因此A项符合题意，cannot understand是原文中incomprehensible的同义表述，academic language是原词复现。",
      "explanation": "第三段最后一句：'Even articles freely available are usually written in academic language incomprehensible to the average reader.'",
      "question_order": 22,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 24,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 48,
      "question_text": "What is one of the reasons some researchers won't prioritise communicating their findings to the public?",
      "options": "[\"A) They can thrive on the papers published.\", \"B) Their top consideration is to win tenure.\", \"C) Their main goal is gaining recognition in their field.\", \"D) They have to struggle to reach out to the community.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。根据题干信息词prioritise可将答案线索定位至第四段最后一句。第四段最后一句提及，这样的压力意味着不会优先考虑向社会上的人提供外展服务，就是前文作者所说的与公众分享研究成果，压力即该段第一句所说的通过在著名期刊上发表多篇论文获得终身教职，因此B项符合题意，题干中的communicating their findings to the public是原文中community-level outreach的同义表述。",
      "explanation": "第四段：'For researchers in the tenure-track system, their main goal is winning tenure, which in part can be achieved by getting a number of papers published in prominent journals. Pressures like this mean community-level outreach is not prioritised.'",
      "question_order": 23,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 25,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 49,
      "question_text": "How can sharing findings benefit researchers themselves?",
      "options": "[\"A) By helping them to identify new research directions.\", \"B) By enabling them to understand crises plaguing society.\", \"C) By enabling them to effectively address social discrepancies.\", \"D) By helping them to forge ties with government agencies.\"]",
      "correct_answer": "A",
      "analysis": "细节辨认题。根据题干信息词sharing findings和benefit可将答案线索定位至第七段。第七段第一句指出，分享研究成果的好处是双向的。随后解释道，与其他研究人员和公众接触可以产生意想不到的新联系和新想法，从而为研究提供成果丰硕的新方向，因此A项符合题意。",
      "explanation": "第七段：'The benefits of sharing findings flow both ways. Engaging with other researchers and the public can lead to unexpected new connections and new ideas that could suggest fruitful new directions for research.'",
      "question_order": 24,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 26,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 50,
      "question_text": "Why are researchers advised to engage the services of professional writers or communication officers?",
      "options": "[\"A) To satisfy ethics committees' mandatory requirements of researchers.\", \"B) To translate their study into languages accessible to readers overseas.\", \"C) To make their publications correctly understood by the public.\", \"D) To render their findings acceptable by prominent journals.\"]",
      "correct_answer": "C",
      "analysis": "推理判断题。根据题干信息词professional writers or communication officers可将答案线索定位至倒数第二段。倒数第二段第一句提到，由于使用专业术语，公众可能会对研究人员提出的研究结果产生误解。随后补充道，但这可以通过研究人员聘请专业撰稿人或宣传人员来解决，他们可以帮助将研究成果翻译成更通俗易懂的语言，与媒体和公众广泛分享。由此可知，C项符合题意，原文中的accessible意为\"容易理解的，易懂的\"。",
      "explanation": "倒数第二段：'There could be misunderstanding of the findings presented by the researcher because of technical terms. But this can be resolved by researchers engaging the services of professional writers or communication officers to help with translating their study into more accessible language and share it widely with media outlets and the public.'",
      "question_order": 25,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 27,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 51,
      "question_text": "What do we learn about spiders in the UK since the middle ages?",
      "options": "[\"A) They have been generally misconceived.\", \"B) They have adversely impacted crop growth.\", \"C) They have been a constant reminder of bad luck.\", \"D) They have made their presence felt when spinning webs.\"]",
      "correct_answer": "A",
      "analysis": "推理判断题。根据题干信息词spiders in the UK和the middle ages可将答案线索定位于第二段。第二段提到，害怕蜘蛛是一种常见的现象，但其实英国的蜘蛛几乎都是无害的。农田蜘蛛通过捕食与我们争夺作物的昆虫，提供了有价值的生态系统服务。但它们是人类焦虑的持续来源——与\"女巫\"和\"邪恶\"的文化联系可以追溯到中世纪。也就是说，自中世纪以来，由于人们把蜘蛛与女巫和邪恶联系在一起，所以人们普遍害怕蜘蛛，但事实上，英国的蜘蛛几乎是无害的，还给人类提供了有价值的生态系统服务。由此可知，人们对蜘蛛普遍存在误解，故选项A正确。",
      "explanation": "第二段最后两句：'Spiders in the UK are almost all harmless. Farmland species perform valuable ecosystem services, by preying on insects that are our competitors for crops. But they are a constant source of human anxieties—with a cultural association with witches and wickedness dating back to the middle ages.'",
      "question_order": 26,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 28,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 52,
      "question_text": "What have spiders been associated with in the UK for centuries?",
      "options": "[\"A) Harm.\", \"B) Evil.\", \"C) Suffering.\", \"D) Aggression.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。根据题干信息词spiders been associated with可将答案线索定位于第二段。第二段最后一句话提到，但它们是人类焦虑的持续来源——与\"女巫\"和\"邪恶\"的文化联系可以追溯到中世纪。由此可知，自中世纪以来，蜘蛛在英国一直被认为与邪恶有关，故选B。",
      "explanation": "第二段最后一句：'But they are a constant source of human anxieties—with a cultural association with witches and wickedness dating back to the middle ages.'",
      "question_order": 27,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 29,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 53,
      "question_text": "What partly accounts for the reduction in spiders' food supply?",
      "options": "[\"A) The long tradition of collecting insects.\", \"B) Fast reproduction of their competitors.\", \"C) Chemicals used for killing insects.\", \"D) The extinction of a lot of wildlife.\"]",
      "correct_answer": "C",
      "analysis": "细节辨认题。根据题干信息词the reduction in spiders' food supply可将答案线索定位于第四段。第四段第一句就提到，飞虫数量的大幅减少只能意味着蜘蛛的食物供应减少。接着第二句解释了原因，即使用杀虫剂以及因为发展而破坏野生区域被认为是罪魁祸首，所以蜘蛛的食物供应减少的原因有两点，一是杀虫剂的使用，二是野生区域的破坏。选项C是对第一点原因的同义表述，故为正确答案。",
      "explanation": "第四段第二句：'A recent landmark study identified a 75% fall in insect populations between 1989 and 2016, with pesticide use thought to be to blame along with the destruction of wild areas for development.'",
      "question_order": 28,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 30,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 54,
      "question_text": "What does the passage say is conservationists' biggest worry?",
      "options": "[\"A) A variety of spiders are threatened due to pollution of marshes and wasteland.\", \"B) Certain species of spiders are endangered due to loss of their natural homes.\", \"C) An increasing number of spiders are being killed by deadly pesticides.\", \"D) More and more spider species are found losing their ability to migrate.\"]",
      "correct_answer": "B",
      "analysis": "细节辨认题。根据题干信息词conservationists' biggest worry可将答案线索定位于第四段。第四段最后一句提到，但自然环境保护主义者最关心的是那些因栖息地丧失和碎片化而受到威胁的品种，这些因素使它们无法迁徙。由此可知，自然环境保护主义者最担心的是，某些品种的蜘蛛因为失去栖息地而没有地方迁徙，故选项B正确。",
      "explanation": "第四段最后一句：'But conservationists are most concerned about those varieties that are threatened due to habitat loss and fragmentation, which makes it impossible for them to migrate.'",
      "question_order": 29,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 31,
      "section_id": 4,
      "question_type": "single_choice",
      "question_number": 55,
      "question_text": "What wish does the author express close to the end of the passage?",
      "options": "[\"A) More people would recognise spiders' unique status in the ecosystem.\", \"B) People would show greater enthusiasm for spiders than for butterflies.\", \"C) There would be sufficient corridors for spiders to move along.\", \"D) There would be more people appreciating spiders' splendour.\"]",
      "correct_answer": "D",
      "analysis": "推理判断题。根据题干信息词the end of the passage可将答案线索定位于最后一段。最后一段提到，蜘蛛也许不太可能像蜜蜂、鸟类或蝴蝶那样吸引人类的热情，随后通过转折词But表达了自己的愿景，即\"当它们在今年秋天展现出光彩时，如果有更多的动物爱好者认识到蜘蛛在某些方面其实很神奇，那将是一件好事\"。所以选项D正确。",
      "explanation": "最后一段最后一句：'But as they reveal themselves in all their splendour this autumn, it would be a good thing if more animal lovers recognised the ways in which spiders are simply terrific.'",
      "question_order": 30,
      "score": 1,
      "created_at": "2024-01-01 00:00:00"
    },
    {
      "id": 32,
      "section_id": 5,
      "question_type": "translation",
      "question_number": 56,
      "question_text": "Translate the Chinese passage into English.",
      "options": "[]",
      "correct_answer": "",
      "analysis": "翻译题目，需要学生将中文段落准确翻译成英文，注意语法、词汇和句式结构的正确性",
      "explanation": "考查学生的汉译英能力，包括词汇选择、语法结构、句式转换和语言表达的准确性",
      "question_order": 31,
      "score": 106,
      "created_at": "2024-01-01 00:00:00"
    }
  ]
}